{
  "date": "2026-02-10",
  "paper_id": "2602.08829",
  "title": "WildReward: Learning Reward Models from In-the-Wild Human Interactions",
  "authors": [
    "Hao Peng",
    "Yunjia Qi",
    "Xiaozhi Wang",
    "Zijun Yao",
    "Lei Hou",
    "Juanzi Li"
  ],
  "abstract": "WildReward demonstrates that reward models can be effectively trained from in-the-wild user interactions using ordinal regression, achieving performance comparable to traditional methods while benefiting from user diversity. Reward models (RMs) are crucial for the training of large language models (LLMs), yet they typically rely on large-scale human-annotated preference pairs. With the widespread deployment of LLMs, in-the-wild interactions have emerged as a rich source of implicit reward signals. This raises the question: Can we develop reward models directly from in-the-wild interactions ? In this work, we explore this possibility by adopting WildChat as an interaction source and proposing a pipeline to extract reliable human feedback, yielding 186k high-quality instances for training WildReward via ordinal regression directly on user feedback without preference pairs. Extensive experiments demonstrate that WildReward achieves comparable or even superior performance compared to conventional reward models , with improved calibration and cross-sample consistency. We also observe that WildReward benefits directly from user diversity, where more users yield stronger reward models . Finally, we apply WildReward to online DPO training and observe significant improvements across various tasks. Code and data are released at https://github.com/THU-KEG/WildReward.",
  "summary_en": "WildReward demonstrates that reward models can be effectively trained from in-the-wild user interactions using ordinal regression, achieving performance comparable to traditional methods while benefiting from user diversity.",
  "summary_zh": "WildReward 表明，利用序数回归基于野外用户交互可有效训练奖励模型，在达到与传统方法相当性能的同时受益于用户多样性。",
  "hf_url": "https://huggingface.co/papers/2602.08829",
  "arxiv_url": "https://arxiv.org/abs/2602.08829",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.08829",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-19T06:03:38.633455+00:00"
}