{
  "date": "2026-02-10",
  "paper_id": "2602.07085",
  "title": "QuantaAlpha: An Evolutionary Framework for LLM-Driven Alpha Mining",
  "authors": [
    "Jun Han",
    "Shuo Zhang",
    "Wei Li",
    "Zhi Yang",
    "Yifan Dong",
    "Tu Hu",
    "Jialuo Yuan",
    "Xiaomin Yu",
    "Yumo Zhu",
    "Fangqi Lou",
    "Xin Guo",
    "Zhaowei Liu",
    "Tianyi Jiang",
    "Ruichuan An",
    "Jingping Liu",
    "Biao Wu",
    "Rongze Chen",
    "Kunyi Wang",
    "Yifan Wang",
    "Sen Hu",
    "Xinbing Kong",
    "Liwen Zhang"
  ],
  "abstract": "Financial markets are noisy and non-stationary, making alpha mining highly sensitive to noise in backtesting results and sudden market regime shifts. While recent agentic frameworks improve alpha mining automation, they often lack controllable multi-round search and reliable reuse of validated experience. To address these challenges, we propose QuantaAlpha, an evolutionary alpha mining framework that treats each end-to-end mining run as a trajectory and improves factors through trajectory-level mutation and crossover operations. QuantaAlpha localizes suboptimal steps in each trajectory for targeted revision and recombines complementary high-reward segments to reuse effective patterns, enabling structured exploration and refinement across mining iterations. During factor generation, QuantaAlpha enforces semantic consistency across the hypothesis, factor expression, and executable code, while constraining the complexity and redundancy of the generated factor to mitigate crowding. Extensive experiments on the China Securities Index 300 (CSI 300) demonstrate consistent gains over strong baseline models and prior agentic systems. When utilizing GPT-5.2, QuantaAlpha achieves an Information Coefficient (IC) of 0.1501, with an Annualized Rate of Return (ARR) of 27.75% and a Maximum Drawdown (MDD) of 7.98%. Moreover, factors mined on CSI 300 transfer effectively to the China Securities Index 500 (CSI 500) and the Standard & Poor's 500 Index (S&P 500), delivering 160% and 137% cumulative excess return over four years, respectively, which indicates strong robustness of QuantaAlpha under market distribution shifts.",
  "summary_en": "Financial markets are noisy and non-stationary, making alpha mining sensitive to backtesting noise and regime shifts, while existing agentic frameworks lack controllable multi-round search and reliable reuse of validated experience. QuantaAlpha addresses these challenges through an evolutionary framework that treats each mining run as a trajectory, improving factors via trajectory-level mutation and crossover operations that localize suboptimal steps for targeted revision and recombine complementary high-reward segments to reuse effective patterns. The framework enforces semantic consistency across hypothesis, factor expression, and executable code while constraining complexity and redundancy to mitigate crowding. Extensive experiments on the China Securities Index 300 (CSI 300) demonstrate consistent gains, with GPT-5.2 achieving an Information Coefficient (IC) of 0.1501, Annualized Rate of Return (ARR) of 27.75%, and Maximum Drawdown (MDD) of 7.98%, and factors transferring effectively to the China Securities Index 500 (CSI 500) and Standard & Poor's 500 Index (S&P 500) to deliver 160% and 137% cumulative excess return over four years, respectively.",
  "summary_zh": "金融市场具有嘈杂且非平稳的特性，使得阿尔法挖掘对回测噪声和机制转换敏感，而现有的智能体框架缺乏可控的多轮搜索和已验证经验的可靠复用。QuantaAlpha通过进化框架应对这些挑战，将每次挖掘运行视为一条轨迹，通过轨迹级变异和交叉操作来改进因子：前者定位次优步骤以进行针对性修正，后者重组互补的高收益片段以复用有效模式。该框架在假设、因子表达式和可执行代码之间强制保持语义一致性，同时约束复杂度和冗余以缓解拥挤。在沪深300指数（CSI 300）上的大量实验表明性能持续提升，其中GPT-5.2实现了0.1501的信息系数（IC）、27.75%的年化收益率（ARR）和7.98%的最大回撤（MDD）；因子有效迁移至中证500指数（CSI 500）和标普500指数（S&P 500），四年内分别实现160%和137%的累计超额收益。",
  "hf_url": "https://huggingface.co/papers/2602.07085",
  "arxiv_url": "https://arxiv.org/abs/2602.07085",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.07085",
  "github_url": "https://github.com/QuantaAlpha/QuantaAlpha",
  "upvotes": 181,
  "fetched_at": "2026-02-19T06:02:36.702701+00:00"
}