{
  "date": "2026-02-10",
  "paper_id": "2602.05708",
  "title": "Cost-Efficient RAG for Entity Matching with LLMs: A Blocking-based Exploration",
  "authors": [
    "Chuangtao Ma",
    "Zeyu Zhang",
    "Arijit Khan",
    "Sebastian Schelter",
    "Paul Groth"
  ],
  "abstract": "CE-RAG4EM reduces computational overhead in large-scale entity matching by implementing blocking-based batch retrieval and generation while maintaining competitive matching quality. Retrieval-augmented generation (RAG) enhances LLM reasoning in knowledge-intensive tasks, but existing RAG pipelines incur substantial retrieval and generation overhead when applied to large-scale entity matching . To address this limitation, we introduce CE-RAG4EM, a cost-efficient RAG architecture that reduces computation through blocking-based batch retrieval and generation. We also present a unified framework for analyzing and evaluating RAG systems for entity matching , focusing on blocking-aware optimizations and retrieval granularity. Extensive experiments suggest that CE-RAG4EM can achieve comparable or improved matching quality while substantially reducing end-to-end runtime relative to strong baselines. Our analysis further reveals that key configuration parameters introduce an inherent trade-off between performance and overhead, offering practical guidance for designing efficient and scalable RAG systems for entity matching and data integration .",
  "summary_en": "CE-RAG4EM reduces computational overhead in large-scale entity matching by implementing blocking-based batch retrieval and generation while maintaining competitive matching quality.",
  "summary_zh": "CE-RAG4EM通过实现基于分块的批量检索与生成，在保持有竞争力匹配质量的同时，降低大规模实体匹配的计算开销。",
  "hf_url": "https://huggingface.co/papers/2602.05708",
  "arxiv_url": "https://arxiv.org/abs/2602.05708",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05708",
  "github_url": "https://github.com/machuangtao/CE-RAG4EM",
  "upvotes": 1,
  "fetched_at": "2026-02-19T06:01:55.820634+00:00"
}