{
  "date": "2026-02-10",
  "paper_id": "2602.08990",
  "title": "InternAgent-1.5: A Unified Agentic Framework for Long-Horizon Autonomous Scientific Discovery",
  "authors": [
    "Shiyang Feng",
    "Runmin Ma",
    "Xiangchao Yan",
    "Yue Fan",
    "Yusong Hu",
    "Songtao Huang",
    "Shuaiyu Zhang",
    "Zongsheng Cao",
    "Tianshuo Peng",
    "Jiakang Yuan",
    "Zijie Guo",
    "Zhijie Zhong",
    "Shangheng Du",
    "Weida Wang",
    "Jinxin Shi",
    "Yuhao Zhou",
    "Xiaohan He",
    "Zhiyin Yu",
    "Fangchen Yu",
    "Qihao Zheng",
    "Jiamin Wu",
    "Mianxin Liu"
  ],
  "abstract": "InternAgent-1.5 is a unified system for autonomous scientific discovery that integrates computational modeling and experimental research through coordinated subsystems for generation, verification, and evolution. We introduce InternAgent-1.5, a unified system designed for end-to-end scientific discovery across computational and empirical domains. The system is built on a structured architecture composed of three coordinated subsystems for generation, verification, and evolution. These subsystems are supported by foundational capabilities for deep research , solution optimization , and long horizon memory . The architecture allows InternAgent-1.5 to operate continuously across extended discovery cycles while maintaining coherent and improving behavior. It also enables the system to coordinate computational modeling and laboratory experimentation within a single unified system . We evaluate InternAgent-1.5 on scientific reasoning benchmarks such as GAIA, HLE, GPQA, and FrontierScience, and the system achieves leading performance that demonstrates strong foundational capabilities. Beyond these benchmarks, we further assess two categories of discovery tasks. In algorithm discovery tasks, InternAgent-1.5 autonomously designs competitive methods for core machine learning problems. In empirical discovery tasks, it executes complete computational or wet lab experiments and produces scientific findings in earth, life, biological, and physical domains. Overall, these results show that InternAgent-1.5 provides a general and scalable framework for autonomous scientific discovery .",
  "summary_en": "InternAgent-1.5 is a unified system for autonomous scientific discovery that integrates computational modeling and experimental research through coordinated subsystems for generation, verification, and evolution.",
  "summary_zh": "InternAgent-1.5是一个统一的自主科学发现系统，通过协调的生成、验证与演化子系统集成计算建模与实验研究。",
  "hf_url": "https://huggingface.co/papers/2602.08990",
  "arxiv_url": "https://arxiv.org/abs/2602.08990",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.08990",
  "github_url": "https://github.com/InternScience/InternAgent",
  "upvotes": 69,
  "fetched_at": "2026-02-19T06:03:43.577684+00:00"
}