{
  "date": "2026-02-10",
  "paper_id": "2602.08794",
  "title": "MOVA: Towards Scalable and Synchronized Video-Audio Generation",
  "authors": [
    "SII-OpenMOSS Team",
    "Donghua Yu",
    "Mingshu Chen",
    "Qi Chen",
    "Qi Luo",
    "Qianyi Wu",
    "Qinyuan Cheng",
    "Ruixiao Li",
    "Tianyi Liang",
    "Wenbo Zhang",
    "Wenming Tu",
    "Xiangyu Peng",
    "Yang Gao",
    "Yanru Huo",
    "Ying Zhu",
    "Yinze Luo",
    "Yiyang Zhang",
    "Yuerong Song",
    "Zhe Xu",
    "Zhiyu Zhang",
    "Chenchen Yang",
    "Cheng Chang"
  ],
  "abstract": "MOVA is an open-source model that generates synchronized audio-visual content using a Mixture-of-Experts architecture with 32 billion parameters, supporting image-text to video-audio generation tasks. Audio is indispensable for real-world video, yet generation models have largely overlooked audio components. Current approaches to producing audio-visual content often rely on cascaded pipelines, which increase cost, accumulate errors, and degrade overall quality. While systems such as Veo 3 and Sora 2 emphasize the value of simultaneous generation, joint multimodal modeling introduces unique challenges in architecture, data, and training. Moreover, the closed-source nature of existing systems limits progress in the field. In this work, we introduce MOVA (MOSS Video and Audio), an open-source model capable of generating high-quality, synchronized audio-visual content , including realistic lip-synced speech , environment-aware sound effects , and content-aligned music . MOVA employs a Mixture-of-Experts ( MoE ) architecture, with a total of 32B parameters, of which 18B are active during inference. It supports IT2VA (Image-Text to Video-Audio) generation task. By releasing the model weights and code, we aim to advance research and foster a vibrant community of creators. The released codebase features comprehensive support for efficient inference , LoRA fine-tuning , and prompt enhancement .",
  "summary_en": "MOVA is an open-source model that generates synchronized audio-visual content using a Mixture-of-Experts architecture with 32 billion parameters, supporting image-text to video-audio generation tasks.",
  "summary_zh": "MOVA是一款采用混合专家（Mixture-of-Experts）架构、拥有320亿参数的开源模型，可生成同步的音视频内容，支持图文到音视频生成任务。",
  "hf_url": "https://huggingface.co/papers/2602.08794",
  "arxiv_url": "https://arxiv.org/abs/2602.08794",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.08794",
  "github_url": "https://github.com/OpenMOSS/MOVA",
  "upvotes": 151,
  "fetched_at": "2026-02-19T06:03:32.240922+00:00"
}