{
  "date": "2026-02-10",
  "paper_id": "2602.07075",
  "title": "LatentChem: From Textual CoT to Latent Thinking in Chemical Reasoning",
  "authors": [
    "Xinwu Ye",
    "Yicheng Mao",
    "Jia Zhang",
    "Yimeng Liu",
    "Li Hao",
    "Fang Wu",
    "Zhiwei Li",
    "Yuxuan Liao",
    "Zehong Wang",
    "Zhiyuan Liu",
    "Zhenfei Yin",
    "Li Yuan",
    "Philip Torr",
    "Huan Sun",
    "Xiangxiang Zeng",
    "Mengdi Wang",
    "Le Cong",
    "Shenghua Gao",
    "Xiangru Tang"
  ],
  "abstract": "LatentChem enables chemical reasoning through continuous latent space computations instead of discrete textual tokens, achieving superior performance and efficiency compared to traditional chain-of-thought approaches. Chemical large language models (LLMs) predominantly rely on explicit Chain-of-Thought (CoT) in natural language to perform complex reasoning. However, chemical reasoning is inherently continuous and structural, and forcing it into discrete linguistic tokens introduces a fundamental representation mismatch that constrains both efficiency and performance. We introduce LatentChem, a latent reasoning interface that decouples chemical computation from textual generation , enabling models to perform multi-step reasoning directly in continuous latent space while emitting language only for final outputs. Remarkably, we observe a consistent emergent behavior: when optimized solely for task success, models spontaneously internalize reasoning, progressively abandoning verbose textual derivations in favor of implicit latent computation. This shift is not merely stylistic but computationally advantageous. Across diverse chemical reasoning benchmarks, LatentChem achieves a 59.88\\% non-tie win rate over strong CoT-based baselines on ChemCoTBench , while delivering a 10.84times average inference speedup . Our results provide empirical evidence that chemical reasoning is more naturally and effectively realized as continuous latent dynamics rather than discretized linguistic trajectories.",
  "summary_en": "LatentChem enables chemical reasoning through continuous latent space computations instead of discrete textual tokens, achieving superior performance and efficiency compared to traditional chain-of-thought approaches.",
  "summary_zh": "LatentChem通过连续潜在空间计算而非离散文本token实现化学推理，相较于传统思维链方法取得了更优的性能与效率。",
  "hf_url": "https://huggingface.co/papers/2602.07075",
  "arxiv_url": "https://arxiv.org/abs/2602.07075",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.07075",
  "github_url": "https://github.com/xinwuye/LatentChem",
  "upvotes": 18,
  "fetched_at": "2026-02-19T06:02:32.477251+00:00"
}