{
  "date": "2026-02-10",
  "paper_id": "2602.09007",
  "title": "GEBench: Benchmarking Image Generation Models as GUI Environments",
  "authors": [
    "Haodong Li",
    "Jingwei Wu",
    "Quan Sun",
    "Guopeng Li",
    "Juanxi Tian",
    "Huanyu Zhang",
    "Yanlin Lai",
    "Ruichuan An",
    "Hongbo Peng",
    "Yuhong Dai",
    "Chenxi Li",
    "Chunmei Qing",
    "Jia Wang",
    "Ziyang Meng",
    "Zheng Ge",
    "Xiangyu Zhang",
    "Daxin Jiang"
  ],
  "abstract": "A new benchmark and evaluation metric are introduced for assessing temporal coherence and dynamic interaction in GUI generation models, revealing significant challenges in maintaining consistency over extended interaction sequences. Recent advancements in image generation models have enabled the prediction of future Graphical User Interface (GUI) states based on user instructions. However, existing benchmarks primarily focus on general domain visual fidelity , leaving the evaluation of state transitions and temporal coherence in GUI-specific contexts underexplored. To address this gap, we introduce GEBench , a comprehensive benchmark for evaluating dynamic interaction and temporal coherence in GUI generation . GEBench comprises 700 carefully curated samples spanning five task categories, covering both single-step interactions and multi-step trajectories across real-world and fictional scenarios, as well as grounding point localization. To support systematic evaluation, we propose GE-Score , a novel five-dimensional metric that assesses Goal Achievement , Interaction Logic , Content Consistency , UI Plausibility , and Visual Quality . Extensive evaluations on current models indicate that while they perform well on single-step transitions, they struggle significantly with maintaining temporal coherence and spatial grounding over longer interaction sequences. Our findings identify icon interpretation, text rendering, and localization precision as critical bottlenecks. This work provides a foundation for systematic assessment and suggests promising directions for future research toward building high-fidelity generative GUI environments. The code is available at: https://github.com/stepfun-ai/ GEBench .",
  "summary_en": "A new benchmark and evaluation metric are introduced for assessing temporal coherence and dynamic interaction in GUI generation models, revealing significant challenges in maintaining consistency over extended interaction sequences.",
  "summary_zh": "研究者引入了新的基准测试与评估指标，用于评估GUI生成模型的时间连贯性与动态交互，揭示了在扩展交互序列中保持一致性方面存在重大挑战。",
  "hf_url": "https://huggingface.co/papers/2602.09007",
  "arxiv_url": "https://arxiv.org/abs/2602.09007",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.09007",
  "github_url": "https://github.com/stepfun-ai/GEBench",
  "upvotes": 38,
  "fetched_at": "2026-02-19T06:03:47.845871+00:00"
}