{
  "date": "2026-02-05",
  "paper_id": "2601.22954",
  "title": "Residual Context Diffusion Language Models",
  "authors": [
    "Yuezhou Hu",
    "Harman Singh",
    "Monishwaran Maheswaran",
    "Haocheng Xi",
    "Coleman Hooper",
    "Jintao Zhang",
    "Aditya Tomar",
    "Michael W. Mahoney",
    "Sewon Min",
    "Mehrdad Farajtabar",
    "Kurt Keutzer",
    "Amir Gholami",
    "Chenfeng Xu"
  ],
  "abstract": "Residual Context Diffusion (RCD) enhances diffusion large language models by recycling discarded token information through contextual residuals, improving accuracy with minimal computational overhead. Diffusion Large Language Models (dLLMs) have emerged as a promising alternative to purely autoregressive language models because they can decode multiple tokens in parallel. However, state-of-the-art block-wise dLLMs rely on a \"remasking\" mechanism that decodes only the most confident tokens and discards the rest, effectively wasting computation. We demonstrate that recycling computation from the discarded tokens is beneficial, as these tokens retain contextual information useful for subsequent decoding iterations. In light of this, we propose Residual Context Diffusion (RCD), a module that converts these discarded token representations into contextual residuals and injects them back for the next denoising step. RCD uses a decoupled two-stage training pipeline to bypass the memory bottlenecks associated with backpropagation . We validate our method on both long CoT reasoning (SDAR) and short CoT instruction following (LLaDA) models. We demonstrate that a standard dLLM can be efficiently converted to the RCD paradigm with merely ~1 billion tokens. RCD consistently improves frontier dLLMs by 5-10 points in accuracy with minimal extra computation overhead across a wide range of benchmarks. Notably, on the most challenging AIME tasks , RCD nearly doubles baseline accuracy and attains up to 4-5x fewer denoising steps at equivalent accuracy levels.",
  "summary_en": "Residual Context Diffusion (RCD) enhances diffusion large language models by recycling discarded token information through contextual residuals, improving accuracy with minimal computational overhead.",
  "summary_zh": "残差上下文扩散（RCD）通过上下文残差回收被丢弃的token信息，以极低的计算开销提升扩散大语言模型的准确性。",
  "hf_url": "https://huggingface.co/papers/2601.22954",
  "arxiv_url": "https://arxiv.org/abs/2601.22954",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22954",
  "github_url": "https://github.com/yuezhouhu/residual-context-diffusion",
  "upvotes": 33,
  "fetched_at": "2026-02-19T05:27:16.528172+00:00"
}