{
  "date": "2026-02-05",
  "paper_id": "2602.03979",
  "title": "Likelihood-Based Reward Designs for General LLM Reasoning",
  "authors": [
    "Ariel Kwiatkowski",
    "Natasha Butt",
    "Ismail Labiad",
    "Julia Kempe",
    "Yann Ollivier"
  ],
  "abstract": "Log-probability rewards derived from the reference answer's likelihood outperform binary rewards in chain-of-thought fine-tuning across both verifiable and non-verifiable reasoning benchmarks. Fine-tuning large language models (LLMs) on reasoning benchmarks via reinforcement learning requires a specific reward function , often binary, for each benchmark. This comes with two potential limitations: the need to design the reward, and the potentially sparse nature of binary rewards . Here, we systematically investigate rewards derived from the probability or log-probability of emitting the reference answer (or any other prompt continuation present in the data), which have the advantage of not relying on specific verifiers and being available at scale. Several recent works have advocated for the use of similar rewards (e.g., VeriFree, JEPO, RLPR, NOVER). We systematically compare variants of likelihood-based rewards with standard baselines, testing performance both on standard mathematical reasoning benchmarks , and on long-form answers where no external verifier is available. We find that using the log-probability of the reference answer as the reward for chain-of-thought (CoT) learning is the only option that performs well in all setups. This reward is also consistent with the next-token log-likelihood loss used during pretraining . In verifiable settings , log-probability rewards bring comparable or better success rates than reinforcing with standard binary rewards , and yield much better perplexity. In non-verifiable settings , they perform on par with SFT. On the other hand, methods based on probability, such as VeriFree, flatline on non-verifiable settings due to vanishing probabilities of getting the correct answer. Overall, this establishes log-probability rewards as a viable method for CoT fine-tuning , bridging the short, verifiable and long, non-verifiable answer settings.",
  "summary_en": "Log-probability rewards derived from the reference answer's likelihood outperform binary rewards in chain-of-thought fine-tuning across both verifiable and non-verifiable reasoning benchmarks.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nLog-probability rewards derived from the reference answer's likelihood outperform binary rewards in chain-of-thought fine-tuning across both verifiable and non-verifiable reasoning benchmarks.",
  "hf_url": "https://huggingface.co/papers/2602.03979",
  "arxiv_url": "https://arxiv.org/abs/2602.03979",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03979",
  "github_url": "",
  "upvotes": 8,
  "fetched_at": "2026-02-19T05:27:37.589545+00:00"
}