{
  "date": "2026-02-05",
  "paper_id": "2602.04883",
  "title": "Protein Autoregressive Modeling via Multiscale Structure Generation",
  "authors": [
    "Yanru Qu",
    "Cheng-Yen Hsieh",
    "Zaixiang Zheng",
    "Ge Liu",
    "Quanquan Gu"
  ],
  "abstract": "PAR is a multi-scale autoregressive framework for protein backbone generation that uses hierarchical structure modeling, autoregressive transformers, and flow-based decoding to produce high-quality protein structures with improved generalization and reduced exposure bias. We present protein autoregressive modeling (PAR), the first multi-scale autoregressive framework for protein backbone generation via coarse-to-fine next-scale prediction. Using the hierarchical nature of proteins, PAR generates structures that mimic sculpting a statue, forming a coarse topology and refining structural details over scales. To achieve this, PAR consists of three key components: (i) multi-scale downsampling operations that represent protein structures across multiple scales during training; (ii) an autoregressive transformer that encodes multi-scale information and produces conditional embeddings to guide structure generation; (iii) a flow-based backbone decoder that generates backbone atoms conditioned on these embeddings. Moreover, autoregressive models suffer from exposure bias , caused by the training and the generation procedure mismatch, and substantially degrades structure generation quality. We effectively alleviate this issue by adopting noisy context learning and scheduled sampling , enabling robust backbone generation. Notably, PAR exhibits strong zero-shot generalization , supporting flexible human-prompted conditional generation and motif scaffolding without requiring fine-tuning. On the unconditional generation benchmark , PAR effectively learns protein distributions and produces backbones of high design quality, and exhibits favorable scaling behavior. Together, these properties establish PAR as a promising framework for protein structure generation.",
  "summary_en": "PAR is a multi-scale autoregressive framework for protein backbone generation that uses hierarchical structure modeling, autoregressive transformers, and flow-based decoding to produce high-quality protein structures with improved generalization and reduced exposure bias.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nPAR is a multi-scale autoregressive framework for protein backbone generation that uses hierarchical structure modeling, autoregressive transformers, and flow-based decoding to produce high-quality protein structures with improved generalization and reduced exposure bias.",
  "hf_url": "https://huggingface.co/papers/2602.04883",
  "arxiv_url": "https://arxiv.org/abs/2602.04883",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04883",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-19T05:42:18.141226+00:00"
}