{
  "date": "2026-02-05",
  "paper_id": "2602.03587",
  "title": "CL-bench: A Benchmark for Context Learning",
  "authors": [
    "Shihan Dou",
    "Ming Zhang",
    "Zhangyue Yin",
    "Chenhao Huang",
    "Yujiong Shen",
    "Junzhe Wang",
    "Jiayi Chen",
    "Yuchen Ni",
    "Junjie Ye",
    "Cheng Zhang",
    "Huaibing Xie",
    "Jianglu Hu",
    "Shaolei Wang",
    "Weichao Wang",
    "Yanling Xiao",
    "Yiting Liu",
    "Zenan Xu",
    "Zhen Guo",
    "Pluto Zhou",
    "Tao Gui",
    "Zuxuan Wu",
    "Xipeng Qiu"
  ],
  "abstract": "Language models struggle with context learning, requiring new knowledge and reasoning beyond pre-training, as demonstrated by a comprehensive benchmark revealing poor performance on real-world tasks. Current language models (LMs) excel at reasoning over prompts using pre-trained knowledge . However, real-world tasks are far more complex and context-dependent: models must learn from task-specific context and leverage new knowledge beyond what is learned during pre-training to reason and resolve tasks. We term this capability context learning , a crucial ability that humans naturally possess but has been largely overlooked. To this end, we introduce CL-bench, a real-world benchmark consisting of 500 complex contexts, 1,899 tasks, and 31,607 verification rubrics, all crafted by experienced domain experts. Each task is designed such that the new content required to resolve it is contained within the corresponding context. Resolving tasks in CL-bench requires models to learn from the context, ranging from new domain-specific knowledge, rule systems, and complex procedures to laws derived from empirical data, all of which are absent from pre-training. This goes far beyond long-context tasks that primarily test retrieval or reading comprehension , and in-context learning tasks, where models learn simple task patterns via instructions and demonstrations. Our evaluations of ten frontier LMs find that models solve only 17.2% of tasks on average. Even the best-performing model, GPT-5.1 , solves only 23.7%, revealing that LMs have yet to achieve effective context learning , which poses a critical bottleneck for tackling real-world, complex context-dependent tasks. CL-bench represents a step towards building LMs with this fundamental capability, making them more intelligent and advancing their deployment in real-world scenarios.",
  "summary_en": "Language models struggle with context learning, requiring new knowledge and reasoning beyond pre-training, as demonstrated by a comprehensive benchmark revealing poor performance on real-world tasks.",
  "summary_zh": "语言模型难以进行上下文学习，需要预训练之外的新知识和推理能力，一项综合基准测试显示其在真实世界任务上表现不佳。",
  "hf_url": "https://huggingface.co/papers/2602.03587",
  "arxiv_url": "https://arxiv.org/abs/2602.03587",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03587",
  "github_url": "https://github.com/Tencent-Hunyuan/CL-bench",
  "upvotes": 23,
  "fetched_at": "2026-02-19T05:27:32.688835+00:00"
}