{
  "date": "2026-02-05",
  "paper_id": "2602.04289",
  "title": "Proxy Compression for Language Modeling",
  "authors": [
    "Lin Zheng",
    "Xinyu Li",
    "Qian Liu",
    "Xiachong Feng",
    "Lingpeng Kong"
  ],
  "abstract": "Proxy compression trains language models on both raw byte sequences and compressed views, enabling efficient training with end-to-end raw-byte inference while maintaining model robustness. Modern language models are trained almost exclusively on token sequences produced by a fixed tokenizer , an external lossless compressor often over UTF-8 byte sequences , thereby coupling the model to that compressor. This work introduces proxy compression , an alternative training scheme that preserves the efficiency benefits of compressed inputs while providing an end-to-end, raw-byte interface at inference time . During training, one language model is jointly trained on raw byte sequences and compressed views generated by external compressors ; through the process, the model learns to internally align compressed sequences and raw bytes. This alignment enables strong transfer between the two formats, even when training predominantly on compressed inputs which are discarded at inference. Extensive experiments on code language modeling demonstrate that proxy compression substantially improves training efficiency and significantly outperforms pure byte-level baselines given fixed compute budgets. As model scale increases, these gains become more pronounced, and proxy-trained models eventually match or rival tokenizer approaches, all while operating solely on raw bytes and retaining the inherent robustness of byte-level modeling .",
  "summary_en": "Proxy compression trains language models on both raw byte sequences and compressed views, enabling efficient training with end-to-end raw-byte inference while maintaining model robustness.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nProxy compression trains language models on both raw byte sequences and compressed views, enabling efficient training with end-to-end raw-byte inference while maintaining model robustness.",
  "hf_url": "https://huggingface.co/papers/2602.04289",
  "arxiv_url": "https://arxiv.org/abs/2602.04289",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04289",
  "github_url": "https://github.com/LZhengisme/proxy-compression",
  "upvotes": 3,
  "fetched_at": "2026-02-19T05:27:40.581880+00:00"
}