{
  "date": "2026-02-05",
  "paper_id": "2602.04879",
  "title": "Rethinking the Trust Region in LLM Reinforcement Learning",
  "authors": [
    "Penghui Qi",
    "Xiangxin Zhou",
    "Zichen Liu",
    "Tianyu Pang",
    "Chao Du",
    "Min Lin",
    "Wee Sun Lee"
  ],
  "abstract": "DPPO addresses limitations in PPO for LLM fine-tuning by replacing ratio clipping with direct policy divergence constraints, improving training stability and efficiency. Reinforcement learning (RL) has become a cornerstone for fine-tuning Large Language Models (LLMs), with Proximal Policy Optimization (PPO) serving as the de facto standard algorithm. Despite its ubiquity, we argue that the core ratio clipping mechanism in PPO is structurally ill-suited for the large vocabularies inherent to LLMs. PPO constrains policy updates based on the probability ratio of sampled tokens, which serves as a noisy single-sample Monte Carlo estimate of the true policy divergence . This creates a sub-optimal learning dynamic: updates to low-probability tokens are aggressively over-penalized, while potentially catastrophic shifts in high-probability tokens are under-constrained, leading to training inefficiency and instability. To address this, we propose Divergence Proximal Policy Optimization (DPPO), which substitutes heuristic clipping with a more principled constraint based on a direct estimate of policy divergence (e.g., Total Variation or KL). To avoid huge memory footprint, we introduce the efficient Binary and Top-K approximation s to capture the essential divergence with negligible overhead. Extensive empirical evaluations demonstrate that DPPO achieves superior training stability and efficiency compared to existing methods, offering a more robust foundation for RL-based LLM fine-tuning.",
  "summary_en": "DPPO addresses limitations in PPO for LLM fine-tuning by replacing ratio clipping with direct policy divergence constraints, improving training stability and efficiency.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nDPPO addresses limitations in PPO for LLM fine-tuning by replacing ratio clipping with direct policy divergence constraints, improving training stability and efficiency.",
  "hf_url": "https://huggingface.co/papers/2602.04879",
  "arxiv_url": "https://arxiv.org/abs/2602.04879",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04879",
  "github_url": "",
  "upvotes": 33,
  "fetched_at": "2026-02-19T05:42:16.646673+00:00"
}