{
  "date": "2026-02-05",
  "paper_id": "2602.04271",
  "title": "SkeletonGaussian: Editable 4D Generation through Gaussian Skeletonization",
  "authors": [
    "Lifan Wu",
    "Ruijie Zhu",
    "Yubo Ai",
    "Tianzhu Zhang"
  ],
  "abstract": "SkeletonGaussian enables editable 4D generation by decomposing motion into rigid skeleton-driven and non-rigid fine-grained components using hexplane-based refinement. 4D generation has made remarkable progress in synthesizing dynamic 3D objects from input text, images, or videos. However, existing methods often represent motion as an implicit deformation field, which limits direct control and editability. To address this issue, we propose SkeletonGaussian, a novel framework for generating editable dynamic 3D Gaussians from monocular video input . Our approach introduces a hierarchical articulated representation that decomposes motion into sparse rigid motion explicitly driven by a skeleton and fine-grained non-rigid motion. Concretely, we extract a robust skeleton and drive rigid motion via linear blend skinning , followed by a hexplane-based refinement for non-rigid deformations , enhancing interpretability and editability. Experimental results demonstrate that SkeletonGaussian surpasses existing methods in generation quality while enabling intuitive motion editing , establishing a new paradigm for editable 4D generation . Project page: https://wusar.github.io/projects/skeletongaussian/",
  "summary_en": "SkeletonGaussian enables editable 4D generation by decomposing motion into rigid skeleton-driven and non-rigid fine-grained components using hexplane-based refinement.",
  "summary_zh": "SkeletonGaussian利用基于六平面的细化将运动分解为刚性骨骼驱动和非刚性细粒度组件，实现了可编辑的4D生成。",
  "hf_url": "https://huggingface.co/papers/2602.04271",
  "arxiv_url": "https://arxiv.org/abs/2602.04271",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04271",
  "github_url": "https://github.com/wusar/SkeletonGaussian",
  "upvotes": 1,
  "fetched_at": "2026-02-19T05:27:39.125137+00:00"
}