{
  "date": "2026-02-18",
  "paper_id": "2602.15763",
  "title": "GLM-5: from Vibe Coding to Agentic Engineering",
  "authors": [
    "GLM-5 Team",
    "Aohan Zeng",
    "Xin Lv",
    "Zhenyu Hou",
    "Zhengxiao Du",
    "Qinkai Zheng",
    "Bin Chen",
    "Da Yin",
    "Chendi Ge",
    "Chengxing Xie",
    "Cunxiang Wang",
    "Gengzheng Pan",
    "Hao Zeng",
    "Haoke Zhang",
    "Haoran Wang",
    "Huilong Chen",
    "Jiajie Zhang",
    "Jian Jiao",
    "Jiaqi Guo",
    "Jingsen Wang",
    "Jingzhao Du",
    "Jinzhu Wu"
  ],
  "abstract": "GLM-5 advances foundation models with DSA for cost reduction, asynchronous reinforcement learning for improved alignment, and enhanced coding capabilities for real-world software engineering. We present GLM-5, a next-generation foundation model designed to transition the paradigm of vibe coding to agentic engineering . Building upon the agentic, reasoning, and coding (ARC) capabilities of its predecessor, GLM-5 adopts DSA to significantly reduce training and inference costs while maintaining long-context fidelity. To advance model alignment and autonomy, we implement a new asynchronous reinforcement learning infrastructure that drastically improves post-training efficiency by decoupling generation from training. Furthermore, we propose novel asynchronous agent RL algorithms that further improve RL quality, enabling the model to learn from complex, long-horizon interactions more effectively. Through these innovations, GLM-5 achieves state-of-the-art performance on major open benchmarks . Most critically, GLM-5 demonstrates unprecedented capability in real-world coding tasks, surpassing previous baselines in handling end-to-end software engineering challenges. Code, models, and more information are available at https://github.com/zai-org/GLM-5.",
  "summary_en": "GLM-5 advances foundation models with DSA for cost reduction, asynchronous reinforcement learning for improved alignment, and enhanced coding capabilities for real-world software engineering.",
  "summary_zh": "GLM-5通过DSA降低成本，利用异步强化学习改进对齐，并增强编程能力以支持真实世界软件工程，从而推进基础模型发展。",
  "hf_url": "https://huggingface.co/papers/2602.15763",
  "arxiv_url": "https://arxiv.org/abs/2602.15763",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.15763",
  "github_url": "https://github.com/zai-org/GLM-5",
  "upvotes": 25,
  "fetched_at": "2026-02-18T14:10:37.169842+00:00"
}