{
  "date": "2026-02-16",
  "paper_id": "2602.04315",
  "title": "GeneralVLA: Generalizable Vision-Language-Action Models with Knowledge-Guided Trajectory Planning",
  "authors": [
    "Guoqing Ma",
    "Siheng Wang",
    "Zeyu Zhang",
    "Shan Yu",
    "Hao Tang"
  ],
  "abstract": "GeneralVLA is a hierarchical vision-language-action model that enables zero-shot robotic manipulation through knowledge-guided trajectory planning without requiring real-world data collection. Large foundation models have shown strong open-world generalization to complex problems in vision and language, but similar levels of generalization have yet to be achieved in robotics. One fundamental challenge is that the models exhibit limited zero-shot capability , which hampers their ability to generalize effectively to unseen scenarios. In this work, we propose GeneralVLA (Generalizable Vision-Language-Action Models with Knowledge-Guided Trajectory Planning ), a hierarchical vision-language-action (VLA) model that can be more effective in utilizing the generalization of foundation models, enabling zero-shot manipulation and automatically generating data for robotics. In particular, we study a class of hierarchical VLA model where the high-level ASM ( Affordance Segmentation Module ) is finetuned to perceive image keypoint affordances of the scene; the mid-level 3DAgent carries out task understanding, skill knowledge, and trajectory planning to produce a 3D path indicating the desired robot end-effector trajectory. The intermediate 3D path prediction is then served as guidance to the low-level, 3D-aware control policy capable of precise manipulation. Compared to alternative approaches, our method requires no real-world robotic data collection or human demonstration, making it much more scalable to diverse tasks and viewpoints. Empirically, GeneralVLA successfully generates trajectories for 14 tasks, significantly outperforming state-of-the-art methods such as VoxPoser. The generated demonstrations can train more robust behavior cloning policies than training with human demonstrations or from data generated by VoxPoser, Scaling-up, and Code-As-Policies. We believe GeneralVLA can be the scalable method for both generating data for robotics and solving novel tasks in a zero-shot setting. Code: https://github.com/AIGeeksGroup/GeneralVLA. Website: https://aigeeksgroup.github.io/GeneralVLA.",
  "summary_en": "GeneralVLA is a hierarchical vision-language-action model that enables zero-shot robotic manipulation through knowledge-guided trajectory planning without requiring real-world data collection.",
  "summary_zh": "GeneralVLA是一种分层视觉-语言-动作模型，通过知识引导的轨迹规划实现零样本机器人操作，无需真实世界数据收集。",
  "hf_url": "https://huggingface.co/papers/2602.04315",
  "arxiv_url": "https://arxiv.org/abs/2602.04315",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04315",
  "github_url": "https://github.com/AIGeeksGroup/GeneralVLA",
  "upvotes": 1,
  "fetched_at": "2026-02-17T08:52:35.360451+00:00"
}