{
  "date": "2026-02-19",
  "paper_id": "2602.12279",
  "title": "UniT: Unified Multimodal Chain-of-Thought Test-time Scaling",
  "authors": [
    "Leon Liangyu Chen",
    "Haoyu Ma",
    "Zhipeng Fan",
    "Ziqi Huang",
    "Animesh Sinha",
    "Xiaoliang Dai",
    "Jialiang Wang",
    "Zecheng He",
    "Jianwei Yang",
    "Chunyuan Li",
    "Junzhe Sun",
    "Chu Wang",
    "Serena Yeung-Levy",
    "Felix Juefei-Xu"
  ],
  "abstract": "UniT framework enables unified multimodal models to perform iterative reasoning and refinement through chain-of-thought test-time scaling, improving both generation and understanding capabilities. Unified models can handle both multimodal understanding and generation within a single architecture, yet they typically operate in a single pass without iteratively refining their outputs. Many multimodal tasks, especially those involving complex spatial compositions, multiple interacting objects, or evolving instructions, require decomposing instructions, verifying intermediate results, and making iterative corrections. While test-time scaling (TTS) has demonstrated that allocating additional inference compute for iterative reasoning substantially improves language model performance, extending this paradigm to unified multimodal models remains an open challenge. We introduce UniT, a framework for multimodal chain-of-thought test-time scaling that enables a single unified model to reason, verify, and refine across multiple rounds. UniT combines agentic data synthesis , unified model training , and flexible test-time inference to elicit cognitive behaviors including verification, subgoal decomposition, and content memory. Our key findings are: (1) unified models trained on short reasoning trajectories generalize to longer inference chains at test time; (2) sequential chain-of-thought reasoning provides a more scalable and compute-efficient TTS strategy than parallel sampling; (3) training on generation and editing trajectories improves out-of-distribution visual reasoning . These results establish multimodal test-time scaling as an effective paradigm for advancing both generation and understanding in unified models .",
  "summary_en": "UniT framework enables unified multimodal models to perform iterative reasoning and refinement through chain-of-thought test-time scaling, improving both generation and understanding capabilities.",
  "summary_zh": "UniT框架使统一多模态模型能够通过思维链测试时缩放进行迭代推理与优化，从而提升生成与理解能力。",
  "hf_url": "https://huggingface.co/papers/2602.12279",
  "arxiv_url": "https://arxiv.org/abs/2602.12279",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12279",
  "github_url": "",
  "upvotes": 16,
  "fetched_at": "2026-02-19T01:55:33.664750+00:00"
}