{
  "date": "2026-02-19",
  "paper_id": "2602.13964",
  "title": "HLE-Verified: A Systematic Verification and Structured Revision of Humanity's Last Exam",
  "authors": [
    "Weiqi Zhai",
    "Zhihai Wang",
    "Jinghang Wang",
    "Boyu Yang",
    "Xiaogang Li",
    "Xiang Xu",
    "Bohan Wang",
    "Peng Wang",
    "Xingzhe Wu",
    "Anfeng Li",
    "Qiyuan Feng",
    "Yuhao Zhou",
    "Shoulin Han",
    "Wenjie Luo",
    "Yiyuan Li",
    "Yaxuan Wang",
    "Ruixian Luo",
    "Guojie Lin",
    "Peiyao Xiao",
    "Chengliang Xu",
    "Ben Wang",
    "Zeyu Wang"
  ],
  "abstract": "HLE-Verified presents a validated and revised version of the HLE benchmark with improved reliability through expert review and model-based checks, demonstrating significant accuracy improvements in language model evaluations. Humanity's Last Exam (HLE) has become a widely used benchmark for evaluating frontier large language models on challenging, multi-domain questions. However, community-led analyses have raised concerns that HLE contains a non-trivial number of noisy items, which can bias evaluation results and distort cross-model comparisons. To address this challenge, we introduce HLE-Verified, a verified and revised version of HLE with a transparent verification protocol and fine-grained error taxonomy . Our construction follows a two-stage validation -and-repair workflow resulting in a certified benchmark . In Stage I, each item undergoes binary validation of the problem and final answer through domain-expert review and model-based cross-checks , yielding 641 verified items. In Stage II, flawed but fixable items are revised under strict constraints preserving the original evaluation intent, through dual independent expert repairs , model-assisted auditing , and final adjudication , resulting in 1,170 revised-and-certified items. The remaining 689 items are released as a documented uncertain set with explicit uncertainty sources and expertise tags for future refinement. We evaluate seven state-of-the-art language models on HLE and HLE-Verified, observing an average absolute accuracy gain of 7--10 percentage points on HLE-Verified. The improvement is particularly pronounced on items where the original problem statement and/or reference answer is erroneous, with gains of 30--40 percentage points. Our analyses further reveal a strong association between model confidence and the presence of errors in the problem statement or reference answer, supporting the effectiveness of our revisions. Overall, HLE-Verified improves HLE-style evaluations by reducing annotation noise and enabling more faithful measurement of model capabilities. Data is available at: https://github.com/SKYLENAGE-AI/HLE-Verified",
  "summary_en": "HLE-Verified presents a validated and revised version of the HLE benchmark with improved reliability through expert review and model-based checks, demonstrating significant accuracy improvements in language model evaluations.",
  "summary_zh": "HLE-Verified是HLE基准经过验证与修订的版本，通过专家审核和基于模型的检查提升了可靠性，在语言模型评估中展现出显著的准确性提升。",
  "hf_url": "https://huggingface.co/papers/2602.13964",
  "arxiv_url": "https://arxiv.org/abs/2602.13964",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13964",
  "github_url": "",
  "upvotes": 2,
  "fetched_at": "2026-02-19T01:55:37.496105+00:00"
}