{
  "date": "2026-02-17",
  "paper_id": "2602.07824",
  "title": "Data Darwinism Part I: Unlocking the Value of Scientific Data for Pre-training",
  "authors": [
    "Yiwei Qin",
    "Zhen Huang",
    "Tiantian Mi",
    "Weiye Si",
    "Chenyang Zhou",
    "Qipeng Guo",
    "Siyuan Feng",
    "Pengfei Liu"
  ],
  "abstract": "Data Darwinism presents a systematic framework for data-model co-evolution through a ten-level taxonomy, demonstrating that advanced processing techniques significantly improve foundation model performance on scientific text. Data quality determines foundation model performance, yet systematic processing frameworks are lacking. We introduce Data Darwinism, a ten-level taxonomy (L0-L9) that conceptualizes data-model co-evolution : advanced models produce superior data for next-generation systems. We validate this on scientific literature by constructing Darwin-Science, a 900B-token corpus (L0-L5). We identify a learnability gap in raw scientific text, which we bridge via L4 ( Generative Refinement ) and L5 ( Cognitive Completion ) using frontier LLMs to explicate reasoning and terminology. To ensure rigorous attribution, we pre-trained daVinci-origin-3B/7B models from scratch, excluding scientific content to create contamination-free baselines. After 600B tokens of continued pre-training , Darwin-Science outperforms baselines by +2.12 (3B) and +2.95 (7B) points across 20+ benchmarks, rising to +5.60 and +8.40 points on domain-aligned tasks . Systematic progression to L5 yields a +1.36 total gain, confirming that higher-level processing unlocks latent data value. We release the Darwin-Science corpus and daVinci-origin models to enable principled, co-evolutionary development.",
  "summary_en": "Data Darwinism presents a systematic framework for data-model co-evolution through a ten-level taxonomy, demonstrating that advanced processing techniques significantly improve foundation model performance on scientific text.",
  "summary_zh": "Data Darwinism 提出了一个系统性的数据-模型协同进化框架，该框架通过十层分类体系，证明先进处理技术能够显著提升基础模型在科学文本上的性能。",
  "hf_url": "https://huggingface.co/papers/2602.07824",
  "arxiv_url": "https://arxiv.org/abs/2602.07824",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.07824",
  "github_url": "https://github.com/GAIR-NLP/Data-Darwinism",
  "upvotes": 10,
  "fetched_at": "2026-02-17T15:57:36.747333+00:00"
}