{
  "date": "2026-02-27",
  "paper_id": "2602.23339",
  "title": "Retrieve and Segment: Are a Few Examples Enough to Bridge the Supervision Gap in Open-Vocabulary Segmentation?",
  "authors": [
    "Tilemachos Aravanis",
    "Vladan Stojnić",
    "Bill Psomas",
    "Nikos Komodakis",
    "Giorgos Tolias"
  ],
  "abstract": "Retrieval-augmented test-time adaptation with learned fusion of textual and visual features bridges the performance gap between zero-shot and supervised open-vocabulary segmentation. Open-vocabulary segmentation (OVS) extends the zero-shot recognition capabilities of vision-language models (VLMs) to pixel-level prediction , enabling segmentation of arbitrary categories specified by text prompts. Despite recent progress, OVS lags behind fully supervised approaches due to two challenges: the coarse image-level supervision used to train VLMs and the semantic ambiguity of natural language. We address these limitations by introducing a few-shot setting that augments textual prompts with a support set of pixel-annotated images. Building on this, we propose a retrieval-augmented test-time adapter that learns a lightweight, per-image classifier by fusing textual and visual support features. Unlike prior methods relying on late, hand-crafted fusion, our approach performs learned, per-query fusion, achieving stronger synergy between modalities. The method supports continually expanding support set s, and applies to fine-grained tasks such as personalized segmentation . Experiments show that we significantly narrow the gap between zero-shot and supervised segmentation while preserving open-vocabulary ability.",
  "summary_en": "Retrieval-augmented test-time adaptation with learned fusion of textual and visual features bridges the performance gap between zero-shot and supervised open-vocabulary segmentation.",
  "summary_zh": "检索增强的测试时自适应通过文本与视觉特征的学习融合，弥合了零样本与有监督开放词汇分割之间的性能差距。",
  "hf_url": "https://huggingface.co/papers/2602.23339",
  "arxiv_url": "https://arxiv.org/abs/2602.23339",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23339",
  "github_url": "https://github.com/TilemahosAravanis/Retrieve-and-Segment",
  "upvotes": 4,
  "fetched_at": "2026-02-28T01:46:58.748014+00:00"
}