{
  "date": "2026-02-27",
  "paper_id": "2602.22675",
  "title": "Search More, Think Less: Rethinking Long-Horizon Agentic Search for Efficiency and Generalization",
  "authors": [
    "Qianben Chen",
    "Tianrui Qin",
    "King Zhu",
    "Qiexiang Wang",
    "Chengjun Yu",
    "Shu Xu",
    "Jiaqi Wu",
    "Jiayu Zhang",
    "Xinpeng Liu",
    "Xin Gui",
    "Jingyi Cao",
    "Piaohong Wang",
    "Dingfeng Shi",
    "He Zhu",
    "Tiannan Wang",
    "Yuqing Wang",
    "Maojia Song",
    "Tianyu Zheng",
    "Ge Zhang",
    "Jian Yang",
    "Jiaheng Liu",
    "Minghao Liu"
  ],
  "abstract": "A deep learning framework called SMTL improves efficient long-horizon agentic search by replacing sequential reasoning with parallel evidence acquisition, achieving state-of-the-art performance across multiple research benchmarks while reducing reasoning steps by 70.7%. Recent deep research agents primarily improve performance by scaling reasoning depth , but this leads to high inference cost and latency in search-intensive scenarios . Moreover, generalization across heterogeneous research settings remains challenging. In this work, we propose Search More, Think Less (SMTL), a framework for long-horizon agentic search that targets both efficiency and generalization . SMTL replaces sequential reasoning with parallel evidence acquisition , enabling efficient context management under constrained context budgets. To support generalization across task types, we further introduce a unified data synthesis pipeline that constructs search tasks spanning both deterministic question answering and open-ended research scenarios with task appropriate evaluation metrics. We train an end-to-end agent using supervised fine-tuning and reinforcement learning , achieving strong and often state of the art performance across benchmarks including BrowseComp (48.6\\%), GAIA (75.7\\%), Xbench (82.0\\%), and DeepResearch Bench (45.9\\%). Compared to Mirothinker-v1.0, SMTL with maximum 100 interaction steps reduces the average number of reasoning steps on BrowseComp by 70.7\\%, while improving accuracy.",
  "summary_en": "A deep learning framework called SMTL improves efficient long-horizon agentic search by replacing sequential reasoning with parallel evidence acquisition, achieving state-of-the-art performance across multiple research benchmarks while reducing reasoning steps by 70.7%.",
  "summary_zh": "名为SMTL的深度学习框架通过以并行证据获取替代顺序推理，改进了高效长程智能体搜索，在多个研究基准上达到了最先进的性能，同时将推理步骤减少了70.7%。",
  "hf_url": "https://huggingface.co/papers/2602.22675",
  "arxiv_url": "https://arxiv.org/abs/2602.22675",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22675",
  "github_url": "https://github.com/OPPO-PersonalAI/SMTL",
  "upvotes": 14,
  "fetched_at": "2026-02-28T01:46:47.900310+00:00"
}