{
  "date": "2026-02-11",
  "paper_id": "2602.00268",
  "title": "TokenTrim: Inference-Time Token Pruning for Autoregressive Long Video Generation",
  "authors": [
    "Ariel Shaulov",
    "Eitan Shaar",
    "Amit Edenzon",
    "Lior Wolf"
  ],
  "abstract": "Auto-regressive video generation suffers from temporal drift due to error accumulation in latent conditioning tokens, which is addressed by identifying and removing unstable tokens during inference to improve long-horizon consistency. Auto-regressive video generation enables long video synthesis by iteratively conditioning each new batch of frames on previously generated content. However, recent work has shown that such pipelines suffer from severe temporal drift , where errors accumulate and amplify over long horizons. We hypothesize that this drift does not primarily stem from insufficient model capacity, but rather from inference-time error propagation . Specifically, we contend that drift arises from the uncontrolled reuse of corrupted latent conditioning tokens during auto-regressive inference. To correct this accumulation of errors, we propose a simple, inference-time method that mitigates temporal drift by identifying and removing unstable latent tokens before they are reused for conditioning. For this purpose, we define unstable tokens as latent tokens whose representations deviate significantly from those of the previously generated batch, indicating potential corruption or semantic drift. By explicitly removing corrupted latent tokens from the auto-regressive context, rather than modifying entire spatial regions or model parameters, our method prevents unreliable latent information from influencing future generation steps. As a result, it significantly improves long-horizon temporal consistency without modifying the model architecture, training procedure, or leaving latent space .",
  "summary_en": "Auto-regressive video generation suffers from temporal drift due to error accumulation in latent conditioning tokens, which is addressed by identifying and removing unstable tokens during inference to improve long-horizon consistency.",
  "summary_zh": "自回归视频生成因潜在条件token的误差累积而存在时间漂移，通过在推理过程中识别并移除不稳定token以提升长程一致性。",
  "hf_url": "https://huggingface.co/papers/2602.00268",
  "arxiv_url": "https://arxiv.org/abs/2602.00268",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.00268",
  "github_url": "https://github.com/arielshaulov/TokenTrim",
  "upvotes": 21,
  "fetched_at": "2026-02-19T06:20:19.280811+00:00"
}