{
  "date": "2026-02-11",
  "paper_id": "2602.09017",
  "title": "Contact-Anchored Policies: Contact Conditioning Creates Strong Robot Utility Models",
  "authors": [
    "Zichen Jeff Cui",
    "Omar Rayyan",
    "Haritheja Etukuru",
    "Bowen Tan",
    "Zavier Andrianarivo",
    "Zicheng Teng",
    "Yihang Zhou",
    "Krish Mehta",
    "Nicholas Wojno",
    "Kevin Yuanbo Wu",
    "Manan H Anjaria",
    "Ziyuan Wu",
    "Manrong Mao",
    "Guangxun Zhang",
    "Binit Shah",
    "Yejin Kim",
    "Soumith Chintala",
    "Lerrel Pinto",
    "Nur Muhammad Mahi Shafiullah"
  ],
  "abstract": "Contact-Anchored Policies replace language conditioning with physical contact points and use modular utility models for robust manipulation, achieving superior zero-shot performance with minimal demonstration data through real-to-sim iteration cycles. The prevalent paradigm in robot learning attempts to generalize across environments, embodiments, and tasks with language prompts at runtime. A fundamental tension limits this approach: language is often too abstract to guide the concrete physical understanding required for robust manipulation. In this work, we introduce Contact-Anchored Policies (CAP), which replace language conditioning with points of physical contact in space. Simultaneously, we structure CAP as a library of modular utility models rather than a monolithic generalist policy. This factorization allows us to implement a real-to-sim iteration cycle: we build EgoGym , a lightweight simulation benchmark, to rapidly identify failure modes and refine our models and datasets prior to real-world deployment. We show that by conditioning on contact and iterating via simulation, CAP generalizes to novel environments and embodiments out of the box on three fundamental manipulation skills while using only 23 hours of demonstration data , and outperforms large, state-of-the-art VLAs in zero-shot evaluation s by 56%. All model checkpoints, codebase, hardware, simulation, and datasets will be open-sourced. Project page: https://cap-policy.github.io/",
  "summary_en": "Contact-Anchored Policies replace language conditioning with physical contact points and use modular utility models for robust manipulation, achieving superior zero-shot performance with minimal demonstration data through real-to-sim iteration cycles.",
  "summary_zh": "接触锚定策略以物理接触点替代语言条件，并采用模块化效用模型实现鲁棒操控，通过 real-to-sim 迭代循环，以极少演示数据达成卓越的零样本性能。",
  "hf_url": "https://huggingface.co/papers/2602.09017",
  "arxiv_url": "https://arxiv.org/abs/2602.09017",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.09017",
  "github_url": "https://github.com/jeffacce/cap-policy",
  "upvotes": 12,
  "fetched_at": "2026-02-19T06:21:34.406799+00:00"
}