{
  "date": "2026-02-11",
  "paper_id": "2602.09443",
  "title": "P1-VL: Bridging Visual Perception and Scientific Reasoning in Physics Olympiads",
  "authors": [
    "Yun Luo",
    "Futing Wang",
    "Qianjia Cheng",
    "Fangchen Yu",
    "Haodi Lei",
    "Jianhao Yan",
    "Chenxi Li",
    "Jiacheng Chen",
    "Yufeng Zhao",
    "Haiyuan Wan",
    "Yuchen Zhang",
    "Shenghe Zheng",
    "Junchi Yao",
    "Qingyang Zhang",
    "Haonan He",
    "Wenxuan Zeng",
    "Li Sheng",
    "Chengxing Xie",
    "Yuxin Zuo",
    "Yizhuo Li",
    "Yulun Wu",
    "Rui Huang"
  ],
  "abstract": "Physics-oriented vision-language models leverage curriculum reinforcement learning and agentic augmentation to achieve state-of-the-art scientific reasoning performance while maintaining physical consistency through multimodal perception. The transition from symbolic manipulation to science-grade reasoning represents a pivotal frontier for Large Language Models (LLMs), with physics serving as the critical test anchor for binding abstract logic to physical reality. Physics demands that a model maintain physical consistency with the laws governing the universe, a task that fundamentally requires multimodal perception to ground abstract logic in reality. At the Olympiad level, diagrams are often constitutive rather than illustrative, containing essential constraints, such as boundary conditions and spatial symmetries, that are absent from the text. To bridge this visual-logical gap, we introduce P1-VL, a family of open-source vision-language models engineered for advanced scientific reasoning . Our method harmonizes Curriculum Reinforcement Learning , which employs progressive difficulty expansion to stabilize post-training, with Agentic Augmentation , enabling iterative self-verification at inference. Evaluated on HiPhO, a rigorous benchmark of 13 exams from 2024-2025, our flagship P1-VL-235B-A22B becomes the first open-source Vision-Language Model (VLM) to secure 12 gold medals and achieves the state-of-the-art performance in the open-source models. Our agent-augmented system achieves the No.2 overall rank globally, trailing only Gemini-3-Pro . Beyond physics, P1-VL demonstrates remarkable scientific reasoning capacity and generalizability, establishing significant leads over base models in STEM benchmarks. By open-sourcing P1-VL, we provide a foundational step toward general-purpose physical intelligence to better align visual perceptions with abstract physical laws for machine scientific discovery.",
  "summary_en": "Physics-oriented vision-language models leverage curriculum reinforcement learning and agentic augmentation to achieve state-of-the-art scientific reasoning performance while maintaining physical consistency through multimodal perception.",
  "summary_zh": "面向物理的视觉-语言模型利用课程强化学习和智能体增强，在通过多模态感知保持物理一致性的同时，实现了最先进的科学推理性能。",
  "hf_url": "https://huggingface.co/papers/2602.09443",
  "arxiv_url": "https://arxiv.org/abs/2602.09443",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.09443",
  "github_url": "https://github.com/PRIME-RL/P1-VL",
  "upvotes": 57,
  "fetched_at": "2026-02-19T06:21:51.230976+00:00"
}