{
  "date": "2026-02-25",
  "paper_id": "2602.16603",
  "title": "FlowPrefill: Decoupling Preemption from Prefill Scheduling Granularity to Mitigate Head-of-Line Blocking in LLM Serving",
  "authors": [
    "Chia-chi Hsieh",
    "Zan Zong",
    "Xinyang Chen",
    "Jianjiang Li",
    "Jidong Zhai",
    "Lijie Wen"
  ],
  "abstract": "FlowPrefill addresses head-of-line blocking in large language model serving by decoupling preemption granularity from scheduling frequency through operator-level preemption and event-driven scheduling, achieving up to 5.6x better goodput than existing systems. The growing demand for large language models (LLMs) requires serving systems to handle many concurrent requests with diverse service level objectives (SLOs). This exacerbates head-of-line (HoL) blocking during the compute-intensive prefill phase , where long-running requests monopolize resources and delay higher-priority ones, leading to widespread time-to-first-token (TTFT) SLO violations. While chunked prefill enables interruptibility, it introduces an inherent trade-off between responsiveness and throughput: reducing chunk size improves response latency but degrades computational efficiency, whereas increasing chunk size maximizes throughput but exacerbates blocking. This necessitates an adaptive preemption mechanism. However, dynamically balancing execution granularity against scheduling overheads remains a key challenge. In this paper, we propose FlowPrefill, a TTFT- goodput -optimized serving system that resolves this conflict by decoupling preemption granularity from scheduling frequency . To achieve adaptive prefill scheduling, FlowPrefill introduces two key innovations: 1) Operator-Level Preemption , which leverages operator boundaries to enable fine-grained execution interruption without the efficiency loss associated with fixed small chunking; and 2) Event-Driven Scheduling , which triggers scheduling decisions only upon request arrival or completion events, thereby supporting efficient preemption responsiveness while minimizing control-plane overhead. Evaluation on real-world production traces shows that FlowPrefill improves maximum goodput by up to 5.6times compared to state-of-the-art systems while satisfying heterogeneous SLOs.",
  "summary_en": "FlowPrefill addresses head-of-line blocking in large language model serving by decoupling preemption granularity from scheduling frequency through operator-level preemption and event-driven scheduling, achieving up to 5.6x better goodput than existing systems.",
  "summary_zh": "FlowPrefill 通过算子级抢占和事件驱动调度解耦抢占粒度与调度频率，解决大语言模型服务中的队头阻塞问题，较现有系统 goodput 最高提升 5.6 倍。",
  "hf_url": "https://huggingface.co/papers/2602.16603",
  "arxiv_url": "https://arxiv.org/abs/2602.16603",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.16603",
  "github_url": "https://github.com/HSIEHCHIACHI/FlowPrefill",
  "upvotes": 1,
  "fetched_at": "2026-02-26T01:56:55.131280+00:00"
}