{
  "date": "2026-02-25",
  "paper_id": "2602.21015",
  "title": "From Perception to Action: An Interactive Benchmark for Vision Reasoning",
  "authors": [
    "Yuhao Wu",
    "Maojia Song",
    "Yihuai Lan",
    "Lei Wang",
    "Zhiqiang Hu",
    "Yao Xiao",
    "Heng Zhou",
    "Weihua Zheng",
    "Dylan Raharja",
    "Soujanya Poria",
    "Roy Ka-Wei Lee"
  ],
  "abstract": "Current vision-language models lack capability to understand physical structures and causal constraints needed for complex, interactive 3D tasks, as demonstrated by the CHAIN benchmark evaluating structured action planning under physical constraints. Understanding the physical structure is essential for real-world applications such as embodied agents, interactive design, and long-horizon manipulation. Yet, prevailing Vision-Language Model (VLM) evaluations still center on structure-agnostic, single-turn setups (e.g., VQA), which fail to assess agents' ability to reason about how geometry, contact, and support relations jointly constrain what actions are possible in a dynamic environment. To address this gap, we introduce the Causal Hierarchy of Actions and Interactions (CHAIN) benchmark, an interactive 3D , physics-driven testbed designed to evaluate whether models can understand, plan, and execute structured action sequences grounded in physical constraints . CHAIN shifts evaluation from passive perception to active problem solving, spanning tasks such as interlocking mechanical puzzles and 3D stacking and packing. We conduct a comprehensive study of state-of-the-art VLMs and diffusion-based models under unified interactive settings. Our results show that top-performing models still struggle to internalize physical structure and causal constraints , often failing to produce reliable long-horizon plans and cannot robustly translate perceived structure into effective actions. The project is available at https://social-ai-studio.github.io/CHAIN/.",
  "summary_en": "Current vision-language models lack capability to understand physical structures and causal constraints needed for complex, interactive 3D tasks, as demonstrated by the CHAIN benchmark evaluating structured action planning under physical constraints.",
  "summary_zh": "现有视觉-语言模型缺乏理解物理结构与因果约束的能力，难以胜任复杂的交互式3D任务，正如CHAIN基准在评估受物理约束的结构化动作规划时所证明的那样。",
  "hf_url": "https://huggingface.co/papers/2602.21015",
  "arxiv_url": "https://arxiv.org/abs/2602.21015",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21015",
  "github_url": "https://github.com/Social-AI-Studio/CHAIN",
  "upvotes": 21,
  "fetched_at": "2026-02-26T01:57:16.704167+00:00"
}