{
  "date": "2026-02-09",
  "paper_id": "2602.06075",
  "title": "MemGUI-Bench: Benchmarking Memory of Mobile GUI Agents in Dynamic Environments",
  "authors": [
    "Guangyi Liu",
    "Pengxiang Zhao",
    "Yaozhen Liang",
    "Qinyi Luo",
    "Shunye Tang",
    "Yuxiang Chai",
    "Weifeng Lin",
    "Han Xiao",
    "WenHao Wang",
    "Siheng Chen",
    "Zhengxi Lu",
    "Gao Wu",
    "Hao Wang",
    "Liang Liu",
    "Yong Liu"
  ],
  "abstract": "A comprehensive memory-focused benchmark for mobile GUI agents reveals significant memory capability gaps and provides systematic evaluation methods and design insights. Current mobile GUI agent benchmarks systematically fail to assess memory capabilities, with only 5.2-11.8% memory-related tasks and no cross-session learning evaluation. We introduce MemGUI-Bench, a comprehensive memory-centric benchmark with pass@k and staged LLM-as-judge evaluation . Our contributions include: (1) a systematic memory taxonomy analyzing 11 agents across 5 architectures; (2) 128 tasks across 26 applications where 89.8% challenge memory through cross-temporal and cross-spatial retention ; (3) MemGUI-Eval, an automated pipeline with Progressive Scrutiny and 7 hierarchical metrics ; and (4) RQ-driven assessment of 11 state-of-the-art agents . Our experiments reveal significant memory deficits across all evaluated systems, identify 5 distinct failure modes , and synthesize 5 actionable design implications . All resources including code, benchmark, and evaluation results will be \\textit{fully open-sourced and continuously maintained} at https://lgy0404.github.io/MemGUI-Bench/.",
  "summary_en": "A comprehensive memory-focused benchmark for mobile GUI agents reveals significant memory capability gaps and provides systematic evaluation methods and design insights.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nA comprehensive memory-focused benchmark for mobile GUI agents reveals significant memory capability gaps and provides systematic evaluation methods and design insights.",
  "hf_url": "https://huggingface.co/papers/2602.06075",
  "arxiv_url": "https://arxiv.org/abs/2602.06075",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06075",
  "github_url": "https://github.com/lgy0404/MemGUI-Bench",
  "upvotes": 13,
  "fetched_at": "2026-02-19T05:44:08.554813+00:00"
}