{
  "date": "2026-02-09",
  "paper_id": "2602.05281",
  "title": "Back to Basics: Revisiting Exploration in Reinforcement Learning for LLM Reasoning via Generative Probabilities",
  "authors": [
    "Pengyi Li",
    "Elizaveta Goncharova",
    "Andrey Kuznetsov",
    "Ivan Oseledets"
  ],
  "abstract": "A novel reinforcement learning approach called ARM addresses entropy collapse in LLM reasoning by equilibrating confidence levels across correct responses through dynamic reward shaping. Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as an indispensable paradigm for enhancing reasoning in Large Language Models (LLMs). However, standard policy optimization methods, such as Group Relative Policy Optimization (GRPO), often converge to low-entropy policies, leading to severe mode collapse and limited output diversity. We analyze this issue from the perspective of sampling probability dynamics, identifying that the standard objective disproportionately reinforces the highest-likelihood paths, thereby suppressing valid alternative reasoning chains. To address this, we propose a novel Advantage Re-weighting Mechanism (ARM) designed to equilibrate the confidence levels across all correct responses. By incorporating Prompt Perplexity and Answer Confidence into the advantage estimation , our method dynamically reshapes the reward signal to attenuate the gradient updates of over-confident reasoning paths, while redistributing probability mass toward under-explored correct solutions. Empirical results demonstrate that our approach significantly enhances generative diversity and response entropy while maintaining competitive accuracy, effectively achieving a superior trade-off between exploration and exploitation in reasoning tasks . Empirical results on Qwen2.5 and DeepSeek models across mathematical and coding benchmarks show that ProGRPO significantly mitigates entropy collapse . Specifically, on Qwen2.5-7B, our method outperforms GRPO by 5.7% in Pass@1 and, notably, by 13.9% in Pass@32 , highlighting its superior capability in generating diverse correct reasoning paths.",
  "summary_en": "A novel reinforcement learning approach called ARM addresses entropy collapse in LLM reasoning by equilibrating confidence levels across correct responses through dynamic reward shaping.",
  "summary_zh": "一种名为ARM的新型强化学习方法通过动态奖励塑造均衡各正确回答的置信度水平，以解决LLM推理中的熵坍缩问题。",
  "hf_url": "https://huggingface.co/papers/2602.05281",
  "arxiv_url": "https://arxiv.org/abs/2602.05281",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05281",
  "github_url": "",
  "upvotes": 15,
  "fetched_at": "2026-02-19T05:43:59.679234+00:00"
}