{
  "date": "2026-02-09",
  "paper_id": "2602.06130",
  "title": "Self-Improving World Modelling with Latent Actions",
  "authors": [
    "Yifu Qiu",
    "Zheng Zhao",
    "Waylon Li",
    "Yftah Ziser",
    "Anna Korhonen",
    "Shay B. Cohen",
    "Edoardo M. Ponti"
  ],
  "abstract": "SWIRL is a self-improvement framework that learns world models from state-only sequences by alternating between forward and inverse dynamics modeling with variational information maximization and ELBO maximization, achieving improved performance on various reasoning and planning benchmarks. Internal modelling of the world -- predicting transitions between previous states X and next states Y under actions Z -- is essential to reasoning and planning for LLMs and VLMs. Learning such models typically requires costly action-labelled trajectories. We propose SWIRL, a self-improvement framework that learns from state-only sequences by treating actions as a latent variable and alternating between Forward World Modelling (FWM) P_θ(Y|X,Z) and an Inverse Dynamics Modelling (IDM) Q_φ(Z|X,Y). SWIRL iterates two phases: (1) Variational Information Maximisation , which updates the FWM to generate next states that maximise conditional mutual information with latent actions given prior states, encouraging identifiable consistency; and (2) ELBO Maximisation , which updates the IDM to explain observed transitions, effectively performing coordinate ascent . Both models are trained with reinforcement learning (specifically, GRPO ) with the opposite frozen model's log-probability as a reward signal. We provide theoretical learnability guarantees for both updates, and evaluate SWIRL on LLMs and VLMs across multiple environments: single-turn and multi-turn open-world visual dynamics and synthetic textual environments for physics, web, and tool calling. SWIRL achieves gains of 16% on AURORABench, 28% on ByteMorph, 16% on WorldPredictionBench, and 14% on StableToolBench.",
  "summary_en": "SWIRL is a self-improvement framework that learns world models from state-only sequences by alternating between forward and inverse dynamics modeling with variational information maximization and ELBO maximization, achieving improved performance on various reasoning and planning benchmarks.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nSWIRL is a self-improvement framework that learns world models from state-only sequences by alternating between forward and inverse dynamics modeling with variational information maximization and ELBO maximization, achieving improved performance on various reasoning and planning benchmarks.",
  "hf_url": "https://huggingface.co/papers/2602.06130",
  "arxiv_url": "https://arxiv.org/abs/2602.06130",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06130",
  "github_url": "",
  "upvotes": 29,
  "fetched_at": "2026-02-19T05:44:13.066392+00:00"
}