{
  "date": "2026-02-09",
  "paper_id": "2602.01064",
  "title": "Exploring Knowledge Purification in Multi-Teacher Knowledge Distillation for LLMs",
  "authors": [
    "Ruihan Jin",
    "Pengpeng Shao",
    "Zhengqi Wen",
    "Jinyang Wu",
    "Mingkuan Feng",
    "Shuo Yang",
    "Chu Yuan Zhang",
    "Jianhua Tao"
  ],
  "abstract": "Knowledge purification techniques consolidate rationales from multiple teacher LLMs to reduce conflicts and improve efficiency in distillation processes. Knowledge distillation has emerged as a pivotal technique for transferring knowledge from stronger large language models (LLMs) to smaller, more efficient models. However, traditional distillation approaches face challenges related to knowledge conflicts and high resource demands, particularly when leveraging multiple teacher models . In this paper, we introduce the concept of Knowledge Purification , which consolidates the rationales from multiple teacher LLMs into a single rationale, thereby mitigating conflicts and enhancing efficiency. To investigate the effectiveness of knowledge purification , we further propose five purification methods from various perspectives. Our experiments demonstrate that these methods not only improve the performance of the distilled model but also effectively alleviate knowledge conflicts . Moreover, router-based methods exhibit robust generalization capabilities, underscoring the potential of innovative purification techniques in optimizing multi-teacher distillation and facilitating the practical deployment of powerful yet lightweight models.",
  "summary_en": "Knowledge purification techniques consolidate rationales from multiple teacher LLMs to reduce conflicts and improve efficiency in distillation processes.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nKnowledge purification techniques consolidate rationales from multiple teacher LLMs to reduce conflicts and improve efficiency in distillation processes.",
  "hf_url": "https://huggingface.co/papers/2602.01064",
  "arxiv_url": "https://arxiv.org/abs/2602.01064",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01064",
  "github_url": "",
  "upvotes": 2,
  "fetched_at": "2026-02-19T05:43:42.724279+00:00"
}