{
  "date": "2026-02-09",
  "paper_id": "2602.04811",
  "title": "SE-Bench: Benchmarking Self-Evolution with Knowledge Internalization",
  "authors": [
    "Jiarui Yuan",
    "Tailin Jin",
    "Weize Chen",
    "Zeyuan Liu",
    "Zhiyuan Liu",
    "Maosong Sun"
  ],
  "abstract": "SE-Bench presents a diagnostic environment that obscures NumPy's API to evaluate agents' ability to internally store and utilize novel knowledge without external documentation, revealing challenges in knowledge retention and internalization through different training approaches. True self-evolution requires agents to act as lifelong learners that internalize novel experiences to solve future problems. However, rigorously measuring this foundational capability is hindered by two obstacles: the entanglement of prior knowledge, where ``new'' knowledge may appear in pre-training data, and the entanglement of reasoning complexity, where failures may stem from problem difficulty rather than an inability to recall learned knowledge. We introduce SE-Bench, a diagnostic environment that obfuscates the NumPy library and its API doc into a pseudo-novel package with randomized identifiers. Agents are trained to internalize this package and evaluated on simple coding tasks without access to documentation, yielding a clean setting where tasks are trivial with the new API doc but impossible for base models without it. Our investigation reveals three insights: (1) the Open-Book Paradox , where training with reference documentation inhibits retention, requiring \" Closed-Book Training \" to force knowledge compression into weights; (2) the RL Gap , where standard RL fails to internalize new knowledge completely due to PPO clipping and negative gradients ; and (3) the viability of Self-Play for internalization, proving models can learn from self-generated, noisy tasks when coupled with SFT , but not RL. Overall, SE-Bench establishes a rigorous diagnostic platform for self-evolution with knowledge internalization . Our code and dataset can be found at https://github.com/thunlp/SE-Bench.",
  "summary_en": "SE-Bench presents a diagnostic environment that obscures NumPy's API to evaluate agents' ability to internally store and utilize novel knowledge without external documentation, revealing challenges in knowledge retention and internalization through different training approaches.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nSE-Bench presents a diagnostic environment that obscures NumPy's API to evaluate agents' ability to internally store and utilize novel knowledge without external documentation, revealing challenges in knowledge retention and internalization through different training approaches.",
  "hf_url": "https://huggingface.co/papers/2602.04811",
  "arxiv_url": "https://arxiv.org/abs/2602.04811",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04811",
  "github_url": "",
  "upvotes": 2,
  "fetched_at": "2026-02-19T05:43:55.279809+00:00"
}