{
  "date": "2026-02-20",
  "paper_id": "2602.16855",
  "title": "Mobile-Agent-v3.5: Multi-platform Fundamental GUI Agents",
  "authors": [
    "Haiyang Xu",
    "Xi Zhang",
    "Haowei Liu",
    "Junyang Wang",
    "Zhaozai Zhu",
    "Shengjie Zhou",
    "Xuhao Hu",
    "Feiyu Gao",
    "Junjie Cao",
    "Zihua Wang",
    "Zhiyuan Chen",
    "Jitong Liao",
    "Qi Zheng",
    "Jiahui Zeng",
    "Ze Xu",
    "Shuai Bai",
    "Junyang Lin",
    "Jingren Zhou",
    "Ming Yan"
  ],
  "abstract": "GUI-Owl-1.5 is a multi-platform GUI agent model with multiple sizes that achieves state-of-the-art performance on GUI automation, grounding, tool-calling, and memory tasks through innovations in hybrid data pipelines, unified reasoning enhancement, and multi-platform reinforcement learning. The paper introduces GUI-Owl-1.5, the latest native GUI agent model that features instruct/thinking variants in multiple sizes (2B/4B/8B/32B/235B) and supports a range of platforms (desktop, mobile, browser, and more) to enable cloud-edge collaboration and real-time interaction. GUI-Owl-1.5 achieves state-of-the-art results on more than 20+ GUI benchmarks on open-source models: (1) on GUI automation tasks, it obtains 56.5 on OSWorld, 71.6 on AndroidWorld, and 48.4 on WebArena; (2) on grounding tasks, it obtains 80.3 on ScreenSpotPro; (3) on tool-calling tasks, it obtains 47.6 on OSWorld-MCP, and 46.8 on MobileWorld; (4) on memory and knowledge tasks, it obtains 75.5 on GUI-Knowledge Bench. GUI-Owl-1.5 incorporates several key innovations: (1) Hybird Data Flywheel: we construct the data pipeline for UI understanding and trajectory generation based on a combination of simulated environments and cloud-based sandbox environments , in order to improve the efficiency and quality of data collection. (2) Unified Enhancement of Agent Capabilities: we use a unified thought-synthesis pipeline to enhance the model's reasoning capabilities, while placing particular emphasis on improving key agent abilities, including Tool/MCP use, memory and multi-agent adaptation ; (3) Multi-platform Environment RL Scaling: We propose a new environment RL algorithm , MRPO , to address the challenges of multi-platform conflicts and the low training efficiency of long-horizon tasks. The GUI-Owl-1.5 models are open-sourced, and an online cloud-sandbox demo is available at https://github.com/X-PLUG/MobileAgent.",
  "summary_en": "GUI-Owl-1.5 is a multi-platform GUI agent model with multiple sizes that achieves state-of-the-art performance on GUI automation, grounding, tool-calling, and memory tasks through innovations in hybrid data pipelines, unified reasoning enhancement, and multi-platform reinforcement learning.",
  "summary_zh": "GUI-Owl-1.5 是一款具备多种尺寸的多平台 GUI 智能体模型，通过在混合数据流水线、统一推理增强和多平台强化学习方面的创新，在 GUI 自动化、grounding、工具调用和记忆任务上取得了最先进的性能。",
  "hf_url": "https://huggingface.co/papers/2602.16855",
  "arxiv_url": "https://arxiv.org/abs/2602.16855",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.16855",
  "github_url": "https://github.com/X-PLUG/MobileAgent/tree/main/Mobile-Agent-v3.5",
  "upvotes": 22,
  "fetched_at": "2026-02-21T01:52:56.793327+00:00"
}