{
  "date": "2026-02-20",
  "paper_id": "2602.17288",
  "title": "ArXiv-to-Model: A Practical Study of Scientific LM Training",
  "authors": [
    "Anuj Gupta"
  ],
  "abstract": "Training a 1.36B-parameter scientific language model from raw arXiv LaTeX sources demonstrates the impact of preprocessing decisions, tokenization, and infrastructure constraints on model development under limited computational resources. While frontier large language models demonstrate strong reasoning and mathematical capabilities, the practical process of training domain-specialized scientific language models from raw sources remains under-documented. In this work, we present a detailed case study of training a 1.36B-parameter scientific language model directly from raw arXiv LaTeX sources spanning mathematics, computer science, and theoretical physics. We describe an end-to-end pipeline covering metadata filtering, archive validation, LaTeX extraction, text normalization, domain-aware tokenization , and dense transformer training under constrained compute (2xA100 GPUs). Through 24 experimental runs, we analyze training stability , scaling behavior , data yield losses , and infrastructure bottlenecks . Our findings highlight how preprocessing decisions significantly affect usable token volume, how tokenization impacts symbolic stability, and how storage and I/O constraints can rival compute as limiting factors. We further analyze convergence dynamics and show stable training behavior in a data-rich regime (52B pretraining tokens). Rather than proposing a novel architecture, this work provides an engineering-grounded, transparent account of training a small scientific language model from scratch. We hope these insights support researchers operating under moderate compute budgets who seek to build domain-specialized models.",
  "summary_en": "Training a 1.36B-parameter scientific language model from raw arXiv LaTeX sources demonstrates the impact of preprocessing decisions, tokenization, and infrastructure constraints on model development under limited computational resources.",
  "summary_zh": "基于原始arXiv LaTeX源训练13.6亿参数的科学语言模型，展示了预处理决策、分词和基础设施约束在计算资源有限情况下对模型开发的影响。",
  "hf_url": "https://huggingface.co/papers/2602.17288",
  "arxiv_url": "https://arxiv.org/abs/2602.17288",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.17288",
  "github_url": "https://github.com/kitefishai/KiteFish-A1-1.5B-Math",
  "upvotes": 4,
  "fetched_at": "2026-02-21T01:53:04.592102+00:00"
}