{
  "date": "2026-02-20",
  "paper_id": "2602.17365",
  "title": "Computer-Using World Model",
  "authors": [
    "Yiming Guan",
    "Rui Yu",
    "John Zhang",
    "Lu Wang",
    "Chaoyun Zhang",
    "Liqun Li",
    "Bo Qiao",
    "Si Qin",
    "He Huang",
    "Fangkai Yang",
    "Pu Zhao",
    "Lukas Wutschitz",
    "Samuel Kessler",
    "Huseyin A Inan",
    "Robert Sim",
    "Saravan Rajmohan",
    "Qingwei Lin",
    "Dongmei Zhang"
  ],
  "abstract": "A world model for desktop software that predicts UI state changes through textual description followed by visual synthesis, improving decision quality and execution robustness in computer-using tasks. Agents operating in complex software environments benefit from reasoning about the consequences of their actions, as even a single incorrect user interface (UI) operation can derail long, artifact-preserving workflows. This challenge is particularly acute for computer-using scenarios, where real execution does not support counterfactual exploration, making large-scale trial-and-error learning and planning impractical despite the environment being fully digital and deterministic. We introduce the Computer-Using World Model (CUWM), a world model for desktop software that predicts the next UI state given the current state and a candidate action. CUWM adopts a two-stage factorization of UI dynamics: it first predicts a textual description of agent-relevant state changes, and then realizes these changes visually to synthesize the next screenshot. CUWM is trained on offline UI transitions collected from agents interacting with real Microsoft Office applications, and further refined with a lightweight reinforcement learning stage that aligns textual transition predictions with the structural requirements of computer-using environments . We evaluate CUWM via test-time action search , where a frozen agent uses the world model to simulate and compare candidate actions before execution. Across a range of Office tasks, world-model-guided test-time scaling improves decision quality and execution robustness.",
  "summary_en": "A world model for desktop software that predicts UI state changes through textual description followed by visual synthesis, improving decision quality and execution robustness in computer-using tasks.",
  "summary_zh": "一种用于桌面软件的世界模型，通过先文本描述后视觉合成的方式预测 UI 状态变化，进而提升计算机使用任务的决策质量与执行鲁棒性。",
  "hf_url": "https://huggingface.co/papers/2602.17365",
  "arxiv_url": "https://arxiv.org/abs/2602.17365",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.17365",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-21T01:53:07.596474+00:00"
}