{
  "date": "2026-02-20",
  "paper_id": "2602.16699",
  "title": "Calibrate-Then-Act: Cost-Aware Exploration in LLM Agents",
  "authors": [
    "Wenxuan Ding",
    "Nicholas Tomlin",
    "Greg Durrett"
  ],
  "abstract": "Large language models can be improved for complex tasks by explicitly reasoning about cost-uncertainty tradeoffs through a Calibrate-Then-Act framework that enhances decision-making in sequential environments. LLMs are increasingly being used for complex problems which are not necessarily resolved in a single response, but require interacting with an environment to acquire information. In these scenarios, LLMs must reason about inherent cost-uncertainty tradeoffs in when to stop exploring and commit to an answer. For instance, on a programming task, an LLM should test a generated code snippet if it is uncertain about the correctness of that code; the cost of writing a test is nonzero, but typically lower than the cost of making a mistake. In this work, we show that we can induce LLMs to explicitly reason about balancing these cost-uncertainty tradeoffs , then perform more optimal environment exploration . We formalize multiple tasks, including information retrieval and coding, as sequential decision-making problems under uncertainty. Each problem has latent environment state that can be reasoned about via a prior which is passed to the LLM agent. We introduce a framework called Calibrate-Then-Act (CTA), where we feed the LLM this additional context to enable it to act more optimally. This improvement is preserved even under RL training of both the baseline and CTA. Our results on information-seeking QA and on a simplified coding task show that making cost-benefit tradeoffs explicit with CTA can help agents discover more optimal decision-making strategies.",
  "summary_en": "Large language models can be improved for complex tasks by explicitly reasoning about cost-uncertainty tradeoffs through a Calibrate-Then-Act framework that enhances decision-making in sequential environments.",
  "summary_zh": "通过 Calibrate-Then-Act 框架显式推理成本-不确定性权衡，可在复杂任务上改进大语言模型，并增强序列环境中的决策能力。",
  "hf_url": "https://huggingface.co/papers/2602.16699",
  "arxiv_url": "https://arxiv.org/abs/2602.16699",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.16699",
  "github_url": "https://github.com/Wenwen-D/env-explorer",
  "upvotes": 11,
  "fetched_at": "2026-02-21T01:52:52.124534+00:00"
}