{
  "date": "2026-02-12",
  "paper_id": "2602.10177",
  "title": "Towards Autonomous Mathematics Research",
  "authors": [
    "Tony Feng",
    "Trieu H. Trinh",
    "Garrett Bingham",
    "Dawsen Hwang",
    "Yuri Chervonyi",
    "Junehyuk Jung",
    "Joonkyung Lee",
    "Carlo Pagano",
    "Sang-hyun Kim",
    "Federico Pasqualotto",
    "Sergei Gukov",
    "Jonathan N. Lee",
    "Junsu Kim",
    "Kaiying Hou",
    "Golnaz Ghiasi",
    "Yi Tay",
    "YaGuang Li",
    "Chenkai Kuang",
    "Yuan Liu",
    "Hanzhao",
    "Lin",
    "Evan Zheran Liu"
  ],
  "abstract": "Aletheia, a math research agent, demonstrates advanced reasoning capabilities by generating and verifying solutions end-to-end in natural language, achieving autonomous research outcomes from Olympiad problems to PhD-level exercises and contributing to AI-assisted mathematical research. Recent advances in foundational models have yielded reasoning systems capable of achieving a gold-medal standard at the International Mathematical Olympiad . The transition from competition-level problem-solving to professional research, however, requires navigating vast literature and constructing long-horizon proofs. In this work, we introduce Aletheia, a math research agent that iteratively generates, verifies, and revises solutions end-to-end in natural language. Specifically, Aletheia is powered by an advanced version of Gemini Deep Think for challenging reasoning problems, a novel inference-time scaling law that extends beyond Olympiad-level problems, and intensive tool use to navigate the complexities of mathematical research . We demonstrate the capability of Aletheia from Olympiad problems to PhD-level exercises and most notably, through several distinct milestones in AI-assisted mathematics research: (a) a research paper (Feng26) generated by AI without any human intervention in calculating certain structure constants in arithmetic geometry called eigenweights; (b) a research paper (LeeSeo26) demonstrating human-AI collaboration in proving bounds on systems of interacting particles called independent sets; and (c) an extensive semi-autonomous evaluation (Feng et al., 2026a) of 700 open problems on Bloom's Erdos Conjectures database, including autonomous solutions to four open questions. In order to help the public better understand the developments pertaining to AI and mathematics, we suggest codifying standard levels quantifying autonomy and novelty of AI-assisted results. We conclude with reflections on human-AI collaboration in mathematics.",
  "summary_en": "Aletheia, a math research agent, demonstrates advanced reasoning capabilities by generating and verifying solutions end-to-end in natural language, achieving autonomous research outcomes from Olympiad problems to PhD-level exercises and contributing to AI-assisted mathematical research.",
  "summary_zh": "Aletheia是一款数学研究智能体，通过端到端生成并验证自然语言解决方案展现先进推理能力，实现从奥林匹克竞赛题目到博士级别习题的自主研究成果，并为AI辅助数学研究做出贡献。",
  "hf_url": "https://huggingface.co/papers/2602.10177",
  "arxiv_url": "https://arxiv.org/abs/2602.10177",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.10177",
  "github_url": "",
  "upvotes": 35,
  "fetched_at": "2026-02-19T06:31:25.332847+00:00"
}