{
  "date": "2026-02-12",
  "paper_id": "2602.10604",
  "title": "Step 3.5 Flash: Open Frontier-Level Intelligence with 11B Active Parameters",
  "authors": [
    "Ailin Huang",
    "Ang Li",
    "Aobo Kong",
    "Bin Wang",
    "Binxing Jiao",
    "Bo Dong",
    "Bojun Wang",
    "Boyu Chen",
    "Brian Li",
    "Buyun Ma",
    "Chang Su",
    "Changxin Miao",
    "Changyi Wan",
    "Chao Lou",
    "Chen Hu",
    "Chen Xu",
    "Chenfeng Yu",
    "Chengting Feng",
    "Chengyuan Yao",
    "Chunrui Han",
    "Dan Ma",
    "Dapeng Shi"
  ],
  "abstract": "Step 3.5 Flash is a sparse Mixture-of-Experts model that achieves frontier-level agentic intelligence through efficient parameter utilization and optimized attention mechanisms, demonstrating strong performance across multiple benchmarks. We introduce Step 3.5 Flash, a sparse Mixture-of-Experts (MoE) model that bridges frontier-level agentic intelligence and computational efficiency. We focus on what matters most when building agents: sharp reasoning and fast, reliable execution. Step 3.5 Flash pairs a 196B-parameter foundation with 11B active parameters for efficient inference. It is optimized with interleaved 3:1 sliding-window/ full attention and Multi-Token Prediction (MTP-3) to reduce the latency and cost of multi-round agentic interactions. To reach frontier-level intelligence, we design a scalable reinforcement learning framework that combines verifiable signals with preference feedback , while remaining stable under large-scale off-policy training , enabling consistent self-improvement across mathematics, code, and tool use. Step 3.5 Flash demonstrates strong performance across agent, coding, and math tasks, achieving 85.4% on IMO-AnswerBench , 86.4% on LiveCodeBench -v6 (2024.08-2025.05), 88.2% on tau2-Bench , 69.0% on BrowseComp (with context management), and 51.0% on Terminal-Bench 2.0, comparable to frontier models such as GPT-5.2 xHigh and Gemini 3.0 Pro. By redefining the efficiency frontier, Step 3.5 Flash provides a high-density foundation for deploying sophisticated agents in real-world industrial environments.",
  "summary_en": "Step 3.5 Flash is a sparse Mixture-of-Experts model that achieves frontier-level agentic intelligence through efficient parameter utilization and optimized attention mechanisms, demonstrating strong performance across multiple benchmarks.",
  "summary_zh": "Step 3.5 Flash 是一种稀疏混合专家模型，通过高效的参数利用和优化的注意力机制实现了前沿水平的智能体智能，在多个基准测试中展现出强劲性能。",
  "hf_url": "https://huggingface.co/papers/2602.10604",
  "arxiv_url": "https://arxiv.org/abs/2602.10604",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.10604",
  "github_url": "https://github.com/stepfun-ai/Step-3.5-Flash",
  "upvotes": 176,
  "fetched_at": "2026-02-19T06:31:41.070741+00:00"
}