{
  "date": "2026-02-12",
  "paper_id": "2602.02192",
  "title": "ECHO-2: A Large-Scale Distributed Rollout Framework for Cost-Efficient Reinforcement Learning",
  "authors": [
    "Jie Xiao",
    "Meng Chen",
    "Qingnan Ren",
    "Jingwei Song",
    "Jiaqi Huang",
    "Yangshen Deng",
    "Chris Tong",
    "Wanyi Chen",
    "Suli Wang",
    "Ziqian Bi",
    "Shuo Lu",
    "Yiqun Duan",
    "Xu Wang",
    "Rymon Yu",
    "Ween Yang",
    "Lynn Ai",
    "Eric Yang",
    "Bill Shi",
    "Song Jingwei"
  ],
  "abstract": "ECHO-2 is a distributed reinforcement learning framework that enables efficient post-training of large language models by overlapping rollout generation, dissemination, and training while managing policy staleness and network latency. Reinforcement learning (RL) is a critical stage in post-training large language models (LLMs), involving repeated interaction between rollout generation , reward evaluation , and centralized learning . Distributing rollout execution offers opportunities to leverage more cost-efficient inference resources, but introduces challenges in wide-area coordination and policy dissemination. We present ECHO-2, a distributed RL framework for post-training with remote inference workers and non-negligible dissemination latency. ECHO-2 combines centralized learning with distributed rollouts and treats bounded policy staleness as a user-controlled parameter, enabling rollout generation , dissemination, and training to overlap. We introduce an overlap-based capacity model that relates training time, dissemination latency, and rollout throughput, yielding a practical provisioning rule for sustaining learner utilization. To mitigate dissemination bottlenecks and lower cost, ECHO-2 employs peer-assisted pipelined broadcast and cost-aware activation of heterogeneous workers. Experiments on GRPO post-training of 4B and 8B models under real wide-area bandwidth regimes show that ECHO-2 significantly improves cost efficiency while preserving RL reward comparable to strong baselines.",
  "summary_en": "ECHO-2 is a distributed reinforcement learning framework that enables efficient post-training of large language models by overlapping rollout generation, dissemination, and training while managing policy staleness and network latency.",
  "summary_zh": "ECHO-2是一种分布式强化学习框架，通过重叠rollout生成、分发与训练，并管理策略陈旧性和网络延迟，实现大语言模型的高效后训练。",
  "hf_url": "https://huggingface.co/papers/2602.02192",
  "arxiv_url": "https://arxiv.org/abs/2602.02192",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02192",
  "github_url": "",
  "upvotes": 12,
  "fetched_at": "2026-02-19T06:30:35.995286+00:00"
}