{
  "date": "2026-02-13",
  "paper_id": "2602.12092",
  "title": "DeepSight: An All-in-One LM Safety Toolkit",
  "authors": [
    "Bo Zhang",
    "Jiaxuan Guo",
    "Lijun Li",
    "Dongrui Liu",
    "Sujin Chen",
    "Guanxu Chen",
    "Zhijie Zheng",
    "Qihao Lin",
    "Lewen Yan",
    "Chen Qian",
    "Yijin Zhou",
    "Yuyao Wu",
    "Shaoxiong Guo",
    "Tianyi Du",
    "Jingyi Yang",
    "Xuhao Hu",
    "Ziqi Miao",
    "Xiaoya Lu",
    "Jing Shao",
    "Xia Hu"
  ],
  "abstract": "DeepSight is an open-source project that integrates safety evaluation and diagnosis for large language and multimodal models, enabling white-box insights through unified protocols and specialized toolkits. As the development of Large Models (LMs) progresses rapidly, their safety is also a priority. In current Large Language Models (LLMs) and Multimodal Large Language Models (MLLMs) safety workflow, evaluation, diagnosis, and alignment are often handled by separate tools. Specifically, safety evaluation can only locate external behavioral risks but cannot figure out internal root causes. Meanwhile, safety diagnosis often drifts from concrete risk scenarios and remains at the explainable level. In this way, safety alignment lack dedicated explanations of changes in internal mechanisms, potentially degrading general capabilities. To systematically address these issues, we propose an open-source project, namely DeepSight, to practice a new safety evaluation -diagnosis integrated paradigm. DeepSight is low-cost, reproducible, efficient, and highly scalable large-scale model safety evaluation project consisting of a evaluation toolkit DeepSafe and a diagnosis toolkit DeepScan . By unifying task and data protocols, we build a connection between the two stages and transform safety evaluation from black-box to white-box insight. Besides, DeepSight is the first open source toolkit that support the frontier AI risk evaluation and joint safety evaluation and diagnosis.",
  "summary_en": "DeepSight is an open-source project that integrates safety evaluation and diagnosis for large language and multimodal models, enabling white-box insights through unified protocols and specialized toolkits.",
  "summary_zh": "DeepSight 是一个开源项目，集成了大语言模型和多模态模型的安全性评估与诊断，通过统一协议和专用工具包实现白盒洞察。",
  "hf_url": "https://huggingface.co/papers/2602.12092",
  "arxiv_url": "https://arxiv.org/abs/2602.12092",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12092",
  "github_url": "https://github.com/AI45Lab/DeepScan/",
  "upvotes": 13,
  "fetched_at": "2026-02-19T06:38:48.198986+00:00"
}