{
  "date": "2026-02-13",
  "paper_id": "2602.12280",
  "title": "Stroke of Surprise: Progressive Semantic Illusions in Vector Sketching",
  "authors": [
    "Huai-Hsun Cheng",
    "Siang-Ling Zhang",
    "Yu-Lun Liu"
  ],
  "abstract": "Progressive Semantic Illusions use a generative framework with dual-branch Score Distillation Sampling to create vector sketches that transform semantically through sequential stroke additions, achieving superior recognizability and illusion strength. Visual illusions traditionally rely on spatial manipulations such as multi-view consistency. In this work, we introduce Progressive Semantic Illusions, a novel vector sketching task where a single sketch undergoes a dramatic semantic transformation through the sequential addition of strokes. We present Stroke of Surprise , a generative framework that optimizes vector strokes to satisfy distinct semantic interpretations at different drawing stages. The core challenge lies in the \"dual-constraint\": initial prefix strokes must form a coherent object (e.g., a duck) while simultaneously serving as the structural foundation for a second concept (e.g., a sheep) upon adding delta strokes. To address this, we propose a sequence-aware joint optimization framework driven by a dual-branch Score Distillation Sampling (SDS) mechanism. Unlike sequential approaches that freeze the initial state, our method dynamically adjusts prefix strokes to discover a \"common structural subspace \" valid for both targets. Furthermore, we introduce a novel Overlay Loss that enforces spatial complementarity, ensuring structural integration rather than occlusion. Extensive experiments demonstrate that our method significantly outperforms state-of-the-art baselines in recognizability and illusion strength, successfully expanding visual anagrams from the spatial to the temporal dimension. Project page: https://stroke-of-surprise.github.io/",
  "summary_en": "Progressive Semantic Illusions use a generative framework with dual-branch Score Distillation Sampling to create vector sketches that transform semantically through sequential stroke additions, achieving superior recognizability and illusion strength.",
  "summary_zh": "渐进式语义幻觉采用双分支分数蒸馏采样的生成框架，通过顺序添加笔画创建语义变换的矢量草图，实现了更优的可识别性和幻觉强度。",
  "hf_url": "https://huggingface.co/papers/2602.12280",
  "arxiv_url": "https://arxiv.org/abs/2602.12280",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12280",
  "github_url": "https://github.com/stroke-of-surprise/Stroke-Of-Surprise",
  "upvotes": 29,
  "fetched_at": "2026-02-19T06:39:10.881169+00:00"
}