{
  "date": "2026-02-24",
  "paper_id": "2602.18742",
  "title": "RoboCurate: Harnessing Diversity with Action-Verified Neural Trajectory for Robot Learning",
  "authors": [
    "Seungku Kim",
    "Suhyeok Jang",
    "Byungjun Yoon",
    "Dongyoung Kim",
    "John Won",
    "Jinwoo Shin"
  ],
  "abstract": "RoboCurate enhances synthetic robot learning data by evaluating action quality through simulator replay consistency and augmenting observation diversity via image editing and video transfer techniques. Synthetic data generated by video generative models has shown promise for robot learning as a scalable pipeline, but it often suffers from inconsistent action quality due to imperfectly generated videos. Recently, vision-language models (VLMs) have been leveraged to validate video quality, but they have limitations in distinguishing physically accurate videos and, even then, cannot directly evaluate the generated actions themselves. To tackle this issue, we introduce RoboCurate, a novel synthetic robot data generation framework that evaluates and filters the quality of annotated actions by comparing them with simulation replay. Specifically, RoboCurate replays the predicted actions in a simulator and assesses action quality by measuring the consistency of motion between the simulator rollout and the generated video. In addition, we unlock observation diversity beyond the available dataset via image-to-image editing and apply action-preserving video-to-video transfer to further augment appearance. We observe RoboCurate's generated data yield substantial relative improvements in success rates compared to using real data only, achieving +70.1% on GR-1 Tabletop (300 demos), +16.1% on DexMimicGen in the pre-training setup, and +179.9% in the challenging real-world ALLEX humanoid dexterous manipulation setting.",
  "summary_en": "RoboCurate enhances synthetic robot learning data by evaluating action quality through simulator replay consistency and augmenting observation diversity via image editing and video transfer techniques.",
  "summary_zh": "RoboCurate 通过模拟器回放一致性评估动作质量，并通过图像编辑与视频迁移技术增强观测多样性，从而提升合成机器人学习数据。",
  "hf_url": "https://huggingface.co/papers/2602.18742",
  "arxiv_url": "https://arxiv.org/abs/2602.18742",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.18742",
  "github_url": "",
  "upvotes": 7,
  "fetched_at": "2026-02-25T02:01:24.503436+00:00"
}