{
  "date": "2026-02-24",
  "paper_id": "2602.18532",
  "title": "VLANeXt: Recipes for Building Strong VLA Models",
  "authors": [
    "Xiao-Ming Wu",
    "Bin Fan",
    "Kang Liao",
    "Jian-Jian Jiang",
    "Runze Yang",
    "Yihang Luo",
    "Zhonghua Wu",
    "Wei-Shi Zheng",
    "Chen Change Loy"
  ],
  "abstract": "Vision-Language-Action models are systematically analyzed and optimized through a unified framework, resulting in the VLANeXt model that achieves superior performance on benchmark tasks and demonstrates strong real-world generalization. Following the rise of large foundation models , Vision-Language-Action models (VLAs) emerged, leveraging strong visual and language understanding for general-purpose policy learning . Yet, the current VLA landscape remains fragmented and exploratory. Although many groups have proposed their own VLA models, inconsistencies in training protocols and evaluation settings make it difficult to identify which design choices truly matter. To bring structure to this evolving space, we reexamine the VLA design space under a unified framework and evaluation setup. Starting from a simple VLA baseline similar to RT-2 and OpenVLA , we systematically dissect design choices along three dimensions: foundational components, perception essentials , and action modelling perspectives . From this study, we distill 12 key findings that together form a practical recipe for building strong VLA models. The outcome of this exploration is a simple yet effective model, VLANeXt . VLANeXt outperforms prior state-of-the-art methods on the LIBERO and LIBERO-plus benchmarks and demonstrates strong generalization in real-world experiments. We will release a unified, easy-to-use codebase that serves as a common platform for the community to reproduce our findings, explore the design space, and build new VLA variants on top of a shared foundation.",
  "summary_en": "Vision-Language-Action models are systematically analyzed and optimized through a unified framework, resulting in the VLANeXt model that achieves superior performance on benchmark tasks and demonstrates strong real-world generalization.",
  "summary_zh": "通过统一框架对Vision-Language-Action模型进行系统性分析与优化，所得到的VLANeXt模型在基准任务上性能更优，并展现出强大的真实世界泛化能力。",
  "hf_url": "https://huggingface.co/papers/2602.18532",
  "arxiv_url": "https://arxiv.org/abs/2602.18532",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.18532",
  "github_url": "https://github.com/DravenALG/VLANeXt",
  "upvotes": 39,
  "fetched_at": "2026-02-25T02:01:20.892119+00:00"
}