{
  "date": "2026-02-17",
  "count": 28,
  "papers": [
    {
      "date": "2026-02-17",
      "paper_id": "2602.10809",
      "title": "DeepImageSearch: Benchmarking Multimodal Agents for Context-Aware Image Retrieval in Visual Histories",
      "authors": [
        "Chenlong Deng",
        "Mengjie Deng",
        "Junjie Wu",
        "Dun Zeng",
        "Teng Wang",
        "Qingsong Xie",
        "Jiadeng Huang",
        "Shengjie Ma",
        "Changwang Zhang",
        "Zhaoxiang Wang",
        "Jun Wang",
        "Yutao Zhu",
        "Zhicheng Dou"
      ],
      "abstract": "DeepImageSearch presents an agentic approach to image retrieval that addresses limitations of traditional semantic matching by enabling multi-step reasoning over visual histories through a modular agent framework with dual-memory system. Existing multimodal retrieval systems excel at semantic matching but implicitly assume that query-image relevance can be measured in isolation. This paradigm overlooks the rich dependencies inherent in realistic visual streams , where information is distributed across temporal sequences rather than confined to single snapshots. To bridge this gap, we introduce DeepImageSearch, a novel agentic paradigm that reformulates image retrieval as an autonomous exploration task. Models must plan and perform multi-step reasoning over raw visual histories to locate targets based on implicit contextual cues . We construct DISBench , a challenging benchmark built on interconnected visual data. To address the scalability challenge of creating context-dependent queries, we propose a human-model collaborative pipeline that employs vision-language models to mine latent spatiotemporal associations , effectively offloading intensive context discovery before human verification. Furthermore, we build a robust baseline using a modular agent framework equipped with fine-grained tools and a dual-memory system for long-horizon navigation . Extensive experiments demonstrate that DISBench poses significant challenges to state-of-the-art models, highlighting the necessity of incorporating agentic reasoning into next-generation retrieval systems.",
      "summary_en": "DeepImageSearch presents an agentic approach to image retrieval that addresses limitations of traditional semantic matching by enabling multi-step reasoning over visual histories through a modular agent framework with dual-memory system.",
      "summary_zh": "DeepImageSearch 提出了一种用于图像检索的智能体方法，该方法通过配备双记忆系统的模块化智能体框架，实现对视觉历史的多步推理，从而解决传统语义匹配的局限性。",
      "hf_url": "https://huggingface.co/papers/2602.10809",
      "arxiv_url": "https://arxiv.org/abs/2602.10809",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.10809",
      "github_url": "https://github.com/RUC-NLPIR/DeepImageSearch",
      "upvotes": 24,
      "fetched_at": "2026-02-17T15:57:40.909289+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14492",
      "title": "Query as Anchor: Scenario-Adaptive User Representation via Large Language Model",
      "authors": [
        "Jiahao Yuan",
        "Yike Xu",
        "Jinyong Wen",
        "Baokun Wang",
        "Ziyi Gao",
        "Xiaotong Lin",
        "Yun Liu",
        "Xing Fu",
        "Yu Cheng",
        "Yongchao Liu",
        "Weiqiang Wang",
        "Zhongle Xie"
      ],
      "abstract": "A novel framework called Query-as-Anchor is introduced that transforms user modeling from static encoding to dynamic, query-aware synthesis using large language models with specialized architectures and training methods. Industrial-scale user representation learning requires balancing robust universality with acute task-sensitivity. However, existing paradigms primarily yield static, task-agnostic embeddings that struggle to reconcile the divergent requirements of downstream scenarios within unified vector spaces. Furthermore, heterogeneous multi-source data introduces inherent noise and modality conflicts, degrading representation. We propose Query-as-Anchor, a framework shifting user modeling from static encoding to dynamic, query-aware synthesis. To empower Large Language Models (LLMs) with deep user understanding, we first construct UserU , an industrial-scale pre-training dataset that aligns multi-modal behavioral sequences with user understanding semantics, and our Q-Anchor Embedding architecture integrates hierarchical coarse-to-fine encoders into dual-tower LLMs via joint contrastive-autoregressive optimization for query-aware user representation. To bridge the gap between general pre-training and specialized business logic, we further introduce Cluster-based Soft Prompt Tuning to enforce discriminative latent structures, effectively aligning model attention with scenario-specific modalities. For deployment, anchoring queries at sequence termini enables KV-cache-accelerated inference with negligible incremental latency. Evaluations on 10 Alipay industrial benchmarks show consistent SOTA performance, strong scalability, and efficient deployment. Large-scale online A/B testing in Alipay's production system across two real-world scenarios further validates its practical effectiveness. Our code is prepared for public release and will be available at: https://github.com/JhCircle/Q-Anchor.",
      "summary_en": "A novel framework called Query-as-Anchor is introduced that transforms user modeling from static encoding to dynamic, query-aware synthesis using large language models with specialized architectures and training methods.",
      "summary_zh": "本文提出了一种名为 Query-as-Anchor 的新框架，利用具有专门架构和训练方法的大语言模型，将用户建模从静态编码转变为动态、查询感知的合成。",
      "hf_url": "https://huggingface.co/papers/2602.14492",
      "arxiv_url": "https://arxiv.org/abs/2602.14492",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14492",
      "github_url": "https://github.com/JhCircle/Q-Anchor",
      "upvotes": 14,
      "fetched_at": "2026-02-17T15:57:58.685056+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13949",
      "title": "Experiential Reinforcement Learning",
      "authors": [
        "Taiwei Shi",
        "Sihao Chen",
        "Bowen Jiang",
        "Linxin Song",
        "Longqi Yang",
        "Jieyu Zhao"
      ],
      "abstract": "Experiential Reinforcement Learning introduces an explicit experience-reflection-consolidation loop that improves learning efficiency and performance in sparse-reward environments by enabling structured behavioral revision without additional inference costs. Reinforcement learning has become the central approach for language models (LMs) to learn from environmental reward or feedback. In practice, the environmental feedback is usually sparse and delayed. Learning from such signals is challenging, as LMs must implicitly infer how observed failures should translate into behavioral changes for future iterations. We introduce Experiential Reinforcement Learning (ERL), a training paradigm that embeds an explicit experience-reflection-consolidation loop into the reinforcement learning process. Given a task, the model generates an initial attempt, receives environmental feedback , and produces a reflection that guides a refined second attempt, whose success is reinforced and internalized into the base policy. This process converts feedback into structured behavioral revision , improving exploration and stabilizing optimization while preserving gains at deployment without additional inference cost. Across sparse-reward control environments and agentic reasoning benchmarks, ERL consistently improves learning efficiency and final performance over strong reinforcement learning baselines, achieving gains of up to +81% in complex multi-step environments and up to +11% in tool-using reasoning tasks. These results suggest that integrating explicit self-reflection into policy training provides a practical mechanism for transforming feedback into durable behavioral improvement.",
      "summary_en": "Experiential Reinforcement Learning introduces an explicit experience-reflection-consolidation loop that improves learning efficiency and performance in sparse-reward environments by enabling structured behavioral revision without additional inference costs.",
      "summary_zh": "Experiential Reinforcement Learning 引入了一种显式的 experience-reflection-consolidation 循环，通过在不增加额外推理成本的情况下实现结构化行为修正，提升了稀疏奖励环境中的学习效率与性能。",
      "hf_url": "https://huggingface.co/papers/2602.13949",
      "arxiv_url": "https://arxiv.org/abs/2602.13949",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13949",
      "github_url": "",
      "upvotes": 14,
      "fetched_at": "2026-02-17T15:57:50.538181+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14699",
      "title": "Qute: Towards Quantum-Native Database",
      "authors": [
        "Muzhi Chen",
        "Xuanhe Zhou",
        "Wei Zhou",
        "Bangrui Xu",
        "Surui Tang",
        "Guoliang Li",
        "Bingsheng He",
        "Yeye He",
        "Yitong Song",
        "Fan Wu"
      ],
      "abstract": "This paper envisions a quantum database (Qute) that treats quantum computation as a first-class execution option. Unlike prior simulation-based methods that either run quantum algorithms on classical machines or adapt existing databases for quantum simulation, Qute instead (i) compiles an extended form of SQL into gate-efficient quantum circuits, (ii) employs a hybrid optimizer to dynamically select between quantum and classical execution plans, (iii) introduces selective quantum indexing, and (iv) designs fidelity-preserving storage to mitigate current qubit constraints. We also present a three-stage evolution roadmap toward quantum-native database. Finally, by deploying Qute on a real quantum processor (origin_wukong), we show that it outperforms a classical baseline at scale, and we release an open-source prototype at https://github.com/weAIDB/Qute.",
      "summary_en": "This paper presents Qute, a quantum database that treats quantum computation as a first-class execution option. Qute compiles extended SQL into gate-efficient quantum circuits and employs a hybrid optimizer, selective quantum indexing, and fidelity-preserving storage to mitigate qubit constraints. Deployed on the origin_wukong quantum processor, Qute outperforms classical baselines at scale, and the authors release an open-source prototype.",
      "summary_zh": "本文提出Qute，一种将量子计算视为一级执行选项的量子数据库。Qute将扩展SQL编译为门高效的量子线路，并采用混合优化器、选择性量子索引和保真度保持存储来缓解量子比特约束。部署于origin_wukong量子处理器后，Qute在大规模下性能优于经典基线，且作者发布了开源原型。",
      "hf_url": "https://huggingface.co/papers/2602.14699",
      "arxiv_url": "https://arxiv.org/abs/2602.14699",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14699",
      "github_url": "https://github.com/weAIDB/Qute",
      "upvotes": 13,
      "fetched_at": "2026-02-17T15:58:02.921371+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14234",
      "title": "REDSearcher: A Scalable and Cost-Efficient Framework for Long-Horizon Search Agents",
      "authors": [
        "Zheng Chu",
        "Xiao Wang",
        "Jack Hong",
        "Huiming Fan",
        "Yuqi Huang",
        "Yue Yang",
        "Guohai Xu",
        "Chenxiao Zhao",
        "Cheng Xiang",
        "Shengchao Hu",
        "Dongdong Kuang",
        "Ming Liu",
        "Bing Qin",
        "Xing Yu"
      ],
      "abstract": "REDSearcher presents a unified framework for optimizing search agents through improved task synthesis, tool-augmented queries, midtraining capability enhancement, and simulated environments to address challenges in long-horizon search tasks. Large language models are transitioning from generalpurpose knowledge engines to realworld problem solvers, yet optimizing them for deep search tasks remains challenging. The central bottleneck lies in the extreme sparsity of highquality search trajectories and reward signals, arising from the difficulty of scalable longhorizon task construction and the high cost of interactionheavy rollouts involving external tool calls. To address these challenges, we propose REDSearcher, a unified framework that codesigns complex task synthesis , midtraining , and posttraining for scalable searchagent optimization. Specifically, REDSearcher introduces the following improvements: (1) We frame task synthesis as a dualconstrained optimization, where task difficulty is precisely governed by graph topology and evidence dispersion , allowing scalable generation of complex, highquality tasks. (2) We introduce toolaugmented queries to encourage proactive tool use rather than passive recall.(3) During midtraining , we strengthen core atomic capabilities knowledge , planning , and function calling substantially reducing the cost of collecting highquality trajectories for downstream training. (4) We build a local simulated environment that enables rapid, lowcost algorithmic iteration for reinforcement learning experiments. Across both textonly and multimodal searchagent benchmarks, our approach achieves stateoftheart performance. To facilitate future research on longhorizon search agents , we will release 10K highquality complex text search trajectories, 5K multimodal trajectories and 1K text RL query set, and together with code and model checkpoints.",
      "summary_en": "REDSearcher presents a unified framework for optimizing search agents through improved task synthesis, tool-augmented queries, midtraining capability enhancement, and simulated environments to address challenges in long-horizon search tasks.",
      "summary_zh": "REDSearcher 提出了一个统一框架，通过改进的任务合成、工具增强查询、中期训练能力增强和模拟环境来优化搜索智能体，以应对长程搜索任务中的挑战。",
      "hf_url": "https://huggingface.co/papers/2602.14234",
      "arxiv_url": "https://arxiv.org/abs/2602.14234",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14234",
      "github_url": "https://github.com/RedSearchAgent/REDSearcher",
      "upvotes": 13,
      "fetched_at": "2026-02-17T15:57:56.424041+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14367",
      "title": "InnoEval: On Research Idea Evaluation as a Knowledge-Grounded, Multi-Perspective Reasoning Problem",
      "authors": [
        "Shuofei Qiao",
        "Yunxiang Wei",
        "Xuehai Wang",
        "Bin Wu",
        "Boyang Xue",
        "Ningyu Zhang",
        "Hossein A. Rahmani",
        "Yanshan Wang",
        "Qiang Zhang",
        "Keyan Ding",
        "Jeff Z. Pan",
        "Huajun Chen",
        "Emine Yilmaz"
      ],
      "abstract": "InnoEval is a deep innovation evaluation framework that emulates human-level idea assessment through knowledge-grounded, multi-perspective reasoning with heterogeneous deep knowledge search and multi-dimensional decoupled evaluation. The rapid evolution of Large Language Models has catalyzed a surge in scientific idea production, yet this leap has not been accompanied by a matching advance in idea evaluation . The fundamental nature of scientific evaluation needs knowledgeable grounding, collective deliberation, and multi-criteria decision-making. However, existing idea evaluation methods often suffer from narrow knowledge horizons, flattened evaluation dimensions, and the inherent bias in LLM-as-a-Judge. To address these, we regard idea evaluation as a knowledge-grounded, multi-perspective reasoning problem and introduce InnoEval, a deep innovation evaluation framework designed to emulate human-level idea assessment. We apply a heterogeneous deep knowledge search engine that retrieves and grounds dynamic evidence from diverse online sources. We further achieve review consensus with an innovation review board containing reviewers with distinct academic backgrounds, enabling a multi-dimensional decoupled evaluation across multiple metrics. We construct comprehensive datasets derived from authoritative peer-reviewed submissions to benchmark InnoEval. Experiments demonstrate that InnoEval can consistently outperform baselines in point-wise, pair-wise, and group-wise evaluation tasks, exhibiting judgment patterns and consensus highly aligned with human experts.",
      "summary_en": "InnoEval is a deep innovation evaluation framework that emulates human-level idea assessment through knowledge-grounded, multi-perspective reasoning with heterogeneous deep knowledge search and multi-dimensional decoupled evaluation.",
      "summary_zh": "InnoEval 是一种深度创新评估框架，通过基于知识的多视角推理、异构深度知识检索与多维解耦评估，模拟人类水平的创意评估。",
      "hf_url": "https://huggingface.co/papers/2602.14367",
      "arxiv_url": "https://arxiv.org/abs/2602.14367",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14367",
      "github_url": "https://github.com/zjunlp/InnoEval",
      "upvotes": 12,
      "fetched_at": "2026-02-17T15:57:57.913951+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14041",
      "title": "BitDance: Scaling Autoregressive Generative Models with Binary Tokens",
      "authors": [
        "Yuang Ai",
        "Jiaming Han",
        "Shaobin Zhuang",
        "Weijia Mao",
        "Xuefeng Hu",
        "Ziyan Yang",
        "Zhenheng Yang",
        "Huaibo Huang",
        "Xiangyu Yue",
        "Hao Chen"
      ],
      "abstract": "BitDance is a scalable autoregressive image generator that uses binary visual tokens and diffusion-based methods to achieve efficient high-resolution image generation with improved speed and performance. We present BitDance, a scalable autoregressive (AR) image generator that predicts binary visual tokens instead of codebook indices. With high-entropy binary latents , BitDance lets each token represent up to 2^{256} states, yielding a compact yet highly expressive discrete representation. Sampling from such a huge token space is difficult with standard classification. To resolve this, BitDance uses a binary diffusion head : instead of predicting an index with softmax, it employs continuous-space diffusion to generate the binary tokens. Furthermore, we propose next-patch diffusion , a new decoding method that predicts multiple tokens in parallel with high accuracy, greatly speeding up inference. On ImageNet 256x256, BitDance achieves an FID of 1.24, the best among AR models. With next-patch diffusion , BitDance beats state-of-the-art parallel AR models that use 1.4B parameters, while using 5.4x fewer parameters (260M) and achieving 8.7x speedup. For text-to-image generation , BitDance trains on large-scale multimodal tokens and generates high-resolution, photorealistic images efficiently, showing strong performance and favorable scaling. When generating 1024x1024 images, BitDance achieves a speedup of over 30x compared to prior AR models. We release code and models to facilitate further research on AR foundation models. Code and models are available at: https://github.com/shallowdream204/BitDance.",
      "summary_en": "BitDance is a scalable autoregressive image generator that uses binary visual tokens and diffusion-based methods to achieve efficient high-resolution image generation with improved speed and performance.",
      "summary_zh": "BitDance是一种可扩展的自回归图像生成器，利用二进制视觉令牌和基于扩散的方法，实现高效的高分辨率图像生成，并在速度和性能方面均有提升。",
      "hf_url": "https://huggingface.co/papers/2602.14041",
      "arxiv_url": "https://arxiv.org/abs/2602.14041",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14041",
      "github_url": "https://github.com/shallowdream204/BitDance",
      "upvotes": 10,
      "fetched_at": "2026-02-17T15:57:52.051908+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.07824",
      "title": "Data Darwinism Part I: Unlocking the Value of Scientific Data for Pre-training",
      "authors": [
        "Yiwei Qin",
        "Zhen Huang",
        "Tiantian Mi",
        "Weiye Si",
        "Chenyang Zhou",
        "Qipeng Guo",
        "Siyuan Feng",
        "Pengfei Liu"
      ],
      "abstract": "Data Darwinism presents a systematic framework for data-model co-evolution through a ten-level taxonomy, demonstrating that advanced processing techniques significantly improve foundation model performance on scientific text. Data quality determines foundation model performance, yet systematic processing frameworks are lacking. We introduce Data Darwinism, a ten-level taxonomy (L0-L9) that conceptualizes data-model co-evolution : advanced models produce superior data for next-generation systems. We validate this on scientific literature by constructing Darwin-Science, a 900B-token corpus (L0-L5). We identify a learnability gap in raw scientific text, which we bridge via L4 ( Generative Refinement ) and L5 ( Cognitive Completion ) using frontier LLMs to explicate reasoning and terminology. To ensure rigorous attribution, we pre-trained daVinci-origin-3B/7B models from scratch, excluding scientific content to create contamination-free baselines. After 600B tokens of continued pre-training , Darwin-Science outperforms baselines by +2.12 (3B) and +2.95 (7B) points across 20+ benchmarks, rising to +5.60 and +8.40 points on domain-aligned tasks . Systematic progression to L5 yields a +1.36 total gain, confirming that higher-level processing unlocks latent data value. We release the Darwin-Science corpus and daVinci-origin models to enable principled, co-evolutionary development.",
      "summary_en": "Data Darwinism presents a systematic framework for data-model co-evolution through a ten-level taxonomy, demonstrating that advanced processing techniques significantly improve foundation model performance on scientific text.",
      "summary_zh": "Data Darwinism 提出了一个系统性的数据-模型协同进化框架，该框架通过十层分类体系，证明先进处理技术能够显著提升基础模型在科学文本上的性能。",
      "hf_url": "https://huggingface.co/papers/2602.07824",
      "arxiv_url": "https://arxiv.org/abs/2602.07824",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.07824",
      "github_url": "https://github.com/GAIR-NLP/Data-Darwinism",
      "upvotes": 10,
      "fetched_at": "2026-02-17T15:57:36.747333+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14178",
      "title": "UniWeTok: An Unified Binary Tokenizer with Codebook Size 2^{128} for Unified Multimodal Large Language Model",
      "authors": [
        "Shaobin Zhuang",
        "Yuang Ai",
        "Jiaming Han",
        "Weijia Mao",
        "Xiaohui Li",
        "Fangyikang Wang",
        "Xiao Wang",
        "Yan Li",
        "Shanchuan Lin",
        "Kun Xu",
        "Zhenheng Yang",
        "Huaibo Huang",
        "Xiangyu Yue",
        "Hao Chen",
        "Yali Wang"
      ],
      "abstract": "UniWeTok introduces a unified discrete tokenizer with a massive binary codebook and novel training techniques to achieve superior performance in image generation and multimodal tasks while reducing computational requirements. Unified Multimodal Large Language Models (MLLMs) require a visual representation that simultaneously supports high-fidelity reconstruction, complex semantic extraction, and generative suitability. However, existing visual tokenizers typically struggle to satisfy these conflicting objectives within a single framework. In this paper, we introduce UniWeTok, a unified discrete tokenizer designed to bridge this gap using a massive binary codebook (2^{128}). For training framework, we introduce Pre-Post Distillation and a Generative-Aware Prior to enhance the semantic extraction and generative prior of the discrete tokens. In terms of model architecture, we propose a convolution-attention hybrid architecture with the SigLu activation function . SigLu activation not only bounds the encoder output and stabilizes the semantic distillation process but also effectively addresses the optimization conflict between token entropy loss and commitment loss . We further propose a three-stage training framework designed to enhance UniWeTok's adaptability cross various image resolutions and perception-sensitive scenarios, such as those involving human faces and textual content. On ImageNet, UniWeTok achieves state-of-the-art image generation performance (FID: UniWeTok 1.38 vs. REPA 1.42) while requiring a remarkably low training compute (Training Tokens: UniWeTok 33B vs. REPA 262B). On general-domain, UniWeTok demonstrates highly competitive capabilities across a broad range of tasks, including multimodal understanding , image generation ( DPG Score : UniWeTok 86.63 vs. FLUX.1 [Dev] 83.84), and editing ( GEdit Overall Score : UniWeTok 5.09 vs. OmniGen 5.06). We release code and models to facilitate community exploration of unified tokenizer and MLLM.",
      "summary_en": "UniWeTok introduces a unified discrete tokenizer with a massive binary codebook and novel training techniques to achieve superior performance in image generation and multimodal tasks while reducing computational requirements.",
      "summary_zh": "UniWeTok引入了一种统一离散tokenizer，其采用大规模二进制码本和新颖的训练技术，在图像生成和多模态任务中实现了卓越性能，同时降低了计算需求。",
      "hf_url": "https://huggingface.co/papers/2602.14178",
      "arxiv_url": "https://arxiv.org/abs/2602.14178",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14178",
      "github_url": "https://github.com/shallowdream204/BitDance",
      "upvotes": 6,
      "fetched_at": "2026-02-17T15:57:55.097541+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13367",
      "title": "Nanbeige4.1-3B: A Small General Model that Reasons, Aligns, and Acts",
      "authors": [
        "Chen Yang",
        "Guangyue Peng",
        "Jiaying Zhu",
        "Ran Le",
        "Ruixiang Feng",
        "Tao Zhang",
        "Xiyun Xu",
        "Yang Song",
        "Yiming Jia",
        "Yuntao Wen",
        "Yunzhi Xu",
        "Zekai Wang",
        "Zhenwei An",
        "Zhicong Sun",
        "Zongchao Chen"
      ],
      "abstract": "Nanbeige4.1-3B is a 3B-parameter unified language model that demonstrates superior performance in agentic behavior, code generation, and reasoning compared to larger models through advanced reward modeling and training techniques. We present Nanbeige4.1-3B, a unified generalist language model that simultaneously achieves strong agentic behavior , code generation , and general reasoning with only 3B parameters. To the best of our knowledge, it is the first open-source small language model (SLM) to achieve such versatility in a single model. To improve reasoning and preference alignment, we combine point-wise and pair-wise reward modeling , ensuring high-quality, human-aligned responses . For code generation , we design complexity-aware rewards in Reinforcement Learning , optimizing both correctness and efficiency. In deep search , we perform complex data synthesis and incorporate turn-level supervision during training. This enables stable long-horizon tool interactions, allowing Nanbeige4.1-3B to reliably execute up to 600 tool-call turns for complex problem-solving. Extensive experimental results show that Nanbeige4.1-3B significantly outperforms prior models of similar scale, such as Nanbeige4-3B-2511 and Qwen3-4B, even achieving superior performance compared to much larger models, such as Qwen3-30B-A3B. Our results demonstrate that small models can achieve both broad competence and strong specialization simultaneously, redefining the potential of 3B parameter models.",
      "summary_en": "Nanbeige4.1-3B is a 3B-parameter unified language model that demonstrates superior performance in agentic behavior, code generation, and reasoning compared to larger models through advanced reward modeling and training techniques.",
      "summary_zh": "Nanbeige4.1-3B是一个3B参数的统一语言模型，通过先进的奖励建模和训练技术，在agentic行为、代码生成和推理方面展现出相较于更大模型更优的性能。",
      "hf_url": "https://huggingface.co/papers/2602.13367",
      "arxiv_url": "https://arxiv.org/abs/2602.13367",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13367",
      "github_url": "",
      "upvotes": 6,
      "fetched_at": "2026-02-17T15:57:47.965838+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13823",
      "title": "Embed-RL: Reinforcement Learning for Reasoning-Driven Multimodal Embeddings",
      "authors": [
        "Haonan Jiang",
        "Yuji Wang",
        "Yongjie Zhu",
        "Xin Lu",
        "Wenyu Qin",
        "Meng Wang",
        "Pengfei Wan",
        "Yansong Tang"
      ],
      "abstract": "A reasoning-driven universal multimodal embedding framework integrates embedder-guided reinforcement learning with traceability chain-of-thought to enhance cross-modal semantic consistency and retrieval performance. Leveraging Multimodal Large Language Models (MLLMs) has become pivotal for advancing Universal Multimodal Embeddings (UME) in addressing diverse cross-modal tasks . Recent studies demonstrate that incorporating generative Chain-of-Thought (CoT) reasoning can substantially enhance task-specific representations compared to discriminative methods. However, the generated reasoning CoTs of existing generative embedding methods are limited to the textual analysis of queries and are irrelevant to the retrieval of the targets. To address these limitations, we propose a reasoning-driven UME framework that integrates Embedder-Guided Reinforcement Learning (EG-RL) to optimize the Reasoner to produce evidential Traceability CoT (T-CoT). Our key contributions are threefold: (1) We design an EG-RL framework where the Embedder provides explicit supervision to the Reasoner , ensuring the generated CoT traces are aligned with embedding tasks. (2) We introduce T-CoT, which extracts critical multimodal cues to focus on retrieval-relevant elements and provides multimodal inputs for the Embedder. (3) With limited computational resources, our framework outperforms the pioneering embedding model on both MMEB-V2 and UVRB benchmarks. The integration of multimodal evidence in structured reasoning, paired with retrieval-oriented alignment , effectively strengthens cross-modal semantic consistency and boosts the fine-grained matching capability of the model as well as the generalization across complex scenarios. Our work demonstrates that targeted reasoning optimization can significantly improve multimodal embedding quality, providing a practical and efficient solution for reasoning-driven UME development.",
      "summary_en": "A reasoning-driven universal multimodal embedding framework integrates embedder-guided reinforcement learning with traceability chain-of-thought to enhance cross-modal semantic consistency and retrieval performance.",
      "summary_zh": "一种推理驱动的通用多模态 embedding 框架整合了 embedder-guided 强化学习与可追溯 chain-of-thought，以增强跨模态语义一致性和检索性能。",
      "hf_url": "https://huggingface.co/papers/2602.13823",
      "arxiv_url": "https://arxiv.org/abs/2602.13823",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13823",
      "github_url": "https://github.com/ZoengHN/Embed-RL",
      "upvotes": 5,
      "fetched_at": "2026-02-17T15:57:49.818770+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.12876",
      "title": "BrowseComp-V^3: A Visual, Vertical, and Verifiable Benchmark for Multimodal Browsing Agents",
      "authors": [
        "Huanyao Zhang",
        "Jiepeng Zhou",
        "Bo Li",
        "Bowen Zhou",
        "Yanzhe Dan",
        "Haishan Lu",
        "Zhiyong Cao",
        "Jiaoyang Chen",
        "Yuqian Han",
        "Zinan Sheng",
        "Zhengwei Tao",
        "Hao Liang",
        "Jialong Wu",
        "Yang Shi",
        "Yuanpeng He",
        "Jiaye Lin",
        "Qintong Zhang",
        "Guochen Yan",
        "Runhao Zhao",
        "Zhengpin Li",
        "Xiaohan Yu",
        "Lang Mei"
      ],
      "abstract": "A new benchmark called BrowseComp-V3 challenges multimodal large language models with complex, multi-hop reasoning tasks requiring deep search across text and visual modalities, revealing significant gaps in current capabilities. Multimodal large language models (MLLMs), equipped with increasingly advanced planning and tool-use capabilities, are evolving into autonomous agents capable of performing multimodal web browsing and deep search in open-world environments. However, existing benchmarks for multimodal browsing remain limited in task complexity, evidence accessibility, and evaluation granularity, hindering comprehensive and reproducible assessments of deep search capabilities. To address these limitations, we introduce BrowseComp-V^3, a novel benchmark consisting of 300 carefully curated and challenging questions spanning diverse domains. The benchmark emphasizes deep, multi-level, and cross-modal multi-hop reasoning, where critical evidence is interleaved across textual and visual modalities within and across web pages. All supporting evidence is strictly required to be publicly searchable, ensuring fairness and reproducibility. Beyond final-answer accuracy, we incorporate an expert-validated, subgoal-driven process evaluation mechanism that enables fine-grained analysis of intermediate reasoning behaviors and systematic characterization of capability boundaries. In addition, we propose OmniSeeker, a unified multimodal browsing agent framework integrating diverse web search and visual perception tools. Comprehensive experiments demonstrate that even state-of-the-art models achieve only 36% accuracy on our benchmark, revealing critical bottlenecks in multimodal information integration and fine-grained perception . Our results highlight a fundamental gap between current model capabilities and robust multimodal deep search in real-world settings.",
      "summary_en": "A new benchmark called BrowseComp-V3 challenges multimodal large language models with complex, multi-hop reasoning tasks requiring deep search across text and visual modalities, revealing significant gaps in current capabilities.",
      "summary_zh": "一项名为 BrowseComp-V3 的新基准通过需要在文本和视觉模态间进行深度搜索的复杂多跳推理任务挑战多模态大语言模型，揭示了当前能力的显著差距。",
      "hf_url": "https://huggingface.co/papers/2602.12876",
      "arxiv_url": "https://arxiv.org/abs/2602.12876",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12876",
      "github_url": "",
      "upvotes": 5,
      "fetched_at": "2026-02-17T15:57:44.766475+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13195",
      "title": "Conversational Image Segmentation: Grounding Abstract Concepts with Scalable Supervision",
      "authors": [
        "Aadarsh Sahoo",
        "Georgia Gkioxari"
      ],
      "abstract": "Conversational image segmentation addresses functional and physical reasoning tasks by introducing a new benchmark and model that combines segmentation priors with language understanding. Conversational image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.g., \"left-most apple\") and overlooks functional and physical reasoning (e.g., \"where can I safely store the knife?\"). We address this gap and introduce Conversational Image Segmentation (CIS) and ConverSeg, a benchmark spanning entities, spatial relations, intent, affordances, functions, safety, and physical reasoning. We also present ConverSeg-Net, which fuses strong segmentation priors with language understanding , and an AI-powered data engine that generates prompt-mask pairs without human supervision. We show that current language-guided segmentation models are inadequate for CIS, while ConverSeg-Net trained on our data engine achieves significant gains on ConverSeg and maintains strong performance on existing language-guided segmentation benchmarks. Project webpage: https://glab-caltech.github.io/converseg/",
      "summary_en": "Conversational image segmentation addresses functional and physical reasoning tasks by introducing a new benchmark and model that combines segmentation priors with language understanding.",
      "summary_zh": "对话式图像分割通过引入结合分割先验与语言理解的新基准和模型，解决功能性和物理性推理任务。",
      "hf_url": "https://huggingface.co/papers/2602.13195",
      "arxiv_url": "https://arxiv.org/abs/2602.13195",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13195",
      "github_url": "https://github.com/AadSah/ConverSeg",
      "upvotes": 4,
      "fetched_at": "2026-02-17T15:57:46.229181+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14147",
      "title": "LaViDa-R1: Advancing Reasoning for Unified Multimodal Diffusion Language Models",
      "authors": [
        "Shufan Li",
        "Yuchen Zhu",
        "Jiuxiang Gu",
        "Kangning Liu",
        "Zhe Lin",
        "Yongxin Chen",
        "Molei Tao",
        "Aditya Grover",
        "Jason Kuen"
      ],
      "abstract": "LaViDa-R1 is a multimodal reasoning diffusion language model that unifies supervised fine-tuning and multi-task reinforcement learning with novel training techniques for enhanced performance across visual reasoning and generation tasks. Diffusion language models (dLLMs) recently emerged as a promising alternative to auto-regressive LLMs. The latest works further extended it to multimodal understanding and generation tasks. In this work, we propose LaViDa-R1, a multimodal, general-purpose reasoning dLLM. Unlike existing works that build reasoning dLLMs through task-specific reinforcement learning, LaViDa-R1 incorporates diverse multimodal understanding and generation tasks in a unified manner. In particular, LaViDa-R1 is built with a novel unified post-training framework that seamlessly integrates supervised finetuning (SFT) and multi-task reinforcement learning (RL). It employs several novel training techniques, including answer-forcing , tree search , and complementary likelihood estimation , to enhance effectiveness and scalability. Extensive experiments demonstrate LaViDa-R1's strong performance on a wide range of multimodal tasks, including visual math reasoning , reason-intensive grounding , and image editing .",
      "summary_en": "LaViDa-R1 is a multimodal reasoning diffusion language model that unifies supervised fine-tuning and multi-task reinforcement learning with novel training techniques for enhanced performance across visual reasoning and generation tasks.",
      "summary_zh": "LaViDa-R1 是一种多模态推理扩散语言模型，它通过新颖的训练技术统一了监督微调与多任务强化学习，从而在视觉推理和生成任务中实现了性能提升。",
      "hf_url": "https://huggingface.co/papers/2602.14147",
      "arxiv_url": "https://arxiv.org/abs/2602.14147",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14147",
      "github_url": "",
      "upvotes": 3,
      "fetched_at": "2026-02-17T15:57:53.734573+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13344",
      "title": "FireRed-Image-Edit-1.0 Techinical Report",
      "authors": [
        "Super Intelligence Team",
        "Changhao Qiao",
        "Chao Hui",
        "Chen Li",
        "Cunzheng Wang",
        "Dejia Song",
        "Jiale Zhang",
        "Jing Li",
        "Qiang Xiang",
        "Runqi Wang",
        "Shuang Sun",
        "Wei Zhu",
        "Xu Tang",
        "Yao Hu",
        "Yibo Chen",
        "Yuhao Huang",
        "Yuxuan Duan",
        "Zhiyi Chen",
        "Ziyuan Guo"
      ],
      "abstract": "FireRed-Image-Edit uses a diffusion transformer with optimized data curation and training methods to achieve state-of-the-art performance in instruction-based image editing, supported by a comprehensive benchmark and novel techniques for data efficiency and optimization stability. We present FireRed-Image-Edit, a diffusion transformer for instruction-based image editing that achieves state-of-the-art performance through systematic optimization of data curation , training methodology , and evaluation design . We construct a 1.6B-sample training corpus, comprising 900M text-to-image and 700M image editing pairs from diverse sources. After rigorous cleaning, stratification, auto-labeling, and two-stage filtering, we retain over 100M high-quality samples balanced between generation and editing, ensuring strong semantic coverage and instruction alignment. Our multi-stage training pipeline progressively builds editing capability via pre-training, supervised fine-tuning, and reinforcement learning. To improve data efficiency, we introduce a Multi-Condition Aware Bucket Sampler for variable-resolution batching and Stochastic Instruction Alignment with dynamic prompt re-indexing. To stabilize optimization and enhance controllability, we propose Asymmetric Gradient Optimization for DPO , DiffusionNFT with layout-aware OCR rewards for text editing, and a differentiable Consistency Loss for identity preservation. We further establish REDEdit-Bench , a comprehensive benchmark spanning 15 editing categories, including newly introduced beautification and low-level enhancement tasks. Extensive experiments on REDEdit-Bench and public benchmarks ( ImgEdit and GEdit ) demonstrate competitive or superior performance against both open-source and proprietary systems. We release code, models, and the benchmark suite to support future research.",
      "summary_en": "FireRed-Image-Edit uses a diffusion transformer with optimized data curation and training methods to achieve state-of-the-art performance in instruction-based image editing, supported by a comprehensive benchmark and novel techniques for data efficiency and optimization stability.",
      "summary_zh": "FireRed-Image-Edit 采用 diffusion transformer，结合优化的数据整理与训练方法，在 instruction-based image editing 中实现了 SOTA 性能，并辅以 comprehensive benchmark 以及提升数据效率和优化稳定性的新技术。",
      "hf_url": "https://huggingface.co/papers/2602.13344",
      "arxiv_url": "https://arxiv.org/abs/2602.13344",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13344",
      "github_url": "https://github.com/FireRedTeam/FireRed-Image-Edit",
      "upvotes": 3,
      "fetched_at": "2026-02-17T15:57:47.256611+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14721",
      "title": "WebWorld: A Large-Scale World Model for Web Agent Training",
      "authors": [
        "Zikai Xiao",
        "Jianhong Tu",
        "Chuhang Zou",
        "Yuxin Zuo",
        "Zhi Li",
        "Peng Wang",
        "Bowen Yu",
        "Fei Huang",
        "Junyang Lin",
        "Zuozhu Liu"
      ],
      "abstract": "Web agents require massive trajectories to generalize, yet real-world training is constrained by network latency, rate limits, and safety risks. We introduce WebWorld series, the first open- web simulator trained at scale. While existing simulators are restricted to closed environments with thousands of trajectories, WebWorld leverages a scalable data pipeline to train on 1M+ open-web interactions, supporting reasoning, multi-format data, and long-horizon simulations of 30+ steps. For intrinsic evaluation , we introduce WebWorld-Bench with dual metrics spanning nine dimensions, where WebWorld achieves simulation performance comparable to Gemini-3-Pro. For extrinsic evaluation , Qwen3-14B trained on WebWorld-synthesized trajectories improves by +9.2\\% on WebArena, reaching performance comparable to GPT-4o. WebWorld enables effective inference-time search , outperforming GPT-5 as a world model . Beyond web simulation, WebWorld exhibits cross-domain generalization to code, GUI, and game environments, providing a replicable recipe for world model construction.",
      "summary_en": "Web agents require massive trajectories to generalize, yet real-world training is constrained by network latency, rate limits, and safety risks. We introduce WebWorld series, the first open- web simulator trained at scale. While existing simulators are restricted to closed environments with thousands of trajectories, WebWorld leverages a scalable data pipeline to train on 1M+ open-web interactions, supporting reasoning, multi-format data, and long-horizon simulations of 30+ steps. For intrinsic evaluation , we introduce WebWorld-Bench with dual metrics spanning nine dimensions, where WebWorld achieves simulation performance comparable to Gemini-3-Pro. For extrinsic evaluation , Qwen3-14B trained on WebWorld-synthesized trajectories improves by +9.2\\% on WebArena, reaching performance comparable to GPT-4o. WebWorld enables effective inference-time search , outperforming GPT-5 as a world model . Beyond web simulation, WebWorld exhibits cross-domain generalization to code, GUI, and game environments, providing a replicable recipe for world model construction.",
      "summary_zh": "网页智能体需要大量轨迹来实现泛化，但真实世界训练受限于网络延迟、速率限制和安全风险。我们推出 WebWorld 系列，首个大规模训练的开放网页模拟器。现有模拟器局限于包含数千条轨迹的封闭环境，而 WebWorld 利用可扩展的数据流水线，基于 100 万+ 开放网页交互进行训练，支持推理、多格式数据以及 30+ 步的长程模拟。对于内在评估，我们引入 WebWorld-Bench，其双重指标涵盖九个维度，WebWorld 在该基准上达到与 Gemini-3-Pro 可比的模拟性能。对于外部评估，在 WebWorld 合成轨迹上训练的 Qwen3-14B 在 WebArena 上提升 +9.2%，性能达到与 GPT-4o 相当的水平。WebWorld 实现有效的推理时搜索，作为世界模型其性能优于 GPT-5。除网页模拟外，WebWorld 还展现出对代码、GUI 和游戏环境的跨域泛化能力，为世界模型构建提供可复现的方案。",
      "hf_url": "https://huggingface.co/papers/2602.14721",
      "arxiv_url": "https://arxiv.org/abs/2602.14721",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14721",
      "github_url": "",
      "upvotes": 2,
      "fetched_at": "2026-02-17T15:58:04.330698+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14534",
      "title": "MoRL: Reinforced Reasoning for Unified Motion Understanding and Generation",
      "authors": [
        "Hongpeng Wang",
        "Zeyu Zhang",
        "Wenhao Li",
        "Hao Tang"
      ],
      "abstract": "A unified multimodal motion model trained with supervised fine-tuning and reinforcement learning with verifiable rewards improves human motion understanding and generation through semantic alignment, reasoning coherence, and physical plausibility. Human motion understanding and generation are crucial for vision and robotics but remain limited in reasoning capability and test-time planning. We propose MoRL, a unified multimodal motion model trained with supervised fine-tuning and reinforcement learning with verifiable rewards . Our task-specific reward design combines semantic alignment and reasoning coherence for understanding with physical plausibility and text-motion consistency for generation, improving both logical reasoning and perceptual realism. To further enhance inference, we introduce Chain-of-Motion (CoM), a test-time reasoning method that enables step-by-step planning and reflection. We also construct two large-scale CoT datasets , MoUnd-CoT-140K and MoGen-CoT-140K, to align motion sequences with reasoning traces and action descriptions. Experiments on HumanML3D and KIT-ML show that MoRL achieves significant gains over state-of-the-art baselines. Code: https://github.com/AIGeeksGroup/MoRL. Website: https://aigeeksgroup.github.io/MoRL.",
      "summary_en": "A unified multimodal motion model trained with supervised fine-tuning and reinforcement learning with verifiable rewards improves human motion understanding and generation through semantic alignment, reasoning coherence, and physical plausibility.",
      "summary_zh": "通过监督微调和可验证奖励的强化学习训练的统一多模态运动模型，通过语义对齐、推理连贯性和物理合理性，提升了人体运动理解与生成能力。",
      "hf_url": "https://huggingface.co/papers/2602.14534",
      "arxiv_url": "https://arxiv.org/abs/2602.14534",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14534",
      "github_url": "https://github.com/AIGeeksGroup/MoRL",
      "upvotes": 2,
      "fetched_at": "2026-02-17T15:57:59.624552+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14060",
      "title": "LM-Lexicon: Improving Definition Modeling via Harmonizing Semantic Experts",
      "authors": [
        "Yang Liu",
        "Jiaye Yang",
        "Weikang Li",
        "Jiahui Liang",
        "Yang Li",
        "Lingyong Yan"
      ],
      "abstract": "LM-Lexicon improves definition modeling through data clustering, semantic expert learning, and sparse mixture-of-experts architecture, achieving higher BLEU scores and better expert specialization. We introduce LM-Lexicon, an innovative definition modeling approach that incorporates data clustering , semantic expert learning , and model merging using a sparse mixture-of-experts architecture . By decomposing the definition modeling task into specialized semantic domains , where small language models are trained as domain experts , LM-Lexicon achieves substantial improvements (+7% BLEU score compared with the prior state-of-the-art model) over existing methods on five widely used benchmarks. Empirically, we demonstrate that 1) the clustering strategy enables fine-grained expert specialization with nearly 10% improvement in definition quality; 2) the semantic-aware domain-level routing mechanism achieves higher expert efficacy (+1%) than conventional token-level routing; and 3) further performance gains can be obtained through test-time compute and semantic expert scaling. Our work advances definition modeling while providing insights into the development of efficient language models for semantic-intensive applications.",
      "summary_en": "LM-Lexicon improves definition modeling through data clustering, semantic expert learning, and sparse mixture-of-experts architecture, achieving higher BLEU scores and better expert specialization.",
      "summary_zh": "LM-Lexicon通过数据聚类、语义专家学习和稀疏混合专家架构改进定义建模，实现了更高的BLEU分数和更好的专家特化。",
      "hf_url": "https://huggingface.co/papers/2602.14060",
      "arxiv_url": "https://arxiv.org/abs/2602.14060",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14060",
      "github_url": "https://github.com/jacklanda/LMLexicon",
      "upvotes": 2,
      "fetched_at": "2026-02-17T15:57:52.665140+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.09185",
      "title": "AIDev: Studying AI Coding Agents on GitHub",
      "authors": [
        "Hao Li",
        "Haoxiang Zhang",
        "Ahmed E. Hassan"
      ],
      "abstract": "AIDev is a large-scale dataset of agent-authored pull requests from real-world GitHub repositories that captures AI coding agent usage in practical software development scenarios. AI coding agents are rapidly transforming software engineering by performing tasks such as feature development, debugging, and testing. Despite their growing impact, the research community lacks a comprehensive dataset capturing how these agents are used in real-world projects. To address this gap, we introduce AIDev, a large-scale dataset focused on agent-authored pull requests (Agentic-PRs) in real-world GitHub repositories . AIDev aggregates 932,791 Agentic-PRs produced by five agents: OpenAI Codex, Devin, GitHub Copilot, Cursor, and Claude Code. These PRs span 116,211 repositories and involve 72,189 developers. In addition, AIDev includes a curated subset of 33,596 Agentic-PRs from 2,807 repositories with over 100 stars, providing further information such as comments, reviews, commits, and related issues. This dataset offers a foundation for future research on AI adoption, developer productivity , and human-AI collaboration in the new era of software engineering. > AI Agent, Agentic AI, Coding Agent, Agentic Coding, Agentic Software Engineering , Agentic Engineering",
      "summary_en": "AIDev is a large-scale dataset of agent-authored pull requests from real-world GitHub repositories that captures AI coding agent usage in practical software development scenarios.",
      "summary_zh": "AIDev是一个大规模数据集，收录了真实GitHub仓库中由agent编写的pull request，捕捉了AI coding agent在实际软件开发场景中的使用情况。",
      "hf_url": "https://huggingface.co/papers/2602.09185",
      "arxiv_url": "https://arxiv.org/abs/2602.09185",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.09185",
      "github_url": "",
      "upvotes": 2,
      "fetched_at": "2026-02-17T15:57:38.181506+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14689",
      "title": "Exposing the Systematic Vulnerability of Open-Weight Models to Prefill Attacks",
      "authors": [
        "Lukas Struppek",
        "Adam Gleave",
        "Kellin Pelrine"
      ],
      "abstract": "Prefill attacks represent a significant and underexplored vulnerability in open-weight language models, affecting major contemporary models despite some resistance from large reasoning models. As the capabilities of large language models continue to advance, so does their potential for misuse. While closed-source models typically rely on external defenses , open-weight models must primarily depend on internal safeguards to mitigate harmful behavior. Prior red-teaming research has largely focused on input-based jailbreaking and parameter-level manipulations. However, open-weight models also natively support prefilling , which allows an attacker to predefine initial response tokens before generation begins. Despite its potential, this attack vector has received little systematic attention. We present the largest empirical study to date of prefill attacks, evaluating over 20 existing and novel strategies across multiple model families and state-of-the-art open-weight models . Our results show that prefill attacks are consistently effective against all major contemporary open-weight models , revealing a critical and previously underexplored vulnerability with significant implications for deployment. While certain large reasoning models exhibit some robustness against generic prefilling , they remain vulnerable to tailored, model-specific strategies . Our findings underscore the urgent need for model developers to prioritize defenses against prefill attacks in open-weight LLMs.",
      "summary_en": "Prefill attacks represent a significant and underexplored vulnerability in open-weight language models, affecting major contemporary models despite some resistance from large reasoning models.",
      "summary_zh": "Prefill attacks 代表了开放权重语言模型中一种重大且未被充分探索的漏洞，影响着主流当代模型，尽管大型推理模型对此表现出一定的抵抗性。",
      "hf_url": "https://huggingface.co/papers/2602.14689",
      "arxiv_url": "https://arxiv.org/abs/2602.14689",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14689",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:58:01.257492+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.12586",
      "title": "Can I Have Your Order? Monte-Carlo Tree Search for Slot Filling Ordering in Diffusion Language Models",
      "authors": [
        "Joshua Ong Jun Leang",
        "Yu Zhao",
        "Mihaela Cătălina Stoian",
        "Wenda Li",
        "Shay B. Cohen",
        "Eleonora Giunchiglia"
      ],
      "abstract": "McDiffuSE enhances Masked Diffusion Models by optimizing slot infilling order through Monte Carlo Tree Search, improving reasoning task performance through strategic exploration of generation sequences. While plan-and-infill decoding in Masked Diffusion Models (MDMs) shows promise for mathematical and code reasoning, performance remains highly sensitive to slot infilling order, often yielding substantial output variance. We introduce McDiffuSE, a framework that formulates slot selection as decision making and optimises infilling orders through Monte Carlo Tree Search (MCTS). McDiffuSE uses look-ahead simulations to evaluate partial completions before commitment, systematically exploring the combinatorial space of generation orders . Experiments show an average improvement of 3.2% over autoregressive baselines and 8.0% over baseline plan-and-infill, with notable gains of 19.5% on MBPP and 4.9% on MATH500. Our analysis reveals that while McDiffuSE predominantly follows sequential ordering, incorporating non-sequential generation is essential for maximising performance. We observe that larger exploration constants, rather than increased simulations, are necessary to overcome model confidence biases and discover effective orderings. These findings establish MCTS-based planning as an effective approach for enhancing generation quality in MDMs.",
      "summary_en": "McDiffuSE enhances Masked Diffusion Models by optimizing slot infilling order through Monte Carlo Tree Search, improving reasoning task performance through strategic exploration of generation sequences.",
      "summary_zh": "McDiffuSE通过Monte Carlo Tree Search优化slot infilling order以增强Masked Diffusion Models，并通过strategic exploration of generation sequences提升reasoning task performance。",
      "hf_url": "https://huggingface.co/papers/2602.12586",
      "arxiv_url": "https://arxiv.org/abs/2602.12586",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12586",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:57:43.762632+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.12299",
      "title": "Acoustivision Pro: An Open-Source Interactive Platform for Room Impulse Response Analysis and Acoustic Characterization",
      "authors": [
        "Mandip Goswami"
      ],
      "abstract": "Room acoustics analysis plays a central role in architectural design, audio engineering, speech intelligibility assessment, and hearing research. Despite the availability of standardized metrics such as reverberation time, clarity, and speech transmission index, accessible tools that combine rigorous signal processing with intuitive visualization remain scarce. This paper presents AcoustiVision Pro, an open-source web-based platform for comprehensive room impulse response (RIR) analysis. The system computes twelve distinct acoustic parameters from uploaded or dataset-sourced RIRs, provides interactive 3D visualizations of early reflections, generates frequency-dependent decay characteristics through waterfall plots, and checks compliance against international standards including ANSI S12.60 and ISO 3382. We introduce the accompanying RIRMega and RIRMega Speech datasets hosted on Hugging Face, containing thousands of simulated room impulse responses with full metadata. The platform supports real-time auralization through FFT-based convolution, exports detailed PDF reports suitable for engineering documentation, and provides CSV data export for further analysis. We describe the mathematical foundations underlying each acoustic metric, detail the system architecture, and present preliminary case studies demonstrating the platform's utility across diverse application domains including classroom acoustics, healthcare facility design, and recording studio evaluation.",
      "summary_en": "This paper presents AcoustiVision Pro, an open-source web-based platform for room impulse response (RIR) analysis that computes twelve acoustic parameters, provides interactive 3D visualizations of early reflections, generates frequency-dependent waterfall plots, and checks compliance against ANSI S12.60 and ISO 3382 standards. The system supports real-time auralization through FFT-based convolution, exports PDF reports and CSV data, and is accompanied by the RIRMega and RIRMega Speech datasets hosted on Hugging Face containing thousands of simulated RIRs with full metadata. We describe the mathematical foundations underlying each metric, detail the system architecture, and present case studies demonstrating the platform's utility in classroom acoustics, healthcare facility design, and recording studio evaluation.",
      "summary_zh": "本文介绍了 AcoustiVision Pro，这是一个开源的基于 Web 的房间脉冲响应 (RIR) 分析平台，可计算十二项声学参数，提供早期反射的交互式 3D 可视化，生成频域 waterfall plots，并检查是否符合 ANSI S12.60 和 ISO 3382 标准。该系统支持通过基于 FFT 的卷积实现实时 auralization，可导出 PDF 报告和 CSV 数据，并附带托管于 Hugging Face 的 RIRMega 和 RIRMega Speech 数据集，包含数千条带有完整元数据的模拟 RIR。我们描述了各项指标背后的数学基础，详细介绍了系统架构，并展示了案例研究，证明了该平台在教室声学、医疗设施设计和录音棚评估中的实用性。",
      "hf_url": "https://huggingface.co/papers/2602.12299",
      "arxiv_url": "https://arxiv.org/abs/2602.12299",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12299",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:57:42.450227+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.11968",
      "title": "DHPLT: large-scale multilingual diachronic corpora and word representations for semantic change modelling",
      "authors": [
        "Mariia Fedorova",
        "Andrey Kutuzov",
        "Khonzoda Umarova"
      ],
      "abstract": "In this resource paper, we present DHPLT, an open collection of diachronic corpora in 41 diverse languages. DHPLT is based on the web-crawled HPLT datasets; we use web crawl timestamps as the approximate signal of document creation time. The collection covers three time periods: 2011-2015, 2020-2021 and 2024-present (1 million documents per time period for each language). We additionally provide pre-computed word type and token embeddings and lexical substitutions for our chosen target words, while at the same time leaving it open for the other researchers to come up with their own target words using the same datasets. DHPLT aims at filling in the current lack of multilingual diachronic corpora for semantic change modelling (beyond a dozen of high-resource languages). It opens the way for a variety of new experimental setups in this field. All the resources described in this paper are available at https://data.hplt-project.org/three/diachronic/, sorted by language.",
      "summary_en": "DHPLT is an open collection of diachronic corpora covering 41 diverse languages across three time periods (2011-2015, 2020-2021, and 2024-present), derived from HPLT web-crawled data using timestamps as temporal signals with one million documents per period per language. The resource provides pre-computed word type and token embeddings and lexical substitutions for target words while allowing researchers to define custom targets, aiming to fill the gap in multilingual diachronic corpora for semantic change modelling beyond high-resource languages. All datasets are available at https://data.hplt-project.org/three/diachronic/.",
      "summary_zh": "DHPLT是一个涵盖41种不同语言、跨越三个时期（2011-2015、2020-2021和2024至今）的开放历时语料库集合，基于时间戳作为时间信号从HPLT网络爬取数据中提取，每种语言每个时期包含一百万篇文档。该资源提供预计算的word type和token embeddings以及目标词的词汇替换，同时允许研究者定义自定义目标，旨在填补针对高资源语言之外的语言、用于语义变化建模的多语言历时语料库的空白。所有数据集均可在 https://data.hplt-project.org/three/diachronic/ 获取。",
      "hf_url": "https://huggingface.co/papers/2602.11968",
      "arxiv_url": "https://arxiv.org/abs/2602.11968",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.11968",
      "github_url": "https://github.com/ltgoslo/scdisc_hplt",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:57:41.607451+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.09319",
      "title": "Benchmarking Knowledge-Extraction Attack and Defense on Retrieval-Augmented Generation",
      "authors": [
        "Zhisheng Qi",
        "Utkarsh Sahu",
        "Li Ma",
        "Haoyu Han",
        "Ryan Rossi",
        "Franck Dernoncourt",
        "Mahantesh Halappanavar",
        "Nesreen Ahmed",
        "Yushun Dong",
        "Yue Zhao",
        "Yu Zhang",
        "Yu Wang"
      ],
      "abstract": "A systematic benchmark for evaluating knowledge-extraction attacks on Retrieval-Augmented Generation systems is introduced, covering diverse attack and defense strategies across multiple retrieval and generation models with standardized evaluation protocols. Retrieval-Augmented Generation (RAG) has become a cornerstone of knowledge-intensive applications, including enterprise chatbots, healthcare assistants, and agentic memory management. However, recent studies show that knowledge-extraction attacks can recover sensitive knowledge-base content through maliciously crafted queries, raising serious concerns about intellectual property theft and privacy leakage. While prior work has explored individual attack and defense techniques, the research landscape remains fragmented, spanning heterogeneous retrieval embeddings, diverse generation models , and evaluations based on non-standardized metrics and inconsistent datasets. To address this gap, we introduce the first systematic benchmark for knowledge-extraction attacks on RAG systems. Our benchmark covers a broad spectrum of attack and defense strategies , representative retrieval embedding models , and both open- and closed-source generators, all evaluated under a unified experimental framework with standardized protocols across multiple datasets. By consolidating the experimental landscape and enabling reproducible, comparable evaluation, this benchmark provides actionable insights and a practical foundation for developing privacy-preserving RAG systems in the face of emerging knowledge extraction threats. Our code is available here.",
      "summary_en": "A systematic benchmark for evaluating knowledge-extraction attacks on Retrieval-Augmented Generation systems is introduced, covering diverse attack and defense strategies across multiple retrieval and generation models with standardized evaluation protocols.",
      "summary_zh": "介绍了一种用于评估针对检索增强生成（Retrieval-Augmented Generation）系统的知识提取攻击（knowledge-extraction attacks）的系统性基准测试，涵盖多种攻击与防御策略，跨越多种检索与生成模型，并采用标准化评估协议。",
      "hf_url": "https://huggingface.co/papers/2602.09319",
      "arxiv_url": "https://arxiv.org/abs/2602.09319",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.09319",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:57:39.635562+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.07673",
      "title": "Blind to the Human Touch: Overlap Bias in LLM-Based Summary Evaluation",
      "authors": [
        "Jiangnan Fang",
        "Cheng-Tse Liu",
        "Hanieh Deilamsalehy",
        "Nesreen K. Ahmed",
        "Puneet Mathur",
        "Nedim Lipka",
        "Franck Dernoncourt",
        "Ryan A. Rossi"
      ],
      "abstract": "LLM judges exhibit bias toward summaries similar to their own generation, with performance deteriorating as summary overlap with human references decreases across multiple model sizes and architectures.",
      "summary_en": "LLM judges exhibit bias toward summaries similar to their own generation, with performance deteriorating as summary overlap with human references decreases across multiple model sizes and architectures.",
      "summary_zh": "LLM评判器偏向与其自身生成相似的摘要，且随着摘要与人类参考的重叠度降低，其性能会下降，这一现象在多种模型规模和架构中均存在。",
      "hf_url": "https://huggingface.co/papers/2602.07673",
      "arxiv_url": "https://arxiv.org/abs/2602.07673",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.07673",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-17T15:57:35.290034+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14696",
      "title": "A Critical Look at Targeted Instruction Selection: Disentangling What Matters (and What Doesn't)",
      "authors": [
        "Nihal V. Nayak",
        "Paula Rodriguez-Diaz",
        "Neha Hulkund",
        "Sara Beery",
        "David Alvarez-Melis"
      ],
      "abstract": "Targeted instruction selection for LLM fine-tuning can be improved by systematically analyzing data representation and selection algorithms, with gradient-based representations and greedy round-robin selection performing best at low budgets. Instruction fine-tuning of large language models (LLMs) often involves selecting a subset of instruction training data from a large candidate pool, using a small query set from the target task. Despite growing interest, the literature on targeted instruction selection remains fragmented and opaque: methods vary widely in selection budgets, often omit zero-shot baselines, and frequently entangle the contributions of key components. As a result, practitioners lack actionable guidance on selecting instructions for their target tasks. In this work, we aim to bring clarity to this landscape by disentangling and systematically analyzing the two core ingredients: data representation and selection algorithms . Our framework enables controlled comparisons across models, tasks, and budgets. We find that only gradient-based data representation s choose subsets whose similarity to the query consistently predicts performance across datasets and models. While no single method dominates, gradient-based representations paired with a greedy round-robin selection algorithm tend to perform best on average at low budgets, but these benefits diminish at larger budgets. Finally, we unify several existing selection algorithms as forms of approximate distance minimization between the selected subset and the query set, and support this view with new generalization bounds . More broadly, our findings provide critical insights and a foundation for more principled data selection in LLM fine-tuning. The code is available at https://github.com/dcml-lab/targeted-instruction-selection.",
      "summary_en": "Targeted instruction selection for LLM fine-tuning can be improved by systematically analyzing data representation and selection algorithms, with gradient-based representations and greedy round-robin selection performing best at low budgets.",
      "summary_zh": "针对LLM微调的指令选择可通过系统分析数据表示与选择算法加以改进，其中基于梯度的表示与贪心轮询选择在低预算下表现最佳。",
      "hf_url": "https://huggingface.co/papers/2602.14696",
      "arxiv_url": "https://arxiv.org/abs/2602.14696",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14696",
      "github_url": "https://github.com/dcml-lab/targeted-instruction-selection",
      "upvotes": 0,
      "fetched_at": "2026-02-17T15:58:01.965017+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.14560",
      "title": "Preliminary sonification of ENSO using traditional Javanese gamelan scales",
      "authors": [
        "Sandy H. S. Herho",
        "Rusmawan Suwarman",
        "Nurjanna J. Trilaksono",
        "Iwan P. Anwar",
        "Faiz R. Fajary"
      ],
      "abstract": "Parameter-mapping sonification of ENSO data preserves dynamical signatures through acoustic phase space analysis, revealing distinct coupling regimes in traditional musical scales. Sonification -- the mapping of data to non-speech audio -- offers an underexplored channel for representing complex dynamical systems . We treat El Niño-Southern Oscillation ( ENSO ), a canonical example of low-dimensional climate chaos, as a test case for culturally-situated sonification evaluated through complex systems diagnostics. Using parameter-mapping sonification of the Niño 3.4 sea surface temperature anomaly index (1870--2024), we encode ENSO variability into two traditional Javanese gamelan pentatonic systems ( pelog and slendro ) across four composition strategies, then analyze the resulting audio as trajectories in a two-dimensional acoustic phase space . Recurrence-based diagnostics , convex hull geometry , and coupling analysis reveal that the sonification pipeline preserves key dynamical signatures: alternating modes produce the highest trajectory recurrence rates, echoing ENSO 's quasi-periodicity; layered polyphonic modes explore the broadest phase space regions; and the two scale families induce qualitatively distinct coupling regimes between spectral brightness and energy -- predominantly anti-phase in pelog but near-independent in slendro . Phase space trajectory analysis provides a rigorous geometric framework for comparing sonification designs within a complex systems context. Perceptual validation remains necessary; we contribute the dynamical systems methodology for evaluating such mappings.",
      "summary_en": "Parameter-mapping sonification of ENSO data preserves dynamical signatures through acoustic phase space analysis, revealing distinct coupling regimes in traditional musical scales.",
      "summary_zh": "ENSO数据的参数映射声化通过声学相空间分析保留了动力学特征，在传统音阶中揭示了不同的耦合机制。",
      "hf_url": "https://huggingface.co/papers/2602.14560",
      "arxiv_url": "https://arxiv.org/abs/2602.14560",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.14560",
      "github_url": "https://github.com/sandyherho/suppl-enso-javanese-sonification",
      "upvotes": 0,
      "fetched_at": "2026-02-17T15:58:00.286351+00:00"
    },
    {
      "date": "2026-02-17",
      "paper_id": "2602.13516",
      "title": "SPILLage: Agentic Oversharing on the Web",
      "authors": [
        "Jaechul Roh",
        "Eugene Bagdasarian",
        "Hamed Haddadi",
        "Ali Shahin Shamsabadi"
      ],
      "abstract": "Web agents inadvertently disclose user information through both content and behavioral traces, with behavioral oversharing being more prevalent than content oversharing, and this issue persists despite mitigation efforts. LLM-powered agents are beginning to automate user's tasks across the open web, often with access to user resources such as emails and calendars. Unlike standard LLMs answering questions in a controlled ChatBot setting, web agents act \"in the wild\", interacting with third parties and leaving behind an action trace. Therefore, we ask the question: how do web agents handle user resources when accomplishing tasks on their behalf across live websites? In this paper, we formalize Natural Agentic Oversharing -- the unintentional disclosure of task-irrelevant user information through an agent trace of actions on the web. We introduce SPILLage , a framework that characterizes oversharing along two dimensions: channel (content vs. behavior) and directness (explicit vs. implicit). This taxonomy reveals a critical blind spot: while prior work focuses on text leakage, web agents also overshare behaviorally through clicks, scrolls, and navigation patterns that can be monitored. We benchmark 180 tasks on live e-commerce sites with ground-truth annotations separating task-relevant from task-irrelevant attributes. Across 1,080 runs spanning two agentic frameworks and three backbone LLMs, we demonstrate that oversharing is pervasive with behavioral oversharing dominates content oversharing by 5x. This effect persists -- and can even worsen -- under prompt-level mitigation . However, removing task-irrelevant information before execution improves task success by up to 17.9%, demonstrating that reducing oversharing improves task success . Our findings underscore that protecting privacy in web agents is a fundamental challenge, requiring a broader view of \"output\" that accounts for what agents do on the web, not just what they type. Our datasets and code are available at https://github.com/jrohsc/ SPILLage .",
      "summary_en": "Web agents inadvertently disclose user information through both content and behavioral traces, with behavioral oversharing being more prevalent than content oversharing, and this issue persists despite mitigation efforts.",
      "summary_zh": "网页智能体通过内容痕迹和行为痕迹无意中泄露用户信息，其中行为过度分享比内容过度分享更为普遍，且尽管采取了缓解措施，该问题依然存在。",
      "hf_url": "https://huggingface.co/papers/2602.13516",
      "arxiv_url": "https://arxiv.org/abs/2602.13516",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13516",
      "github_url": "https://github.com/jrohsc/SPILLage",
      "upvotes": 0,
      "fetched_at": "2026-02-17T15:57:48.870947+00:00"
    }
  ]
}