{
  "date": "2026-02-27",
  "count": 28,
  "papers": [
    {
      "date": "2026-02-27",
      "paper_id": "2602.23152",
      "title": "The Trinity of Consistency as a Defining Principle for General World Models",
      "authors": [
        "Jingxuan Wei",
        "Siyuan Li",
        "Yuhang Xu",
        "Zheng Sun",
        "Junjie Jiang",
        "Hexuan Jin",
        "Caijun Jia",
        "Honghao He",
        "Xinglong Xu",
        "Xi bai",
        "Chang Yu",
        "Yumou Liu",
        "Junnan Zhu",
        "Xuanhe Zhou",
        "Jintao Chen",
        "Xiaobin Hu",
        "Shancheng Pang",
        "Bihui Yu",
        "Ran He",
        "Zhen Lei",
        "Stan Z. Li",
        "Conghui He"
      ],
      "abstract": "World Models require three consistency principles—modal, spatial, and temporal—for general artificial intelligence, with a proposed benchmark evaluating multimodal learning systems.",
      "summary_en": "World Models require three consistency principles—modal, spatial, and temporal—for general artificial intelligence, with a proposed benchmark evaluating multimodal learning systems.",
      "summary_zh": "世界模型需要模态、空间和时间三种一致性原则以实现通用人工智能，并提出了一个评估多模态学习系统的基准。",
      "hf_url": "https://huggingface.co/papers/2602.23152",
      "arxiv_url": "https://arxiv.org/abs/2602.23152",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23152",
      "github_url": "https://github.com/openraiser/awesome-world-model-evolution",
      "upvotes": 168,
      "fetched_at": "2026-02-28T01:46:54.056697+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22859",
      "title": "From Blind Spots to Gains: Diagnostic-Driven Iterative Training for Large Multimodal Models",
      "authors": [
        "Hongrui Jia",
        "Chaoya Jiang",
        "Shikun Zhang",
        "Wei Ye"
      ],
      "abstract": "Diagnostic-driven Progressive Evolution enables continuous improvement of large multimodal models through iterative diagnosis and targeted data generation guided by identified weaknesses. As Large Multimodal Models (LMMs) scale up and reinforcement learning (RL) methods mature, LMMs have made notable progress in complex reasoning and decision making. Yet training still relies on static data and fixed recipes, making it difficult to diagnose capability blind spots or provide dynamic, targeted reinforcement . Motivated by findings that test driven error exposure and feedback based correction outperform repetitive practice, we propose Diagnostic-driven Progressive Evolution (DPE), a spiral loop where diagnosis steers data generation and reinforcement, and each iteration re-diagnoses the updated model to drive the next round of targeted improvement. DPE has two key components. First, multiple agents annotate and quality control massive unlabeled multimodal data , using tools such as web search and image editing to produce diverse, realistic samples. Second, DPE attributes failures to specific weaknesses, dynamically adjusts the data mixture, and guides agents to generate weakness focused data for targeted reinforcement . Experiments on Qwen3-VL-8B-Instruct and Qwen2.5-VL-7B-Instruct show stable, continual gains across eleven benchmarks, indicating DPE as a scalable paradigm for continual LMM training under open task distributions. Our code, models, and data are publicly available at https://github.com/hongruijia/DPE.",
      "summary_en": "Diagnostic-driven Progressive Evolution enables continuous improvement of large multimodal models through iterative diagnosis and targeted data generation guided by identified weaknesses.",
      "summary_zh": "Diagnostic-driven Progressive Evolution 通过迭代诊断与基于已识别弱点的针对性数据生成，实现大型多模态模型的持续改进。",
      "hf_url": "https://huggingface.co/papers/2602.22859",
      "arxiv_url": "https://arxiv.org/abs/2602.22859",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22859",
      "github_url": "https://github.com/hongruijia/DPE",
      "upvotes": 142,
      "fetched_at": "2026-02-28T01:46:49.427855+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22638",
      "title": "MobilityBench: A Benchmark for Evaluating Route-Planning Agents in Real-World Mobility Scenarios",
      "authors": [
        "Zhiheng Song",
        "Jingshuai Zhang",
        "Chuan Qin",
        "Chao Wang",
        "Chao Chen",
        "Longfei Xu",
        "Kaikui Liu",
        "Xiangxiang Chu",
        "Hengshu Zhu"
      ],
      "abstract": "MobileBench is a scalable benchmark for evaluating LLM-based route-planning agents in real-world scenarios, featuring anonymized user queries and a deterministic sandbox for reproducible testing. Route-planning agents powered by large language models (LLMs) have emerged as a promising paradigm for supporting everyday human mobility through natural language interaction and tool-mediated decision making. However, systematic evaluation in real-world mobility settings is hindered by diverse routing demands, non-deterministic mapping services, and limited reproducibility. In this study, we introduce MobilityBench , a scalable benchmark for evaluating LLM-based route-planning agents in real-world mobility scenarios . MobilityBench is constructed from large-scale, anonymized real user queries collected from Amap and covers a broad spectrum of route- planning intents across multiple cities worldwide. To enable reproducible, end-to-end evaluation, we design a deterministic API-replay sandbox that eliminates environmental variance from live services. We further propose a multi-dimensional evaluation protocol centered on outcome validity , complemented by assessments of instruction understanding , planning , tool use , and efficiency . Using MobilityBench , we evaluate multiple LLM-based route-planning agents across diverse real-world mobility scenarios and provide an in-depth analysis of their behaviors and performance. Our findings reveal that current models perform competently on Basic information retrieval and Route Planning tasks, yet struggle considerably with Preference-Constrained Route Planning , underscoring significant room for improvement in personalized mobility applications. We publicly release the benchmark data, evaluation toolkit, and documentation at https://github.com/AMAP-ML/ MobilityBench .",
      "summary_en": "MobileBench is a scalable benchmark for evaluating LLM-based route-planning agents in real-world scenarios, featuring anonymized user queries and a deterministic sandbox for reproducible testing.",
      "summary_zh": "MobileBench 是一个可扩展的基准测试，用于在真实场景中评估基于LLM的路径规划智能体，具有匿名化用户查询和用于可复现测试的确定性沙盒。",
      "hf_url": "https://huggingface.co/papers/2602.22638",
      "arxiv_url": "https://arxiv.org/abs/2602.22638",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22638",
      "github_url": "https://github.com/AMAP-ML/MobilityBench",
      "upvotes": 87,
      "fetched_at": "2026-02-28T01:46:46.787471+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22897",
      "title": "OmniGAIA: Towards Native Omni-Modal AI Agents",
      "authors": [
        "Xiaoxi Li",
        "Wenxiang Jiao",
        "Jiarui Jin",
        "Shijian Wang",
        "Guanting Dong",
        "Jiajie Jin",
        "Hao Wang",
        "Yinuo Wang",
        "Ji-Rong Wen",
        "Yuan Lu",
        "Zhicheng Dou"
      ],
      "abstract": "OmniGAIA benchmark evaluates multi-modal agents on complex reasoning tasks across video, audio, and image modalities, while OmniAtlas agent improves tool-use capabilities through hindsight-guided tree exploration and OmniDPO fine-tuning. Human intelligence naturally intertwines omni-modal perception -- spanning vision, audio, and language -- with complex reasoning and tool usage to interact with the world. However, current multi-modal LLMs are primarily confined to bi-modal interactions (e.g., vision-language), lacking the unified cognitive capabilities required for general AI assistants. To bridge this gap, we introduce OmniGAIA, a comprehensive benchmark designed to evaluate omni-modal agents on tasks necessitating deep reasoning and multi-turn tool execution across video, audio, and image modalities. Constructed via a novel omni-modal event graph approach, OmniGAIA synthesizes complex, multi-hop queries derived from real-world data that require cross-modal reasoning and external tool integration. Furthermore, we propose OmniAtlas, a native omni-modal foundation agent under tool-integrated reasoning paradigm with active omni-modal perception . Trained on trajectories synthesized via a hindsight-guided tree exploration strategy and OmniDPO for fine-grained error correction, OmniAtlas effectively enhances the tool-use capabilities of existing open-source models. This work marks a step towards next-generation native omni-modal AI assistants for real-world scenarios.",
      "summary_en": "OmniGAIA benchmark evaluates multi-modal agents on complex reasoning tasks across video, audio, and image modalities, while OmniAtlas agent improves tool-use capabilities through hindsight-guided tree exploration and OmniDPO fine-tuning.",
      "summary_zh": "OmniGAIA 基准评估多模态智能体在视频、音频和图像模态上的复杂推理任务，OmniAtlas 智能体则通过事后引导的树探索和 OmniDPO 微调提升工具使用能力。",
      "hf_url": "https://huggingface.co/papers/2602.22897",
      "arxiv_url": "https://arxiv.org/abs/2602.22897",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22897",
      "github_url": "https://github.com/RUC-NLPIR/OmniGAIA",
      "upvotes": 46,
      "fetched_at": "2026-02-28T01:46:50.858408+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22766",
      "title": "Imagination Helps Visual Reasoning, But Not Yet in Latent Space",
      "authors": [
        "You Li",
        "Chi Chen",
        "Yanghao Li",
        "Fanhu Zeng",
        "Kaiyu Huang",
        "Jinan Xu",
        "Maosong Sun"
      ],
      "abstract": "Research reveals that latent visual reasoning in multimodal models suffers from input-latent and latent-answer disconnects, leading to the proposal of CapImagine, a text-based approach that outperforms complex latent-space methods. Latent visual reasoning aims to mimic human's imagination process by meditating through hidden states of Multimodal Large Language Models . While recognized as a promising paradigm for visual reasoning , the underlying mechanisms driving its effectiveness remain unclear. Motivated to demystify the true source of its efficacy, we investigate the validity of latent reasoning using Causal Mediation Analysis . We model the process as a causal chain: the input as the treatment, the latent tokens as the mediator, and the final answer as the outcome. Our findings uncover two critical disconnections: (a) Input-Latent Disconnect : dramatic perturbations on the input result in negligible changes to the latent tokens , suggesting that latent tokens do not effectively attend to the input sequence. (b) Latent-Answer Disconnect : perturbations on the latent tokens yield minimal impact on the final answer, indicating the limited causal effect latent tokens imposing on the outcome. Furthermore, extensive probing analysis reveals that latent tokens encode limited visual information and exhibit high similarity. Consequently, we challenge the necessity of latent reasoning and propose a straightforward alternative named CapImagine , which teaches the model to explicitly imagine using text. Experiments on vision-centric benchmarks show that CapImagine significantly outperforms complex latent-space baselines, highlighting the superior potential of visual reasoning through explicit imagination.",
      "summary_en": "Research reveals that latent visual reasoning in multimodal models suffers from input-latent and latent-answer disconnects, leading to the proposal of CapImagine, a text-based approach that outperforms complex latent-space methods.",
      "summary_zh": "研究表明多模态模型中的潜在视觉推理存在输入-潜在空间与潜在空间-答案的脱节问题，进而提出了CapImagine这一基于文本的方法，其性能优于复杂的潜在空间方法。",
      "hf_url": "https://huggingface.co/papers/2602.22766",
      "arxiv_url": "https://arxiv.org/abs/2602.22766",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22766",
      "github_url": "https://github.com/AI9Stars/CapImagine",
      "upvotes": 32,
      "fetched_at": "2026-02-28T01:46:48.584684+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23008",
      "title": "Exploratory Memory-Augmented LLM Agent via Hybrid On- and Off-Policy Optimization",
      "authors": [
        "Zeyuan Liu",
        "Jeonghye Kim",
        "Xufang Luo",
        "Dongsheng Li",
        "Yuqing Yang"
      ],
      "abstract": "EMPO² is a hybrid reinforcement learning framework that enhances exploration for large language model agents by integrating memory mechanisms with on- and off-policy updates, demonstrating improved performance and adaptability in complex environments. Exploration remains the key bottleneck for large language model agents trained with reinforcement learning . While prior methods exploit pretrained knowledge, they fail in environments requiring the discovery of novel states. We propose Exploratory Memory-Augmented On- and Off-Policy Optimization (EMPO^2), a hybrid RL framework that leverages memory for exploration and combines on- and off-policy updates to make LLMs perform well with memory while also ensuring robustness without it. On ScienceWorld and WebShop , EMPO^2 achieves 128.6% and 11.3% improvements over GRPO, respectively. Moreover, in out-of-distribution tests, EMPO^2 demonstrates superior adaptability to new tasks, requiring only a few trials with memory and no parameter updates. These results highlight EMPO^2 as a promising framework for building more exploratory and generalizable LLM-based agents.",
      "summary_en": "EMPO² is a hybrid reinforcement learning framework that enhances exploration for large language model agents by integrating memory mechanisms with on- and off-policy updates, demonstrating improved performance and adaptability in complex environments.",
      "summary_zh": "EMPO² 是一种混合强化学习框架，通过整合记忆机制与 on-policy 和 off-policy 更新来增强大语言模型智能体的探索能力，并在复杂环境中展现出改进的性能和适应性。",
      "hf_url": "https://huggingface.co/papers/2602.23008",
      "arxiv_url": "https://arxiv.org/abs/2602.23008",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23008",
      "github_url": "",
      "upvotes": 26,
      "fetched_at": "2026-02-28T01:46:52.289029+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23258",
      "title": "AgentDropoutV2: Optimizing Information Flow in Multi-Agent Systems via Test-Time Rectify-or-Reject Pruning",
      "authors": [
        "Yutong Wang",
        "Siyuan Xiong",
        "Xuebo Liu",
        "Wenkang Zhou",
        "Liang Ding",
        "Miao Zhang",
        "Min Zhang"
      ],
      "abstract": "AgentDropoutV2 is a test-time framework that dynamically optimizes multi-agent system information flow through error correction and pruning mechanisms without requiring retraining. While Multi-Agent Systems (MAS) excel in complex reasoning, they suffer from the cascading impact of erroneous information generated by individual participants. Current solutions often resort to rigid structural engineering or expensive fine-tuning, limiting their deployability and adaptability. We propose AgentDropoutV2, a test-time rectify-or-reject pruning framework designed to dynamically optimize MAS information flow without retraining. Our approach acts as an active firewall, intercepting agent outputs and employing a retrieval-augmented rectifier to iteratively correct errors based on a failure-driven indicator pool . This mechanism allows for the precise identification of potential errors using distilled failure patterns as prior knowledge. Irreparable outputs are subsequently pruned to prevent error propagation , while a fallback strategy preserves system integrity. Empirical results on extensive math benchmarks show that AgentDropoutV2 significantly boosts the MAS's task performance, achieving an average accuracy gain of 6.3 percentage points on math benchmarks. Furthermore, the system exhibits robust generalization and adaptivity, dynamically modulating rectification efforts based on task difficulty while leveraging context-aware indicators to resolve a wide spectrum of error patterns. Our code and dataset are released at https://github.com/TonySY2/AgentDropoutV2.",
      "summary_en": "AgentDropoutV2 is a test-time framework that dynamically optimizes multi-agent system information flow through error correction and pruning mechanisms without requiring retraining.",
      "summary_zh": "AgentDropoutV2 是一种测试时框架，通过纠错与剪枝机制动态优化多智能体系统的信息流，无需重新训练。",
      "hf_url": "https://huggingface.co/papers/2602.23258",
      "arxiv_url": "https://arxiv.org/abs/2602.23258",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23258",
      "github_url": "https://github.com/TonySY2/AgentDropoutV2",
      "upvotes": 23,
      "fetched_at": "2026-02-28T01:46:57.091792+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23363",
      "title": "MediX-R1: Open Ended Medical Reinforcement Learning",
      "authors": [
        "Sahal Shaji Mullappilly",
        "Mohammed Irfan Kurpath",
        "Omair Mohamed",
        "Mohamed Zidan",
        "Fahad Khan",
        "Salman Khan",
        "Rao Anwer",
        "Hisham Cholakkal"
      ],
      "abstract": "MediX-R1 presents an open-ended reinforcement learning framework for medical multimodal large language models that uses diverse reward signals and LLM-based evaluation to improve clinical reasoning beyond multiple-choice formats. We introduce MediX-R1, an open-ended Reinforcement Learning (RL) framework for medical multimodal large language models (MLLMs) that enables clinically grounded, free-form answers beyond multiple-choice formats. MediX-R1 fine-tunes a baseline vision-language backbone with Group Based RL and a composite reward tailored for medical reasoning : an LLM-based accuracy reward that judges semantic correctness with a strict YES/NO decision, a medical embedding-based semantic reward to capture paraphrases and terminology variants, and lightweight format and modality rewards that enforce interpretable reasoning and modality recognition. This multi-signal design provides stable, informative feedback for open-ended outputs where traditional verifiable or MCQ-only rewards fall short. To measure progress, we propose a unified evaluation framework for both text-only and image+text tasks that uses a Reference-based LLM-as-judge in place of brittle string-overlap metrics, capturing semantic correctness, reasoning, and contextual alignment. Despite using only sim51K instruction examples, MediX-R1 achieves excellent results across standard medical LLM (text-only) and VLM (image + text) benchmarks, outperforming strong open-source baselines and delivering particularly large gains on open-ended clinical tasks. Our results demonstrate that open-ended RL with comprehensive reward signals and LLM-based evaluation is a practical path toward reliable medical reasoning in multimodal models. Our trained models, curated datasets and source code are available at https://medix.cvmbzuai.com",
      "summary_en": "MediX-R1 presents an open-ended reinforcement learning framework for medical multimodal large language models that uses diverse reward signals and LLM-based evaluation to improve clinical reasoning beyond multiple-choice formats.",
      "summary_zh": "MediX-R1提出了一种面向医疗多模态大语言模型的开放式强化学习框架，该框架利用多样化的奖励信号和基于LLM的评估，以提升超越多选格式的临床推理能力。",
      "hf_url": "https://huggingface.co/papers/2602.23363",
      "arxiv_url": "https://arxiv.org/abs/2602.23363",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23363",
      "github_url": "https://github.com/mbzuai-oryx/MediX-R1",
      "upvotes": 14,
      "fetched_at": "2026-02-28T01:47:00.984735+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22675",
      "title": "Search More, Think Less: Rethinking Long-Horizon Agentic Search for Efficiency and Generalization",
      "authors": [
        "Qianben Chen",
        "Tianrui Qin",
        "King Zhu",
        "Qiexiang Wang",
        "Chengjun Yu",
        "Shu Xu",
        "Jiaqi Wu",
        "Jiayu Zhang",
        "Xinpeng Liu",
        "Xin Gui",
        "Jingyi Cao",
        "Piaohong Wang",
        "Dingfeng Shi",
        "He Zhu",
        "Tiannan Wang",
        "Yuqing Wang",
        "Maojia Song",
        "Tianyu Zheng",
        "Ge Zhang",
        "Jian Yang",
        "Jiaheng Liu",
        "Minghao Liu"
      ],
      "abstract": "A deep learning framework called SMTL improves efficient long-horizon agentic search by replacing sequential reasoning with parallel evidence acquisition, achieving state-of-the-art performance across multiple research benchmarks while reducing reasoning steps by 70.7%. Recent deep research agents primarily improve performance by scaling reasoning depth , but this leads to high inference cost and latency in search-intensive scenarios . Moreover, generalization across heterogeneous research settings remains challenging. In this work, we propose Search More, Think Less (SMTL), a framework for long-horizon agentic search that targets both efficiency and generalization . SMTL replaces sequential reasoning with parallel evidence acquisition , enabling efficient context management under constrained context budgets. To support generalization across task types, we further introduce a unified data synthesis pipeline that constructs search tasks spanning both deterministic question answering and open-ended research scenarios with task appropriate evaluation metrics. We train an end-to-end agent using supervised fine-tuning and reinforcement learning , achieving strong and often state of the art performance across benchmarks including BrowseComp (48.6\\%), GAIA (75.7\\%), Xbench (82.0\\%), and DeepResearch Bench (45.9\\%). Compared to Mirothinker-v1.0, SMTL with maximum 100 interaction steps reduces the average number of reasoning steps on BrowseComp by 70.7\\%, while improving accuracy.",
      "summary_en": "A deep learning framework called SMTL improves efficient long-horizon agentic search by replacing sequential reasoning with parallel evidence acquisition, achieving state-of-the-art performance across multiple research benchmarks while reducing reasoning steps by 70.7%.",
      "summary_zh": "名为SMTL的深度学习框架通过以并行证据获取替代顺序推理，改进了高效长程智能体搜索，在多个研究基准上达到了最先进的性能，同时将推理步骤减少了70.7%。",
      "hf_url": "https://huggingface.co/papers/2602.22675",
      "arxiv_url": "https://arxiv.org/abs/2602.22675",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22675",
      "github_url": "https://github.com/OPPO-PersonalAI/SMTL",
      "upvotes": 14,
      "fetched_at": "2026-02-28T01:46:47.900310+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23361",
      "title": "VGG-T^3: Offline Feed-Forward 3D Reconstruction at Scale",
      "authors": [
        "Sven Elflein",
        "Ruilong Li",
        "Sérgio Agostinho",
        "Zan Gojcic",
        "Laura Leal-Taixé",
        "Qunjie Zhou",
        "Aljosa Osep"
      ],
      "abstract": "VGG-T³ addresses scalability issues in 3D reconstruction by transforming variable-length key-value representations into fixed-size MLPs through test-time training, enabling linear scaling with input views and achieving significant speedup over traditional softmax attention methods. We present a scalable 3D reconstruction model that addresses a critical limitation in offline feed-forward methods : their computational and memory requirements grow quadratically w.r.t. the number of input images. Our approach is built on the key insight that this bottleneck stems from the varying-length Key-Value (KV) space representation of scene geometry , which we distill into a fixed-size Multi-Layer Perceptron (MLP) via test-time training . VGG-T^3 ( Visual Geometry Grounded Test Time Training ) scales linearly w.r.t. the number of input views, similar to online models, and reconstructs a 1k image collection in just 54 seconds, achieving a 11.6times speed-up over baselines that rely on softmax attention . Since our method retains global scene aggregation capability, our point map reconstruction error outperforming other linear-time methods by large margins. Finally, we demonstrate visual localization capabilities of our model by querying the scene representation with unseen images.",
      "summary_en": "VGG-T³ addresses scalability issues in 3D reconstruction by transforming variable-length key-value representations into fixed-size MLPs through test-time training, enabling linear scaling with input views and achieving significant speedup over traditional softmax attention methods.",
      "summary_zh": "VGG-T³通过测试时训练将可变长度键值表示转换为固定尺寸MLP，解决了三维重建中的可扩展性问题，实现了随输入视图数量的线性扩展，并相比传统softmax注意力方法获得显著加速。",
      "hf_url": "https://huggingface.co/papers/2602.23361",
      "arxiv_url": "https://arxiv.org/abs/2602.23361",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23361",
      "github_url": "",
      "upvotes": 11,
      "fetched_at": "2026-02-28T01:46:59.746455+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.21760",
      "title": "Accelerating Diffusion via Hybrid Data-Pipeline Parallelism Based on Conditional Guidance Scheduling",
      "authors": [
        "Euisoo Jung",
        "Byunghyun Kim",
        "Hyunjin Kim",
        "Seonghye Cho",
        "Jae-Gil Lee"
      ],
      "abstract": "A hybrid parallelism framework for diffusion models that combines condition-based partitioning and adaptive pipeline scheduling to reduce inference latency while maintaining image quality across different architectures. Diffusion models have achieved remarkable progress in high-fidelity image, video, and audio generation, yet inference remains computationally expensive. Nevertheless, current diffusion acceleration methods based on distributed parallelism suffer from noticeable generation artifacts and fail to achieve substantial acceleration proportional to the number of GPUs. Therefore, we propose a hybrid parallelism framework that combines a novel data parallel strategy , condition-based partitioning , with an optimal pipeline scheduling method, adaptive parallelism switching , to reduce generation latency and achieve high generation quality in conditional diffusion models . The key ideas are to (i) leverage the conditional and unconditional denoising paths as a new data-partitioning perspective and (ii) adaptively enable optimal pipeline parallelism according to the denoising discrepancy between these two paths. Our framework achieves 2.31times and 2.07times latency reductions on SDXL and SD3, respectively, using two NVIDIA RTX~3090 GPUs, while preserving image quality . This result confirms the generality of our approach across U-Net-based diffusion models and DiT-based flow-matching architectures . Our approach also outperforms existing methods in acceleration under high-resolution synthesis settings. Code is available at https://github.com/kaist-dmlab/Hybridiff.",
      "summary_en": "A hybrid parallelism framework for diffusion models that combines condition-based partitioning and adaptive pipeline scheduling to reduce inference latency while maintaining image quality across different architectures.",
      "summary_zh": "一种面向扩散模型的混合并行框架，结合基于条件的划分与自适应流水线调度，在降低推理延迟的同时保持跨不同架构的图像质量。",
      "hf_url": "https://huggingface.co/papers/2602.21760",
      "arxiv_url": "https://arxiv.org/abs/2602.21760",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21760",
      "github_url": "https://github.com/kaist-dmlab/Hybridiff",
      "upvotes": 10,
      "fetched_at": "2026-02-28T01:46:41.480039+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23205",
      "title": "EmbodMocap: In-the-Wild 4D Human-Scene Reconstruction for Embodied Agents",
      "authors": [
        "Wenjia Wang",
        "Liang Pan",
        "Huaijin Pi",
        "Yuke Lou",
        "Xuqian Ren",
        "Yifan Wu",
        "Zhouyingcheng Liao",
        "Lei Yang",
        "Rishabh Dabral",
        "Christian Theobalt",
        "Taku Komura"
      ],
      "abstract": "A portable dual-iPhone system enables metric-scale human-scene reconstruction and supports embodied AI tasks including physics-based animation and robot motion control. Human behaviors in the real world naturally encode rich, long-term contextual information that can be leveraged to train embodied agents for perception, understanding, and acting. However, existing capture systems typically rely on costly studio setups and wearable devices, limiting the large-scale collection of scene-conditioned human motion data in the wild. To address this, we propose EmbodMocap, a portable and affordable data collection pipeline using two moving iPhones. Our key idea is to jointly calibrate dual RGB-D sequences to reconstruct both humans and scenes within a unified metric world coordinate frame . The proposed method allows metric-scale and scene-consistent capture in everyday environments without static cameras or markers, bridging human motion and scene geometry seamlessly. Compared with optical capture ground truth, we demonstrate that the dual-view setting exhibits a remarkable ability to mitigate depth ambiguity, achieving superior alignment and reconstruction performance over single iphone or monocular models. Based on the collected data, we empower three embodied AI tasks: monocular human-scene-reconstruction , where we fine-tune on feedforward models that output metric-scale, world-space aligned humans and scenes; physics-based character animation , where we prove our data could be used to scale human-object interaction skills and scene-aware motion tracking; and robot motion control, where we train a humanoid robot via sim-to-real RL to replicate human motions depicted in videos. Experimental results validate the effectiveness of our pipeline and its contributions towards advancing embodied AI research.",
      "summary_en": "A portable dual-iPhone system enables metric-scale human-scene reconstruction and supports embodied AI tasks including physics-based animation and robot motion control.",
      "summary_zh": "便携式双iPhone系统可实现度量尺度的人-场景重建，并支持具身智能任务，包括基于物理的动画与机器人运动控制。",
      "hf_url": "https://huggingface.co/papers/2602.23205",
      "arxiv_url": "https://arxiv.org/abs/2602.23205",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23205",
      "github_url": "https://github.com/WenjiaWang0312/EmbodMocap",
      "upvotes": 9,
      "fetched_at": "2026-02-28T01:46:55.976377+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.17594",
      "title": "AI Gamestore: Scalable, Open-Ended Evaluation of Machine General Intelligence with Human Games",
      "authors": [
        "Lance Ying",
        "Ryan Truong",
        "Prafull Sharma",
        "Kaiya Ivy Zhao",
        "Nathan Cloos",
        "Kelsey R. Allen",
        "Thomas L. Griffiths",
        "Katherine M. Collins",
        "José Hernández-Orallo",
        "Phillip Isola",
        "Samuel J. Gershman",
        "Joshua B. Tenenbaum"
      ],
      "abstract": "AI systems were evaluated across a diverse set of human-designed games to assess general intelligence, revealing significant gaps in performance compared to human players, particularly in complex cognitive tasks.",
      "summary_en": "AI systems were evaluated across a diverse set of human-designed games to assess general intelligence, revealing significant gaps in performance compared to human players, particularly in complex cognitive tasks.",
      "summary_zh": "AI系统在各类人工设计游戏中接受评估以衡量通用智能，结果显示相较于人类玩家，其性能存在显著差距，特别是在复杂认知任务中。",
      "hf_url": "https://huggingface.co/papers/2602.17594",
      "arxiv_url": "https://arxiv.org/abs/2602.17594",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.17594",
      "github_url": "",
      "upvotes": 7,
      "fetched_at": "2026-02-28T01:46:34.364808+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22594",
      "title": "Causal Motion Diffusion Models for Autoregressive Motion Generation",
      "authors": [
        "Qing Yu",
        "Akihisa Watanabe",
        "Kent Fujiwara"
      ],
      "abstract": "Causal Motion Diffusion Models introduce a unified framework for autoregressive motion generation using a causal diffusion transformer in a semantically aligned latent space, enabling fast, high-quality text-to-motion synthesis with improved temporal smoothness. Recent advances in motion diffusion models have substantially improved the realism of human motion synthesis. However, existing approaches either rely on full-sequence diffusion models with bidirectional generation, which limits temporal causality and real-time applicability, or autoregressive models that suffer from instability and cumulative errors. In this work, we present Causal Motion Diffusion Models (CMDM), a unified framework for autoregressive motion generation based on a causal diffusion transformer that operates in a semantically aligned latent space . CMDM builds upon a Motion-Language-Aligned Causal VAE (MAC-VAE), which encodes motion sequences into temporally causal latent representations. On top of this latent representation, an autoregressive diffusion transformer is trained using causal diffusion forcing to perform temporally ordered denoising across motion frames. To achieve fast inference, we introduce a frame-wise sampling schedule with causal uncertainty , where each subsequent frame is predicted from partially denoised previous frames. The resulting framework supports high-quality text-to-motion generation , streaming synthesis , and long-horizon motion generation at interactive rates. Experiments on HumanML3D and SnapMoGen demonstrate that CMDM outperforms existing diffusion and autoregressive models in both semantic fidelity and temporal smoothness, while substantially reducing inference latency.",
      "summary_en": "Causal Motion Diffusion Models introduce a unified framework for autoregressive motion generation using a causal diffusion transformer in a semantically aligned latent space, enabling fast, high-quality text-to-motion synthesis with improved temporal smoothness.",
      "summary_zh": "Causal Motion Diffusion Models 提出了一种统一框架，在语义对齐的潜空间中使用因果扩散Transformer进行自回归运动生成，实现了快速、高质量的文本到运动合成，并提升了时间平滑性。",
      "hf_url": "https://huggingface.co/papers/2602.22594",
      "arxiv_url": "https://arxiv.org/abs/2602.22594",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22594",
      "github_url": "",
      "upvotes": 5,
      "fetched_at": "2026-02-28T01:46:45.392648+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23339",
      "title": "Retrieve and Segment: Are a Few Examples Enough to Bridge the Supervision Gap in Open-Vocabulary Segmentation?",
      "authors": [
        "Tilemachos Aravanis",
        "Vladan Stojnić",
        "Bill Psomas",
        "Nikos Komodakis",
        "Giorgos Tolias"
      ],
      "abstract": "Retrieval-augmented test-time adaptation with learned fusion of textual and visual features bridges the performance gap between zero-shot and supervised open-vocabulary segmentation. Open-vocabulary segmentation (OVS) extends the zero-shot recognition capabilities of vision-language models (VLMs) to pixel-level prediction , enabling segmentation of arbitrary categories specified by text prompts. Despite recent progress, OVS lags behind fully supervised approaches due to two challenges: the coarse image-level supervision used to train VLMs and the semantic ambiguity of natural language. We address these limitations by introducing a few-shot setting that augments textual prompts with a support set of pixel-annotated images. Building on this, we propose a retrieval-augmented test-time adapter that learns a lightweight, per-image classifier by fusing textual and visual support features. Unlike prior methods relying on late, hand-crafted fusion, our approach performs learned, per-query fusion, achieving stronger synergy between modalities. The method supports continually expanding support set s, and applies to fine-grained tasks such as personalized segmentation . Experiments show that we significantly narrow the gap between zero-shot and supervised segmentation while preserving open-vocabulary ability.",
      "summary_en": "Retrieval-augmented test-time adaptation with learned fusion of textual and visual features bridges the performance gap between zero-shot and supervised open-vocabulary segmentation.",
      "summary_zh": "检索增强的测试时自适应通过文本与视觉特征的学习融合，弥合了零样本与有监督开放词汇分割之间的性能差距。",
      "hf_url": "https://huggingface.co/papers/2602.23339",
      "arxiv_url": "https://arxiv.org/abs/2602.23339",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23339",
      "github_url": "https://github.com/TilemahosAravanis/Retrieve-and-Segment",
      "upvotes": 4,
      "fetched_at": "2026-02-28T01:46:58.748014+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23058",
      "title": "GeoWorld: Geometric World Models",
      "authors": [
        "Zeyu Zhang",
        "Danning Li",
        "Ian Reid",
        "Richard Hartley"
      ],
      "abstract": "GeoWorld addresses limitations in energy-based predictive world models by utilizing hyperbolic geometry to preserve latent state structures and improve long-horizon prediction performance. Energy-based predictive world models provide a powerful approach for multi-step visual planning by reasoning over latent energy landscapes rather than generating pixels. However, existing approaches face two major challenges: (i) their latent representations are typically learned in Euclidean space , neglecting the underlying geometric and hierarchical structure among states, and (ii) they struggle with long-horizon prediction , which leads to rapid degradation across extended rollouts. To address these challenges, we introduce GeoWorld, a geometric world model that preserves geometric structure and hierarchical relations through a Hyperbolic JEPA , which maps latent representations from Euclidean space onto hyperbolic manifolds . We further introduce Geometric Reinforcement Learning for energy-based optimization, enabling stable multi-step planning in hyperbolic latent space. Extensive experiments on CrossTask and COIN demonstrate around 3% SR improvement in 3-step planning and 2% SR improvement in 4-step planning compared to the state-of-the-art V-JEPA 2. Project website: https://steve-zeyu-zhang.github.io/GeoWorld.",
      "summary_en": "GeoWorld addresses limitations in energy-based predictive world models by utilizing hyperbolic geometry to preserve latent state structures and improve long-horizon prediction performance.",
      "summary_zh": "GeoWorld 通过利用双曲几何保留潜在状态结构并改进长程预测性能，解决了基于能量的预测世界模型的局限性。",
      "hf_url": "https://huggingface.co/papers/2602.23058",
      "arxiv_url": "https://arxiv.org/abs/2602.23058",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23058",
      "github_url": "",
      "upvotes": 3,
      "fetched_at": "2026-02-28T01:46:53.148556+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22953",
      "title": "General Agent Evaluation",
      "authors": [
        "Elron Bandel",
        "Asaf Yehudai",
        "Lilach Eden",
        "Yehoshua Sagron",
        "Yotam Perlitz",
        "Elad Venezian",
        "Natalia Razinkov",
        "Natan Ergas",
        "Shlomit Shachor Ifergan",
        "Segev Shlomov",
        "Michal Jacovi",
        "Leshem Choshen",
        "Liat Ein-Dor",
        "Yoav Katz",
        "Michal Shmueli-Scheuer"
      ],
      "abstract": "General-purpose agents remain underdeveloped despite promising implementations, necessitating systematic evaluation frameworks and benchmarks to assess their true versatility across diverse environments.",
      "summary_en": "General-purpose agents remain underdeveloped despite promising implementations, necessitating systematic evaluation frameworks and benchmarks to assess their true versatility across diverse environments.",
      "summary_zh": "尽管已有一些有前景的实现，通用智能体仍然发展不足，需要系统化的评估框架和基准来评估其在多样化环境中的真正通用性。",
      "hf_url": "https://huggingface.co/papers/2602.22953",
      "arxiv_url": "https://arxiv.org/abs/2602.22953",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22953",
      "github_url": "https://github.com/Exgentic/exgentic",
      "upvotes": 3,
      "fetched_at": "2026-02-28T01:46:51.556240+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22437",
      "title": "veScale-FSDP: Flexible and High-Performance FSDP at Scale",
      "authors": [
        "Zezhou Wang",
        "Youjie Li",
        "Zhiqi Lin",
        "Jiacheng Yang",
        "Cong Xie",
        "Guanyu Feng",
        "Zheng Zhong",
        "Ziyue Huang",
        "Hongyu Zhu",
        "Zhi Zhang",
        "Yanghua Peng",
        "Xin Liu"
      ],
      "abstract": "veScale-FSDP introduces a redesigned fully sharded data parallel system with flexible sharding and structure-aware planning to improve scalability and efficiency for large-scale model training. Fully Sharded Data Parallel (FSDP), also known as ZeRO , is widely used for training large-scale models, featuring its flexibility and minimal intrusion on model code. However, current FSDP systems struggle with structure-aware training methods (e.g., block-wise quantized training ) and with non-element-wise optimizers (e.g., Shampoo and Muon ) used in cutting-edge models (e.g., Gemini, Kimi K2). FSDP's fixed element- or row-wise sharding formats conflict with the block-structured computations. In addition, today's implementations fall short in communication and memory efficiency , limiting scaling to tens of thousands of GPUs. We introduce veScale-FSDP, a redesigned FSDP system that couples a flexible sharding format, RaggedShard , with a structure-aware planning algorithm to deliver both flexibility and performance at scale. veScale-FSDP natively supports efficient data placement required by FSDP, empowering block-wise quantization and non-element-wise optimizers . As a result, veScale-FSDP achieves 5~66% higher throughput and 16~30% lower memory usage than existing FSDP systems, while scaling efficiently to tens of thousands of GPUs.",
      "summary_en": "veScale-FSDP introduces a redesigned fully sharded data parallel system with flexible sharding and structure-aware planning to improve scalability and efficiency for large-scale model training.",
      "summary_zh": "veScale-FSDP 提出了一种重新设计的完全分片数据并行系统，采用灵活分片和结构感知规划，以提升大规模模型训练的可扩展性和效率。",
      "hf_url": "https://huggingface.co/papers/2602.22437",
      "arxiv_url": "https://arxiv.org/abs/2602.22437",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22437",
      "github_url": "https://github.com/volcengine/veScale",
      "upvotes": 3,
      "fetched_at": "2026-02-28T01:46:43.034557+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22045",
      "title": "DLT-Corpus: A Large-Scale Text Collection for the Distributed Ledger Technology Domain",
      "authors": [
        "Walter Hernandez Cruz",
        "Peter Devine",
        "Nikhil Vadgama",
        "Paolo Tasca",
        "Jiahua Xu"
      ],
      "abstract": "The DLT-Corpus dataset, containing 2.98 billion tokens from diverse sources, enables analysis of technology emergence patterns and market-innovation correlations in the distributed ledger technology sector. We introduce DLT-Corpus, the largest domain-specific text collection for Distributed Ledger Technology (DLT) research to date: 2.98 billion tokens from 22.12 million documents spanning scientific literature (37,440 publications), United States Patent and Trademark Office (USPTO) patents (49,023 filings), and social media (22 million posts). Existing Natural Language Processing (NLP) resources for DLT focus narrowly on cryptocurrencies price prediction and smart contracts, leaving domain-specific language under explored despite the sector's ~$3 trillion market capitalization and rapid technological evolution. We demonstrate DLT-Corpus' utility by analyzing technology emergence patterns and market-innovation correlations. Findings reveal that technologies originate in scientific literature before reaching patents and social media, following traditional technology transfer patterns . While social media sentiment remains overwhelmingly bullish even during crypto winters, scientific and patent activity grow independently of market fluctuations, tracking overall market expansion in a virtuous cycle where research precedes and enables economic growth that funds further innovation. We publicly release the full DLT-Corpus; LedgerBERT , a domain-adapted model achieving 23% improvement over BERT-base on a DLT-specific Named Entity Recognition (NER) task; and all associated tools and code.",
      "summary_en": "The DLT-Corpus dataset, containing 2.98 billion tokens from diverse sources, enables analysis of technology emergence patterns and market-innovation correlations in the distributed ledger technology sector.",
      "summary_zh": "DLT-Corpus数据集包含来自多样化来源的29.8亿个token，支持分析分布式账本技术领域的技术涌现模式及市场-创新相关性。",
      "hf_url": "https://huggingface.co/papers/2602.22045",
      "arxiv_url": "https://arxiv.org/abs/2602.22045",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22045",
      "github_url": "https://github.com/dlt-science/DLT-Corpus",
      "upvotes": 2,
      "fetched_at": "2026-02-28T01:46:42.224911+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.20423",
      "title": "MedCLIPSeg: Probabilistic Vision-Language Adaptation for Data-Efficient and Generalizable Medical Image Segmentation",
      "authors": [
        "Taha Koleilat",
        "Hojat Asgariandehkordi",
        "Omid Nejati Manzari",
        "Berardino Barile",
        "Yiming Xiao",
        "Hassan Rivaz"
      ],
      "abstract": "MedCLIPSeg adapts CLIP for medical image segmentation by leveraging patch-level embeddings and probabilistic attention to achieve data-efficient, uncertain-aware segmentation with interpretability. Medical image segmentation remains challenging due to limited annotations for training, ambiguous anatomical features, and domain shifts. While vision-language models such as CLIP offer strong cross-modal representations, their potential for dense, text-guided medical image segmentation remains underexplored. We present Med CLIP Seg, a novel framework that adapts CLIP for robust, data-efficient, and uncertainty-aware medical image segmentation . Our approach leverages patch-level CLIP embeddings through probabilistic cross-modal attention , enabling bidirectional interaction between image and text tokens and explicit modeling of predictive uncertainty. Together with a soft patch-level contrastive loss that encourages more nuanced semantic learning across diverse textual prompts, Med CLIP Seg effectively improves data efficiency and domain generalizability . Extensive experiments across 16 datasets spanning five imaging modalities and six organs demonstrate that Med CLIP Seg outperforms prior methods in accuracy, efficiency, and robustness, while providing interpretable uncertainty maps that highlight local reliability of segmentation results. This work demonstrates the potential of probabilistic vision-language modeling for text-driven medical image segmentation .",
      "summary_en": "MedCLIPSeg adapts CLIP for medical image segmentation by leveraging patch-level embeddings and probabilistic attention to achieve data-efficient, uncertain-aware segmentation with interpretability.",
      "summary_zh": "MedCLIPSeg 利用 patch 级嵌入和概率注意力将 CLIP 适配于医学图像分割，实现了数据高效、不确定性感知且具备可解释性的分割。",
      "hf_url": "https://huggingface.co/papers/2602.20423",
      "arxiv_url": "https://arxiv.org/abs/2602.20423",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.20423",
      "github_url": "https://github.com/HealthX-Lab/MedCLIPSeg",
      "upvotes": 2,
      "fetched_at": "2026-02-28T01:46:38.376518+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.20332",
      "title": "No One Size Fits All: QueryBandits for Hallucination Mitigation",
      "authors": [
        "Nicole Cho",
        "William Watson",
        "Alec Koppel",
        "Sumitra Ganesh",
        "Manuela Veloso"
      ],
      "abstract": "A contextual bandit framework named QueryBandits is introduced to adaptively select optimal query-rewrite strategies for reducing hallucinations in large language models, demonstrating superior performance over static policies and enabling deployment with closed-source models. Advanced reasoning capabilities in Large Language Models (LLMs) have led to more frequent hallucinations ; yet most mitigation work focuses on open-source models for post-hoc detection and parameter editing. The dearth of studies focusing on hallucinations in closed-source models is especially concerning, as they constitute the vast majority of models in institutional deployments. We introduce QueryBandits, a model-agnostic contextual bandit framework that adaptively learns online to select the optimal query-rewrite strategy by leveraging an empirically validated and calibrated reward function . Across 16 QA scenarios, our top QueryBandit ( Thompson Sampling ) achieves an 87.5% win rate over a No-Rewrite baseline and outperforms zero-shot static policies (e.g., Paraphrase or Expand) by 42.6% and 60.3%, respectively. Moreover, all contextual bandit s outperform vanilla bandits across all datasets, with higher feature variance coinciding with greater variance in arm selection. This substantiates our finding that there is no single rewrite policy optimal for all queries. We also discover that certain static policies incur higher cumulative regret than No-Rewrite, indicating that an inflexible query-rewriting policy can worsen hallucinations . Thus, learning an online policy over semantic features with QueryBandits can shift model behavior purely through forward-pass mechanisms , enabling its use with closed-source models and bypassing the need for retraining or gradient-based adaptation.",
      "summary_en": "A contextual bandit framework named QueryBandits is introduced to adaptively select optimal query-rewrite strategies for reducing hallucinations in large language models, demonstrating superior performance over static policies and enabling deployment with closed-source models.",
      "summary_zh": "引入了一种名为 QueryBandits 的上下文赌博机框架，用于自适应选择最优查询重写策略以减少大语言模型中的幻觉，其性能优于静态策略，并可与闭源模型协同部署。",
      "hf_url": "https://huggingface.co/papers/2602.20332",
      "arxiv_url": "https://arxiv.org/abs/2602.20332",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.20332",
      "github_url": "",
      "upvotes": 2,
      "fetched_at": "2026-02-28T01:46:37.360003+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.20300",
      "title": "What Makes a Good Query? Measuring the Impact of Human-Confusing Linguistic Features on LLM Performance",
      "authors": [
        "William Watson",
        "Nicole Cho",
        "Sumitra Ganesh",
        "Manuela Veloso"
      ],
      "abstract": "Analysis of 369,837 real-world queries reveals that specific linguistic features correlate with hallucination likelihood in large language models, identifying a risk landscape for query design. Large Language Model (LLM) hallucination s are usually treated as defects of the model or its decoding strategy. Drawing on classical linguistics, we argue that a query's form can also shape a listener's (and model's) response. We operationalize this insight by constructing a 22-dimension query feature vector covering clause complexity , lexical rarity , and anaphora , negation , answerability , and intention grounding , all known to affect human comprehension. Using 369,837 real-world queries, we ask: Are there certain types of queries that make hallucination more likely? A large-scale analysis reveals a consistent \"risk landscape\": certain features such as deep clause nesting and underspecification align with higher hallucination propensity. In contrast, clear intention grounding and answerability align with lower hallucination rates. Others, including domain specificity, show mixed, dataset- and model-dependent effects. Thus, these findings establish an empirically observable query-feature representation correlated with hallucination risk, paving the way for guided query rewriting and future intervention studies.",
      "summary_en": "Analysis of 369,837 real-world queries reveals that specific linguistic features correlate with hallucination likelihood in large language models, identifying a risk landscape for query design.",
      "summary_zh": "对369,837个真实查询的分析表明，特定语言特征与大语言模型的幻觉可能性相关，识别出查询设计的风险图景。",
      "hf_url": "https://huggingface.co/papers/2602.20300",
      "arxiv_url": "https://arxiv.org/abs/2602.20300",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.20300",
      "github_url": "",
      "upvotes": 2,
      "fetched_at": "2026-02-28T01:46:36.383333+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23259",
      "title": "Risk-Aware World Model Predictive Control for Generalizable End-to-End Autonomous Driving",
      "authors": [
        "Jiangxin Sun",
        "Feng Xue",
        "Teng Long",
        "Chang Liu",
        "Jian-Fang Hu",
        "Wei-Shi Zheng",
        "Nicu Sebe"
      ],
      "abstract": "A risk-aware framework for autonomous driving that uses world modeling and risk evaluation to generalize beyond expert demonstrations without requiring explicit expert supervision.",
      "summary_en": "A risk-aware framework for autonomous driving that uses world modeling and risk evaluation to generalize beyond expert demonstrations without requiring explicit expert supervision.",
      "summary_zh": "一种面向自动驾驶的风险感知框架，利用世界建模和风险评估，无需显式专家监督即可泛化至专家演示之外的场景。",
      "hf_url": "https://huggingface.co/papers/2602.23259",
      "arxiv_url": "https://arxiv.org/abs/2602.23259",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23259",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-28T01:46:57.708832+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.23165",
      "title": "DyaDiT: A Multi-Modal Diffusion Transformer for Socially Favorable Dyadic Gesture Generation",
      "authors": [
        "Yichen Peng",
        "Jyun-Ting Song",
        "Siyeol Jung",
        "Ruofan Liu",
        "Haiyang Liu",
        "Xuangeng Chu",
        "Ruicong Liu",
        "Erwin Wu",
        "Hideki Koike",
        "Kris Kitani"
      ],
      "abstract": "DyaDiT is a multi-modal diffusion transformer that generates contextually appropriate human motion from dyadic audio signals by capturing interaction dynamics between two speakers. Generating realistic conversational gestures are essential for achieving natural, socially engaging interactions with digital humans. However, existing methods typically map a single audio stream to a single speaker's motion, without considering social context or modeling the mutual dynamics between two people engaging in conversation. We present DyaDiT, a multi-modal diffusion transformer that generates contextually appropriate human motion from dyadic audio signals . Trained on Seamless Interaction Dataset , DyaDiT takes dyadic audio with optional social-context tokens to produce context-appropriate motion. It fuses information from both speakers to capture interaction dynamics, uses a motion dictionary to encode motion priors, and can optionally utilize the conversational partner's gestures to produce more responsive motion. We evaluate DyaDiT on standard motion generation metrics and conduct quantitative user studies, demonstrating that it not only surpasses existing methods on objective metrics but is also strongly preferred by users, highlighting its robustness and socially favorable motion generation . Code and models will be released upon acceptance.",
      "summary_en": "DyaDiT is a multi-modal diffusion transformer that generates contextually appropriate human motion from dyadic audio signals by capturing interaction dynamics between two speakers.",
      "summary_zh": "DyaDiT是一种多模态扩散Transformer，通过捕捉两位说话者之间的交互动态，从双人音频信号生成与上下文相符的人体动作。",
      "hf_url": "https://huggingface.co/papers/2602.23165",
      "arxiv_url": "https://arxiv.org/abs/2602.23165",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.23165",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-28T01:46:54.710651+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.21420",
      "title": "Overconfident Errors Need Stronger Correction: Asymmetric Confidence Penalties for Reinforcement Learning",
      "authors": [
        "Yuanda Xu",
        "Hejian Sang",
        "Zhengze Zhou",
        "Ran He",
        "Zhipeng Wang"
      ],
      "abstract": "Reinforcement learning with verifiable rewards suffers from reduced reasoning diversity due to uniform error penalization, which is addressed by a confidence-aware asymmetric error penalty method that dynamically modulates advantages based on rollout confidence. Reinforcement Learning with Verifiable Rewards (RLVR) has become the leading paradigm for enhancing reasoning in Large Language Models (LLMs). However, standard RLVR algorithms suffer from a well-documented pathology: while they improve Pass@1 accuracy through sharpened sampling , they simultaneously narrow the model's reasoning boundary and reduce generation diversity . We identify a root cause that existing methods overlook: the uniform penalization of errors. Current approaches -- whether data-filtering methods that select prompts by difficulty, or advantage normalization schemes -- treat all incorrect rollouts within a group identically. We show that this uniformity allows overconfident errors (incorrect reasoning paths that the RL process has spuriously reinforced) to persist and monopolize probability mass, ultimately suppressing valid exploratory trajectories. To address this, we propose the Asymmetric Confidence-aware Error Penalty (ACE). ACE introduces a per-rollout confidence shift metric , c_i = log(pi_theta(y_i|x) / pi_ref(y_i|x)), to dynamically modulate negative advantages. Theoretically, we demonstrate that ACE's gradient can be decomposed into the gradient of a selective regularizer restricted to overconfident errors , plus a well-characterized residual that partially moderates the regularizer's strength. We conduct extensive experiments fine-tuning Qwen2.5-Math-7B, Qwen3-8B-Base, and Llama-3.1-8B-Instruct on the DAPO -Math-17K dataset using GRPO and DAPO within the VERL framework . Evaluated on MATH-500 and AIME 2025 , ACE composes seamlessly with existing methods and consistently improves the full Pass@k spectrum across all three model families and benchmarks.",
      "summary_en": "Reinforcement learning with verifiable rewards suffers from reduced reasoning diversity due to uniform error penalization, which is addressed by a confidence-aware asymmetric error penalty method that dynamically modulates advantages based on rollout confidence.",
      "summary_zh": "可验证奖励的强化学习因统一错误惩罚而面临推理多样性降低的问题，对此，一种置信度感知的不对称错误惩罚方法通过基于 rollout 置信度动态调节优势加以解决。",
      "hf_url": "https://huggingface.co/papers/2602.21420",
      "arxiv_url": "https://arxiv.org/abs/2602.21420",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21420",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-28T01:46:40.445633+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.18253",
      "title": "MEG-to-MEG Transfer Learning and Cross-Task Speech/Silence Detection with Limited Data",
      "authors": [
        "Xabier de Zuazo",
        "Vincenzo Verbeni",
        "Eva Navas",
        "Ibon Saratxaga",
        "Mathieu Bourguignon",
        "Nicola Molinaro"
      ],
      "abstract": "Transfer learning enables efficient MEG-based speech decoding from perception to production tasks using a Conformer model with minimal fine-tuning data. Data-efficient neural decoding is a central challenge for speech brain-computer interfaces. We present the first demonstration of transfer learning and cross-task decoding for MEG-based speech models spanning perception and production. We pre-train a Conformer-based model on 50 hours of single-subject listening data and fine-tune on just 5 minutes per subject across 18 participants. Transfer learning yields consistent improvements, with in-task accuracy gains of 1-4% and larger cross-task gains of up to 5-6%. Not only does pre-training improve performance within each task, but it also enables reliable cross-task decoding between perception and production. Critically, models trained on speech production decode passive listening above chance, confirming that learned representations reflect shared neural processes rather than task-specific motor activity.",
      "summary_en": "Transfer learning enables efficient MEG-based speech decoding from perception to production tasks using a Conformer model with minimal fine-tuning data.",
      "summary_zh": "迁移学习使用Conformer模型，借助极少微调数据，实现了基于MEG的语音解码从感知任务到生成任务的高效迁移。",
      "hf_url": "https://huggingface.co/papers/2602.18253",
      "arxiv_url": "https://arxiv.org/abs/2602.18253",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.18253",
      "github_url": "https://github.com/hitz-zentroa/meg-phone-decoding",
      "upvotes": 1,
      "fetched_at": "2026-02-28T01:46:35.481629+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.22479",
      "title": "Efficient Continual Learning in Language Models via Thalamically Routed Cortical Columns",
      "authors": [
        "Afshin Khadangi"
      ],
      "abstract": "TRC² addresses continual learning challenges in language models through a sparse, chunk-parallel architectural design that enables rapid adaptation without catastrophic forgetting. Continual learning is a core requirement for deployed language models, yet standard training and fine-tuning pipelines remain brittle under non-stationary data. Online updates often induce catastrophic forgetting , while methods that improve stability frequently increase latency, memory footprint, or dense computation in ways that do not scale well to long contexts. We introduce TRC^{2} (Thalamically Routed Cortical Columns ), a decoder-only backbone that addresses continual learning at the architectural level. TRC^{2} combines sparse thalamic routing over cortical columns with mechanisms for modulation , prediction , memory , and feedback , together with a fast corrective pathway that supports rapid adaptation without destabilizing slower parameters. The resulting block is sparse and chunk-parallel , enabling efficient training and inference while preserving clean ablations of each subsystem. We instantiate a reproducible training and evaluation stack and a continual-learning harness that measures proxy forgetting under streaming domain shifts. Across language modeling and continual learning benchmarks , TRC^{2} improves the stability-plasticity tradeoff at comparable compute, enabling rapid on-stream adaptation while preserving previously acquired behavior.",
      "summary_en": "TRC² addresses continual learning challenges in language models through a sparse, chunk-parallel architectural design that enables rapid adaptation without catastrophic forgetting.",
      "summary_zh": "TRC² 通过稀疏的块并行架构设计应对语言模型中的持续学习挑战，实现快速适应且避免灾难性遗忘。",
      "hf_url": "https://huggingface.co/papers/2602.22479",
      "arxiv_url": "https://arxiv.org/abs/2602.22479",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.22479",
      "github_url": "",
      "upvotes": 0,
      "fetched_at": "2026-02-28T01:46:44.013446+00:00"
    },
    {
      "date": "2026-02-27",
      "paper_id": "2602.20981",
      "title": "Echoes Over Time: Unlocking Length Generalization in Video-to-Audio Generation Models",
      "authors": [
        "Christian Simon",
        "Masato Ishii",
        "Wei-Yao Wang",
        "Koichi Saito",
        "Akio Hayakawa",
        "Dongseok Shim",
        "Zhi Zhong",
        "Shuyang Cui",
        "Shusuke Takahashi",
        "Takashi Shibuya",
        "Yuki Mitsufuji"
      ],
      "abstract": "MMHNet enables long-form audio generation from video by integrating hierarchical methods and non-causal Mamba, achieving superior performance over existing video-to-audio approaches. Scaling multimodal alignment between video and audio is challenging, particularly due to limited data and the mismatch between text descriptions and frame-level video information. In this work, we tackle the scaling challenge in multimodal-to-audio generation, examining whether models trained on short instances can generalize to longer ones during testing. To tackle this challenge, we present multimodal hierarchical networks so-called MMHNet , an enhanced extension of state-of-the-art video-to-audio models. Our approach integrates a hierarchical method and non-causal Mamba to support long-form audio generation . Our proposed method significantly improves long audio generation up to more than 5 minutes. We also prove that training short and testing long is possible in the video-to-audio generation tasks without training on the longer durations. We show in our experiments that our proposed method could achieve remarkable results on long-video to audio benchmarks, beating prior works in video-to-audio tasks. Moreover, we showcase our model capability in generating more than 5 minutes, while prior video-to-audio methods fall short in generating with long durations.",
      "summary_en": "MMHNet enables long-form audio generation from video by integrating hierarchical methods and non-causal Mamba, achieving superior performance over existing video-to-audio approaches.",
      "summary_zh": "MMHNet通过整合分层方法和非因果Mamba实现从视频生成长音频，性能优于现有视频到音频方法。",
      "hf_url": "https://huggingface.co/papers/2602.20981",
      "arxiv_url": "https://arxiv.org/abs/2602.20981",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.20981",
      "github_url": "",
      "upvotes": 0,
      "fetched_at": "2026-02-28T01:46:39.629701+00:00"
    }
  ]
}