{
  "date": "2026-02-06",
  "count": 47,
  "papers": [
    {
      "date": "2026-02-06",
      "paper_id": "2601.22027",
      "title": "CAR-bench: Evaluating the Consistency and Limit-Awareness of LLM Agents under Real-World Uncertainty",
      "authors": [
        "Johannes Kirmayr",
        "Lukas Stappen",
        "Elisabeth André"
      ],
      "abstract": "Current LLM agent benchmarks fail to evaluate reliability in real-world scenarios with uncertain user inputs, prompting the creation of CAR-bench to test consistency, uncertainty management, and capability awareness in in-car assistant applications. Existing benchmarks for Large Language Model (LLM) agents focus on task completion under idealistic settings but overlook reliability in real-world, user-facing applications. In domains, such as in-car voice assistants, users often issue incomplete or ambiguous requests, creating intrinsic uncertainty that agents must manage through dialogue, tool use, and policy adherence . We introduce CAR-bench, a benchmark for evaluating consistency, uncertainty handling, and capability awareness in multi-turn, tool-using LLM agents in an in-car assistant domain. The environment features an LLM-simulated user, domain policies, and 58 interconnected tools spanning navigation, productivity, charging, and vehicle control. Beyond standard task completion, CAR-bench introduces Hallucination tasks that test agents' limit-awareness under missing tools or information, and Disambiguation tasks that require resolving uncertainty through clarification or internal information gathering. Baseline results reveal large gaps between occasional and consistent success on all task types. Even frontier reasoning LLMs achieve less than 50% consistent pass rate on Disambiguation tasks due to premature actions, and frequently violate policies or fabricate information to satisfy user requests in Hallucination tasks , underscoring the need for more reliable and self-aware LLM agents in real-world settings.",
      "summary_en": "Current LLM agent benchmarks fail to evaluate reliability in real-world scenarios with uncertain user inputs, prompting the creation of CAR-bench to test consistency, uncertainty management, and capability awareness in in-car assistant applications.",
      "summary_zh": "现有LLM agent基准测试难以评估真实场景下不确定用户输入的可靠性，因而催生了CAR-bench，用于测试车载助手应用的一致性、不确定性管理和能力认知。",
      "hf_url": "https://huggingface.co/papers/2601.22027",
      "arxiv_url": "https://arxiv.org/abs/2601.22027",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22027",
      "github_url": "https://github.com/CAR-bench/car-bench",
      "upvotes": 81,
      "fetched_at": "2026-02-19T05:42:30.246901+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05386",
      "title": "Spider-Sense: Intrinsic Risk Sensing for Efficient Agent Defense with Hierarchical Adaptive Screening",
      "authors": [
        "Zhenxiong Yu",
        "Zhi Yang",
        "Zhiheng Jin",
        "Shuhe Wang",
        "Heng Zhang",
        "Yanlin Fei",
        "Lingfeng Zeng",
        "Fangqi Lou",
        "Shuo Zhang",
        "Tu Hu",
        "Jingping Liu",
        "Rongze Chen",
        "Xingyu Zhu",
        "Kunyi Wang",
        "Chaofa Yuan",
        "Xin Guo",
        "Zhaowei Liu",
        "Feipeng Zhang",
        "Jie Huang",
        "Huacan Wang",
        "Ronghao Chen",
        "Liwen Zhang"
      ],
      "abstract": "Spider-Sense framework provides intrinsic and selective agent security through event-driven defense with intrinsic risk sensing, achieving low attack success and false positive rates with minimal latency overhead. As large language models (LLMs) evolve into autonomous agents , their real-world applicability has expanded significantly, accompanied by new security challenges . Most existing agent defense mechanisms adopt a mandatory checking paradigm , in which security validation is forcibly triggered at predefined stages of the agent lifecycle. In this work, we argue that effective agent security should be intrinsic and selective rather than architecturally decoupled and mandatory. We propose Spider-Sense framework, an event-driven defense framework based on Intrinsic Risk Sensing (IRS), which allows agents to maintain latent vigilance and trigger defenses only upon risk perception. Once triggered, the Spider-Sense invokes a hierarchical defence mechanism that trades off efficiency and precision: it resolves known patterns via lightweight similarity matching while escalating ambiguous cases to deep internal reasoning , thereby eliminating reliance on external models. To facilitate rigorous evaluation, we introduce S^2Bench, a lifecycle-aware benchmark featuring realistic tool execution and multi-stage attacks. Extensive experiments demonstrate that Spider-Sense achieves competitive or superior defense performance, attaining the lowest Attack Success Rate (ASR) and False Positive Rate (FPR), with only a marginal latency overhead of 8.3\\%.",
      "summary_en": "Spider-Sense framework provides intrinsic and selective agent security through event-driven defense with intrinsic risk sensing, achieving low attack success and false positive rates with minimal latency overhead.",
      "summary_zh": "Spider-Sense框架通过事件驱动防御与内在风险感知，提供内在且选择性的智能体安全，在极低延迟开销下实现低攻击成功率与误报率。",
      "hf_url": "https://huggingface.co/papers/2602.05386",
      "arxiv_url": "https://arxiv.org/abs/2602.05386",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05386",
      "github_url": "https://github.com/aifinlab/Spider-Sense",
      "upvotes": 69,
      "fetched_at": "2026-02-19T05:43:08.010462+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.02474",
      "title": "MemSkill: Learning and Evolving Memory Skills for Self-Evolving Agents",
      "authors": [
        "Haozhen Zhang",
        "Quanyu Long",
        "Jianzhu Bao",
        "Tao Feng",
        "Weizhi Zhang",
        "Haodong Yue",
        "Wenya Wang"
      ],
      "abstract": "MemSkill introduces a learnable and evolvable memory system for LLM agents that dynamically selects and refines memory operations through controller-executor-designer components. Most Large Language Model (LLM) agent memory systems rely on a small set of static, hand-designed operations for extracting memory. These fixed procedures hard-code human priors about what to store and how to revise memory, making them rigid under diverse interaction patterns and inefficient on long histories. To this end, we present MemSkill, which reframes these operations as learnable and evolvable memory skills, structured and reusable routines for extracting, consolidating, and pruning information from interaction traces . Inspired by the design philosophy of agent skills , MemSkill employs a controller that learns to select a small set of relevant skills, paired with an LLM-based executor that produces skill-guided memories. Beyond learning skill selection , MemSkill introduces a designer that periodically reviews hard cases where selected skills yield incorrect or incomplete memories, and evolves the skill set by proposing refinements and new skills. Together, MemSkill forms a closed-loop procedure that improves both the skill-selection policy and the skill set itself. Experiments on LoCoMo, LongMemEval, HotpotQA, and ALFWorld demonstrate that MemSkill improves task performance over strong baselines and generalizes well across settings. Further analyses shed light on how skills evolve, offering insights toward more adaptive, self-evolving memory management for LLM agents.",
      "summary_en": "MemSkill introduces a learnable and evolvable memory system for LLM agents that dynamically selects and refines memory operations through controller-executor-designer components.",
      "summary_zh": "MemSkill为LLM智能体引入了一种可学习且可演化的记忆系统，通过controller-executor-designer组件动态选择和优化记忆操作。",
      "hf_url": "https://huggingface.co/papers/2602.02474",
      "arxiv_url": "https://arxiv.org/abs/2602.02474",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02474",
      "github_url": "https://github.com/ViktorAxelsen/MemSkill",
      "upvotes": 55,
      "fetched_at": "2026-02-19T05:42:41.753491+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05261",
      "title": "Length-Unbiased Sequence Policy Optimization: Revealing and Controlling Response Length Variation in RLVR",
      "authors": [
        "Fanfan Liu",
        "Youyang Yin",
        "Peng Shi",
        "Siqi Yang",
        "Zhixiong Zeng",
        "Haibo Qiu"
      ],
      "abstract": "Research analyzes RLVR algorithms' impact on response length in LLMs and VLMs, proposing LUSPO to eliminate length bias and improve reasoning performance. Recent applications of Reinforcement Learning with Verifiable Rewards (RLVR) to Large Language Models ( LLMs ) and Vision-Language Models (VLMs) have demonstrated significant success in enhancing reasoning capabilities for complex tasks. During RLVR training, an increase in response length is often regarded as a key factor contributing to the growth of reasoning ability. However, the patterns of change in response length vary significantly across different RLVR algorithms during the training process. To provide a fundamental explanation for these variations, this paper conducts an in-depth analysis of the components of mainstream RLVR algorithms. We present a theoretical analysis of the factors influencing response length and validate our theory through extensive experimentation. Building upon these theoretical findings, we propose the Length-Unbiased Sequence Policy Optimization (LUSPO) algorithm. Specifically, we rectify the length bias inherent in Group Sequence Policy Optimization (GSPO), rendering its loss function unbiased with respect to response length and thereby resolving the issue of response length collapse. We conduct extensive experiments across mathematical reasoning benchmarks and multimodal reasoning scenarios, where LUSPO consistently achieves superior performance. Empirical results demonstrate that LUSPO represents a novel, state-of-the-art optimization strategy compared to existing methods such as GRPO and GSPO.",
      "summary_en": "Research analyzes RLVR algorithms' impact on response length in LLMs and VLMs, proposing LUSPO to eliminate length bias and improve reasoning performance.",
      "summary_zh": "研究分析了RLVR算法对LLMs和VLMs回复长度的影响，提出LUSPO以消除长度偏置并提升推理性能。",
      "hf_url": "https://huggingface.co/papers/2602.05261",
      "arxiv_url": "https://arxiv.org/abs/2602.05261",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05261",
      "github_url": "https://github.com/murphy4122/LUSPO",
      "upvotes": 49,
      "fetched_at": "2026-02-19T05:43:03.826230+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06036",
      "title": "DFlash: Block Diffusion for Flash Speculative Decoding",
      "authors": [
        "Jian Chen",
        "Yesheng Liang",
        "Zhijian Liu"
      ],
      "abstract": "DFlash is a speculative decoding framework that uses a lightweight block diffusion model for parallel token drafting, achieving significant speedup over existing autoregressive methods while maintaining high-quality outputs. Autoregressive large language models (LLMs) deliver strong performance but require inherently sequential decoding, leading to high inference latency and poor GPU utilization. Speculative decoding mitigates this bottleneck by using a fast draft model whose outputs are verified in parallel by the target LLM; however, existing methods still rely on autoregressive drafting, which remains sequential and limits practical speedups. Diffusion LLMs offer a promising alternative by enabling parallel generation , but current diffusion models typically underperform compared with autoregressive models. In this paper, we introduce DFlash, a speculative decoding framework that employs a lightweight block diffusion model for parallel drafting. By generating draft tokens in a single forward pass and conditioning the draft model on context features extracted from the target model, DFlash enables efficient drafting with high-quality outputs and higher acceptance rates . Experiments show that DFlash achieves over 6x lossless acceleration across a range of models and tasks, delivering up to 2.5x higher speedup than the state-of-the-art speculative decoding method EAGLE-3 .",
      "summary_en": "DFlash is a speculative decoding framework that uses a lightweight block diffusion model for parallel token drafting, achieving significant speedup over existing autoregressive methods while maintaining high-quality outputs.",
      "summary_zh": "DFlash是一种投机解码框架，使用轻量级块扩散模型进行并行token起草，在保持高质量输出的同时，相较现有自回归方法实现了显著加速。",
      "hf_url": "https://huggingface.co/papers/2602.06036",
      "arxiv_url": "https://arxiv.org/abs/2602.06036",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06036",
      "github_url": "https://github.com/z-lab/dflash",
      "upvotes": 41,
      "fetched_at": "2026-02-19T05:43:31.661470+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06028",
      "title": "Context Forcing: Consistent Autoregressive Video Generation with Long Context",
      "authors": [
        "Shuo Chen",
        "Cong Wei",
        "Sun Sun",
        "Ping Nie",
        "Kai Zhou",
        "Ge Zhang",
        "Ming-Hsuan Yang",
        "Wenhu Chen"
      ],
      "abstract": "Context Forcing addresses student-teacher mismatch in long video generation by using a long-context teacher to guide long-rollout students through a Slow-Fast Memory architecture that extends context length beyond 20 seconds.",
      "summary_en": "Context Forcing addresses student-teacher mismatch in long video generation by using a long-context teacher to guide long-rollout students through a Slow-Fast Memory architecture that extends context length beyond 20 seconds.",
      "summary_zh": "Context Forcing 通过使用长上下文教师指导长 rollout 学生，并采用 Slow-Fast Memory 架构将上下文长度扩展至20秒以上，解决长视频生成中的师生不匹配问题。",
      "hf_url": "https://huggingface.co/papers/2602.06028",
      "arxiv_url": "https://arxiv.org/abs/2602.06028",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06028",
      "github_url": "https://github.com/TIGER-AI-Lab/Context-Forcing",
      "upvotes": 35,
      "fetched_at": "2026-02-19T05:43:25.964003+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05885",
      "title": "Dr. Kernel: Reinforcement Learning Done Right for Triton Kernel Generations",
      "authors": [
        "Wei Liu",
        "Jiawei Xu",
        "Yingru Li",
        "Longtao Zheng",
        "Tianjian Li",
        "Qian Liu",
        "Junxian He"
      ],
      "abstract": "Reinforcement learning approach for kernel generation addresses reward hacking and optimization issues through specialized environment and unbiased policy gradient methods, achieving competitive performance with state-of-the-art models. High-quality kernel is critical for scalable AI systems, and enabling LLMs to generate such code would advance AI development. However, training LLMs for this task requires sufficient data, a robust environment, and the process is often vulnerable to reward hacking and lazy optimization. In these cases, models may hack training rewards and prioritize trivial correctness over meaningful speedup. In this paper, we systematically study reinforcement learning (RL) for kernel generation . We first design KernelGYM, a robust distributed GPU environment that supports reward hacking check, data collection from multi-turn interactions and long-term RL training. Building on KernelGYM, we investigate effective multi-turn RL methods and identify a biased policy gradient issue caused by self-inclusion in GRPO . To solve this, we propose Turn-level Reinforce-Leave-One-Out (TRLOO) to provide unbiased advantage estimation for multi-turn RL . To alleviate lazy optimization, we incorporate mismatch correction for training stability and introduce Profiling-based Rewards (PR) and Profiling-based Rejection Sampling (PRS) to overcome the issue. The trained model, Dr.Kernel-14B, reaches performance competitive with Claude-4.5-Sonnet in Kernelbench. Finally, we study sequential test-time scaling for Dr.Kernel-14B. On the KernelBench Level-2 subset, 31.6% of the generated kernels achieve at least a 1.2x speedup over the Torch reference, surpassing Claude-4.5-Sonnet (26.7%) and GPT-5 (28.6%). When selecting the best candidate across all turns, this 1.2x speedup rate further increases to 47.8%. All resources, including environment, training code, models, and dataset, are included in https://www.github.com/hkust-nlp/KernelGYM.",
      "summary_en": "Reinforcement learning approach for kernel generation addresses reward hacking and optimization issues through specialized environment and unbiased policy gradient methods, achieving competitive performance with state-of-the-art models.",
      "summary_zh": "针对内核生成的强化学习方法通过专用环境和无偏策略梯度方法解决奖励黑客与优化问题，取得了与最先进模型相当的性能。",
      "hf_url": "https://huggingface.co/papers/2602.05885",
      "arxiv_url": "https://arxiv.org/abs/2602.05885",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05885",
      "github_url": "https://github.com/hkust-nlp/KernelGYM",
      "upvotes": 28,
      "fetched_at": "2026-02-19T05:43:19.712091+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04884",
      "title": "Reinforced Attention Learning",
      "authors": [
        "Bangzheng Li",
        "Jianmo Ni",
        "Chen Qu",
        "Ian Miao",
        "Liu Yang",
        "Xingyu Fu",
        "Muhao Chen",
        "Derek Zhiyuan Cheng"
      ],
      "abstract": "Reinforced Attention Learning optimizes internal attention distributions in multimodal language models, improving information allocation and cross-modal alignment through policy-gradient methods. Post-training with Reinforcement Learning (RL) has substantially improved reasoning in Large Language Models (LLMs) via test-time scaling . However, extending this paradigm to Multimodal LLMs (MLLMs) through verbose rationales yields limited gains for perception and can even degrade performance. We propose Reinforced Attention Learning (RAL), a policy-gradient framework that directly optimizes internal attention distributions rather than output token sequences. By shifting optimization from what to generate to where to attend, RAL promotes effective information allocation and improved grounding in complex multimodal inputs. Experiments across diverse image and video benchmarks show consistent gains over GRPO and other baselines. We further introduce On-Policy Attention Distillation , demonstrating that transferring latent attention behaviors yields stronger cross-modal alignment than standard knowledge distillation . Our results position attention policies as a principled and general alternative for multimodal post-training.",
      "summary_en": "Reinforced Attention Learning optimizes internal attention distributions in multimodal language models, improving information allocation and cross-modal alignment through policy-gradient methods.",
      "summary_zh": "强化注意力学习通过策略梯度方法优化多模态语言模型中的内部注意力分布，改进信息分配与跨模态对齐。",
      "hf_url": "https://huggingface.co/papers/2602.04884",
      "arxiv_url": "https://arxiv.org/abs/2602.04884",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04884",
      "github_url": "",
      "upvotes": 28,
      "fetched_at": "2026-02-19T05:42:52.293790+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05842",
      "title": "Reinforcement World Model Learning for LLM-based Agents",
      "authors": [
        "Xiao Yu",
        "Baolin Peng",
        "Ruize Xu",
        "Yelong Shen",
        "Pengcheng He",
        "Suman Nath",
        "Nikhil Singh",
        "Jiangfeng Gao",
        "Zhou Yu"
      ],
      "abstract": "Reinforcement World Model Learning enables LLM-based agents to better anticipate action consequences and adapt to environment dynamics through self-supervised training that aligns simulated and real-world state transitions in embedding space. Large language models (LLMs) have achieved strong performance in language-centric tasks. However, in agentic settings, LLMs often struggle to anticipate action consequences and adapt to environment dynamics, highlighting the need for world-modeling capabilities in LLM-based agents. We propose Reinforcement World Model Learning (RWML), a self-supervised method that learns action-conditioned world models for LLM-based agents on textual states using sim-to-real gap rewards . Our method aligns simulated next states produced by the model with realized next states observed from the environment, encouraging consistency between internal world simulations and actual environment dynamics in a pre-trained embedding space . Unlike next-state token prediction , which prioritizes token-level fidelity (i.e., reproducing exact wording) over semantic equivalence and can lead to model collapse, our method provides a more robust training signal and is empirically less susceptible to reward hacking than LLM-as-a-judge. We evaluate our method on ALFWorld and τ^2 Bench and observe significant gains over the base model, despite being entirely self-supervised. When combined with task-success rewards , our method outperforms direct task-success reward RL by 6.9 and 5.7 points on ALFWorld and τ^2 Bench respectively, while matching the performance of expert-data training.",
      "summary_en": "Reinforcement World Model Learning enables LLM-based agents to better anticipate action consequences and adapt to environment dynamics through self-supervised training that aligns simulated and real-world state transitions in embedding space.",
      "summary_zh": "强化世界模型学习通过在嵌入空间中对齐模拟与真实世界状态转移的自监督训练，使基于LLM的智能体能够更好地预测动作后果并适应环境动态。",
      "hf_url": "https://huggingface.co/papers/2602.05842",
      "arxiv_url": "https://arxiv.org/abs/2602.05842",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05842",
      "github_url": "",
      "upvotes": 27,
      "fetched_at": "2026-02-19T05:43:15.196514+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05986",
      "title": "RISE-Video: Can Video Generators Decode Implicit World Rules?",
      "authors": [
        "Mingxin Liu",
        "Shuran Ma",
        "Shibei Meng",
        "Xiangyu Zhao",
        "Zicheng Zhang",
        "Shaofeng Zhang",
        "Zhihang Zhong",
        "Peixian Chen",
        "Haoyu Cao",
        "Xing Sun",
        "Haodong Duan",
        "Xue Yang"
      ],
      "abstract": "RISE-Video presents a novel benchmark for evaluating text-image-to-video synthesis models based on cognitive reasoning rather than visual fidelity, using a multi-dimensional metric system and automated LMM-based evaluation. While generative video models have achieved remarkable visual fidelity, their capacity to internalize and reason over implicit world rules remains a critical yet under-explored frontier. To bridge this gap, we present RISE-Video, a pioneering reasoning-oriented benchmark for Text-Image-to-Video (TI2V) synthesis that shifts the evaluative focus from surface-level aesthetics to deep cognitive reasoning. RISE-Video comprises 467 meticulously human-annotated samples spanning eight rigorous categories, providing a structured testbed for probing model intelligence across diverse dimensions, ranging from commonsense and spatial dynamics to specialized subject domains. Our framework introduces a multi-dimensional evaluation protocol consisting of four metrics: Reasoning Alignment , Temporal Consistency , Physical Rationality , and Visual Quality . To further support scalable evaluation, we propose an automated pipeline leveraging Large Multimodal Models (LMMs) to emulate human-centric assessment. Extensive experiments on 11 state-of-the-art TI2V models reveal pervasive deficiencies in simulating complex scenarios under implicit constraints, offering critical insights for the advancement of future world-simulating generative models.",
      "summary_en": "RISE-Video presents a novel benchmark for evaluating text-image-to-video synthesis models based on cognitive reasoning rather than visual fidelity, using a multi-dimensional metric system and automated LMM-based evaluation.",
      "summary_zh": "RISE-Video提出了一个基于认知推理而非视觉保真度评估文本-图像到视频合成模型的新基准，采用多维指标系统和基于LMM的自动化评估。",
      "hf_url": "https://huggingface.co/papers/2602.05986",
      "arxiv_url": "https://arxiv.org/abs/2602.05986",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05986",
      "github_url": "https://github.com/VisionXLab/Rise-Video",
      "upvotes": 26,
      "fetched_at": "2026-02-19T05:43:24.376799+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.03338",
      "title": "Accurate Failure Prediction in Agents Does Not Imply Effective Failure Prevention",
      "authors": [
        "Rakshith Vasudev",
        "Melisa Russak",
        "Dan Bikel",
        "Waseem Alshikh"
      ],
      "abstract": "LLM critic models with high offline accuracy can cause variable performance impacts at deployment, necessitating pre-deployment testing to determine intervention safety and effectiveness. Proactive interventions by LLM critic models are often assumed to improve reliability, yet their effects at deployment time are poorly understood. We show that a binary LLM critic with strong offline accuracy ( AUROC 0.94) can nevertheless cause severe performance degradation, inducing a 26 percentage point (pp) collapse on one model while affecting another by near zero pp. This variability demonstrates that LLM critic accuracy alone is insufficient to determine whether intervention is safe. We identify a disruption-recovery tradeoff : interventions may recover failing trajectories but also disrupt trajectories that would have succeeded. Based on this insight, we propose a pre-deployment test that uses a small pilot of 50 tasks to estimate whether intervention is likely to help or harm, without requiring full deployment. Across benchmarks, the test correctly anticipates outcomes: intervention degrades performance on high-success tasks (0 to -26 pp), while yielding a modest improvement on the high-failure ALFWorld benchmark (+2.8 pp, p=0.014). The primary value of our framework is therefore identifying when not to intervene, preventing severe regressions before deployment.",
      "summary_en": "LLM critic models with high offline accuracy can cause variable performance impacts at deployment, necessitating pre-deployment testing to determine intervention safety and effectiveness.",
      "summary_zh": "具有高离线准确率的LLM critic模型在部署时可能造成多变的性能影响，因此需要进行部署前测试以确定干预的安全性与有效性。",
      "hf_url": "https://huggingface.co/papers/2602.03338",
      "arxiv_url": "https://arxiv.org/abs/2602.03338",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03338",
      "github_url": "",
      "upvotes": 26,
      "fetched_at": "2026-02-19T05:42:44.852414+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05327",
      "title": "ProAct: Agentic Lookahead in Interactive Environments",
      "authors": [
        "Yangbin Yu",
        "Mingyu Yang",
        "Junyou Li",
        "Yiming Gao",
        "Feiyu Liu",
        "Yijun Yang",
        "Zichuan Lin",
        "Jiafei Lyu",
        "Yicheng Liu",
        "Zhicong Lu",
        "Deheng Ye",
        "Jie Jiang"
      ],
      "abstract": "ProAct enhances LLM agents' long-horizon planning by combining supervised fine-tuning with search-derived trajectories and a Monte-Carlo critic for improved policy optimization.",
      "summary_en": "ProAct enhances LLM agents' long-horizon planning by combining supervised fine-tuning with search-derived trajectories and a Monte-Carlo critic for improved policy optimization.",
      "summary_zh": "ProAct结合监督微调与搜索派生轨迹，并利用蒙特卡洛critic改进策略优化，从而增强LLM智能体的长程规划能力。",
      "hf_url": "https://huggingface.co/papers/2602.05327",
      "arxiv_url": "https://arxiv.org/abs/2602.05327",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05327",
      "github_url": "https://github.com/GreatX3/ProAct",
      "upvotes": 25,
      "fetched_at": "2026-02-19T05:43:06.660969+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04942",
      "title": "Privileged Information Distillation for Language Models",
      "authors": [
        "Emiliano Penaloza",
        "Dheeraj Vattikonda",
        "Nicolas Gontier",
        "Alexandre Lacoste",
        "Laurent Charlin",
        "Massimo Caccia"
      ],
      "abstract": "Training methods that utilize privileged information for language model distillation in multi-turn environments outperform standard supervised fine-tuning followed by reinforcement learning approaches. Training-time privileged information (PI) can enable language models to succeed on tasks they would otherwise fail, making it a powerful tool for reinforcement learning in hard, long-horizon settings. However, transferring capabilities learned with PI to policies that must act without it at inference time remains a fundamental challenge. We study this problem in the context of distilling frontier models for multi-turn agentic environments, where closed-source systems typically hide their internal reasoning and expose only action trajectories. This breaks standard distillation pipelines, since successful behavior is observable but the reasoning process is not. For this, we introduce π-Distill, a joint teacher-student objective that trains a PI-conditioned teacher and an unconditioned student simultaneously using the same model. Additionally, we also introduce On-Policy Self-Distillation (OPSD), an alternative approach that trains using Reinforcement Learning (RL) with a reverse KL-penalty between the student and the PI-conditioned teacher. We show that both of these algorithms effectively distill frontier agents using action-only PI. Specifically we find that π-Distill and in some cases OPSD, outperform industry standard practices (Supervised finetuning followed by RL) that assume access to full Chain-of-Thought supervision across multiple agentic benchmarks, models, and forms of PI. We complement our results with extensive analysis that characterizes the factors enabling effective learning with PI, focusing primarily on π-Distill and characterizing when OPSD is competitive.",
      "summary_en": "Training methods that utilize privileged information for language model distillation in multi-turn environments outperform standard supervised fine-tuning followed by reinforcement learning approaches.",
      "summary_zh": "在多轮环境中利用特权信息进行语言模型蒸馏的训练方法优于标准监督微调后接强化学习的方法。",
      "hf_url": "https://huggingface.co/papers/2602.04942",
      "arxiv_url": "https://arxiv.org/abs/2602.04942",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04942",
      "github_url": "",
      "upvotes": 25,
      "fetched_at": "2026-02-19T05:42:53.735142+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06035",
      "title": "InterPrior: Scaling Generative Control for Physics-Based Human-Object Interactions",
      "authors": [
        "Sirui Xu",
        "Samuel Schulter",
        "Morteza Ziyadi",
        "Xialin He",
        "Xiaohan Fei",
        "Yu-Xiong Wang",
        "Liangyan Gui"
      ],
      "abstract": "A scalable framework called InterPrior learns a unified generative controller through imitation learning and reinforcement learning to enable humanoids to generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination. Humans rarely plan whole-body interactions with objects at the level of explicit whole-body movements. High-level intentions, such as affordance, define the goal, while coordinated balance, contact, and manipulation can emerge naturally from underlying physical and motor priors. Scaling such priors is key to enabling humanoids to compose and generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination . To this end, we introduce InterPrior, a scalable framework that learns a unified generative controller through large-scale imitation pretraining and post-training by reinforcement learning . InterPrior first distills a full-reference imitation expert into a versatile, goal-conditioned variational policy that reconstructs motion from multimodal observations and high-level intent. While the distilled policy reconstructs training behaviors, it does not generalize reliably due to the vast configuration space of large-scale human-object interactions. To address this, we apply data augmentation with physical perturbations , and then perform reinforcement learning finetuning to improve competence on unseen goals and initializations. Together, these steps consolidate the reconstructed latent skills into a valid manifold, yielding a motion prior that generalizes beyond the training data, e.g., it can incorporate new behaviors such as interactions with unseen objects. We further demonstrate its effectiveness for user-interactive control and its potential for real robot deployment.",
      "summary_en": "A scalable framework called InterPrior learns a unified generative controller through imitation learning and reinforcement learning to enable humanoids to generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination.",
      "summary_zh": "名为 InterPrior 的可扩展框架通过模仿学习与强化学习训练统一的生成式控制器，使人形机器人能够在多样化场景中泛化移动操作技能，同时保持物理一致性的全身协调。",
      "hf_url": "https://huggingface.co/papers/2602.06035",
      "arxiv_url": "https://arxiv.org/abs/2602.06035",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06035",
      "github_url": "",
      "upvotes": 23,
      "fetched_at": "2026-02-19T05:43:30.224065+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05216",
      "title": "Semantic Search over 9 Million Mathematical Theorems",
      "authors": [
        "Luke Alexander",
        "Eric Leonen",
        "Sophie Szeto",
        "Artemii Remizov",
        "Ignacio Tejeda",
        "Giovanni Inchiostro",
        "Vasily Ilin"
      ],
      "abstract": "Large-scale semantic theorem retrieval system demonstrates superior performance over existing baselines using a 9.2 million theorem corpus with systematic analysis of representation context, language model choice, and embedding strategies. Searching for mathematical results remains difficult: most existing tools retrieve entire papers, while mathematicians and theorem-proving agents often seek a specific theorem, lemma, or proposition that answers a query. While semantic search has seen rapid progress, its behavior on large, highly technical corpora such as research-level mathematical theorems remains poorly understood. In this work, we introduce and study semantic theorem retrieval at scale over a unified corpus of 9.2 million theorem statements extracted from arXiv and seven other sources, representing the largest publicly available corpus of human-authored, research-level theorems. We represent each theorem with a short natural-language description as a retrieval representation and systematically analyze how representation context, language model choice , embedding model , and prompting strategy affect retrieval quality. On a curated evaluation set of theorem-search queries written by professional mathematicians, our approach substantially improves both theorem-level and paper-level retrieval compared to existing baselines, demonstrating that semantic theorem search is feasible and effective at web scale. The theorem search tool is available at https://huggingface.co/spaces/uw-math-ai/theorem-search{this link}, and the dataset is available at https://huggingface.co/datasets/uw-math-ai/TheoremSearch{this link}.",
      "summary_en": "Large-scale semantic theorem retrieval system demonstrates superior performance over existing baselines using a 9.2 million theorem corpus with systematic analysis of representation context, language model choice, and embedding strategies.",
      "summary_zh": "大规模语义定理检索系统基于920万定理语料库，通过对表示上下文、语言模型选择及嵌入策略的系统分析，展现出优于现有基线的性能。",
      "hf_url": "https://huggingface.co/papers/2602.05216",
      "arxiv_url": "https://arxiv.org/abs/2602.05216",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05216",
      "github_url": "",
      "upvotes": 20,
      "fetched_at": "2026-02-19T05:43:00.782393+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2601.21937",
      "title": "Retrieval-Infused Reasoning Sandbox: A Benchmark for Decoupling Retrieval and Reasoning Capabilities",
      "authors": [
        "Shuangshuang Ying",
        "Zheyu Wang",
        "Yunjian Peng",
        "Jin Chen",
        "Yuhao Wu",
        "Hongbin Lin",
        "Dingyu He",
        "Siyi Liu",
        "Gengchen Yu",
        "YinZhu Piao",
        "Yuchen Wu",
        "Xin Gui",
        "Zhongyuan Peng",
        "Xin Li",
        "Xeron Du",
        "Libo Qin",
        "YiXin Cao",
        "Ge Zhang",
        "Stephen Huang"
      ],
      "abstract": "DeR2 presents a controlled evaluation framework for assessing language models' document-grounded reasoning capabilities by isolating reasoning from retrieval and toolchain decisions. Despite strong performance on existing benchmarks, it remains unclear whether large language models can reason over genuinely novel scientific information. Most evaluations score end-to-end RAG pipelines, where reasoning is confounded with retrieval and toolchain choices, and the signal is further contaminated by parametric memorization and open-web volatility . We introduce DeR2, a controlled deep-research sandbox that isolates document-grounded reasoning while preserving core difficulties of deep search : multi-step synthesis , denoising , and evidence-based conclusion making . DeR2 decouples evidence access from reasoning via four regimes--Instruction-only, Concepts (gold concepts without documents), Related-only (only relevant documents), and Full-set (relevant documents plus topically related distractors)--yielding interpretable regime gaps that operationalize retrieval loss vs. reasoning loss and enable fine-grained error attribution . To prevent parametric leakage, we apply a two-phase validation that requires parametric failure without evidence while ensuring oracle-concept solvability . To ensure reproducibility, each instance provides a frozen document library (drawn from 2023-2025 theoretical papers) with expert-annotated concepts and validated rationales . Experiments across a diverse set of state-of-the-art foundation models reveal substantial variation and significant headroom: some models exhibit mode-switch fragility, performing worse with the Full-set than with Instruction-only, while others show structural concept misuse, correctly naming concepts but failing to execute them as procedures.",
      "summary_en": "DeR2 presents a controlled evaluation framework for assessing language models' document-grounded reasoning capabilities by isolating reasoning from retrieval and toolchain decisions.",
      "summary_zh": "DeR2 提出了一个受控评估框架，通过将推理与检索及工具链决策分离，来评估语言模型的基于文档的推理能力。",
      "hf_url": "https://huggingface.co/papers/2601.21937",
      "arxiv_url": "https://arxiv.org/abs/2601.21937",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.21937",
      "github_url": "https://github.com/Retrieval-Infused-Reasoning-Sandbox/Retrieval-Infused-Reasoning-Sandbox",
      "upvotes": 19,
      "fetched_at": "2026-02-19T05:42:28.931788+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2601.21296",
      "title": "Grounding and Enhancing Informativeness and Utility in Dataset Distillation",
      "authors": [
        "Shaobo Wang",
        "Yantai Yang",
        "Guo Chen",
        "Peiru Li",
        "Kaixin Li",
        "Yufa Zhou",
        "Zhaorun Chen",
        "Linfeng Zhang"
      ],
      "abstract": "Dataset distillation method that balances informativeness and utility through game-theoretic and gradient-based optimization techniques, achieving improved performance on ImageNet-1K. Dataset Distillation (DD) seeks to create a compact dataset from a large, real-world dataset. While recent methods often rely on heuristic approaches to balance efficiency and quality, the fundamental relationship between original and synthetic data remains underexplored. This paper revisits knowledge distillation -based dataset distillation within a solid theoretical framework. We introduce the concepts of Informativeness and Utility , capturing crucial information within a sample and essential samples in the training set, respectively. Building on these principles, we define optimal dataset distillation mathematically. We then present InfoUtil, a framework that balances informativeness and utility in synthesizing the distilled dataset. InfoUtil incorporates two key components: (1) game-theoretic informativeness maximization using Shapley Value attribution to extract key information from samples, and (2) principled utility maximization by selecting globally influential samples based on Gradient Norm . These components ensure that the distilled dataset is both informative and utility -optimized. Experiments demonstrate that our method achieves a 6.1\\% performance improvement over the previous state-of-the-art approach on ImageNet-1K dataset using ResNet-18.",
      "summary_en": "Dataset distillation method that balances informativeness and utility through game-theoretic and gradient-based optimization techniques, achieving improved performance on ImageNet-1K.",
      "summary_zh": "通过博弈论和基于梯度的优化技术平衡信息量与效用的数据集蒸馏方法，在ImageNet-1K上取得性能提升。",
      "hf_url": "https://huggingface.co/papers/2601.21296",
      "arxiv_url": "https://arxiv.org/abs/2601.21296",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.21296",
      "github_url": "",
      "upvotes": 19,
      "fetched_at": "2026-02-19T05:42:27.594541+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05115",
      "title": "SocialVeil: Probing Social Intelligence of Language Agents under Communication Barriers",
      "authors": [
        "Keyang Xuan",
        "Pengda Wang",
        "Chongrui Ye",
        "Haofei Yu",
        "Tal August",
        "Jiaxuan You"
      ],
      "abstract": "SocialVeil presents a social learning environment that simulates communication barriers in LLM interactions, demonstrating significant performance degradation under realistic conditions and limited effectiveness of adaptation strategies. Large language models (LLMs) are increasingly evaluated in interactive environments to test their social intelligence . However, existing benchmarks often assume idealized communication between agents, limiting our ability to diagnose whether LLMs can maintain and repair interactions in more realistic, imperfect settings. To close this gap, we present SocialVeil, a social learning environment that can simulate social interaction under cognitive-difference-induced communication barriers . Grounded in a systematic literature review of communication challenges in human interaction, SocialVeil introduces three representative types of such disruption, semantic vagueness , sociocultural mismatch , and emotional interference . We also introduce two barrier-aware evaluation metrics, unresolved confusion and mutual understanding , to evaluate interaction quality under impaired communication. Experiments across 720 scenarios and four frontier LLMs show that barriers consistently impair performance, with mutual understanding reduced by over 45\\% on average, and confusion elevated by nearly 50\\%. Human evaluations validate the fidelity of these simulated barriers (ICCapprox0.78, Pearson rapprox0.80). We further demonstrate that adaptation strategies ( Repair Instruction and Interactive learning ) only have a modest effect far from barrier-free performance. This work takes a step toward bringing social interaction environments closer to real-world communication, opening opportunities for exploring the social intelligence of LLM agents.",
      "summary_en": "SocialVeil presents a social learning environment that simulates communication barriers in LLM interactions, demonstrating significant performance degradation under realistic conditions and limited effectiveness of adaptation strategies.",
      "summary_zh": "SocialVeil 构建了一个模拟 LLM 交互中通信障碍的社交学习环境，表明在现实条件下性能显著下降，且适应策略的有效性有限。",
      "hf_url": "https://huggingface.co/papers/2602.05115",
      "arxiv_url": "https://arxiv.org/abs/2602.05115",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05115",
      "github_url": "",
      "upvotes": 18,
      "fetched_at": "2026-02-19T05:42:59.481809+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04210",
      "title": "Steering LLMs via Scalable Interactive Oversight",
      "authors": [
        "Enyu Zhou",
        "Zhiheng Xi",
        "Long Ma",
        "Zhihao Zhang",
        "Shihan Dou",
        "Zhikai Lei",
        "Guoteng Wang",
        "Rui Zheng",
        "Hang Yan",
        "Tao Gui",
        "Qi Zhang",
        "Xuanjing Huang"
      ],
      "abstract": "Scalable Interactive Oversight framework decomposes complex tasks into manageable decision trees to enhance human supervision and alignment in AI systems. As Large Language Models increasingly automate complex, long-horizon tasks such as vibe coding , a supervision gap has emerged. While models excel at execution, users often struggle to guide them effectively due to insufficient domain expertise, the difficulty of articulating precise intent, and the inability to reliably validate complex outputs. It presents a critical challenge in scalable oversight : enabling humans to responsibly steer AI systems on tasks that surpass their own ability to specify or verify. To tackle this, we propose Scalable Interactive Oversight , a framework that decomposes complex intent into a recursive tree of manageable decisions to amplify human supervision. Rather than relying on open-ended prompting, our system elicits low-burden feedback at each node and recursively aggregates these signals into precise global guidance. Validated in web development task, our framework enables non-experts to produce expert-level Product Requirement Documents, achieving a 54\\% improvement in alignment . Crucially, we demonstrate that this framework can be optimized via Reinforcement Learning using only online user feedback , offering a practical pathway for maintaining human control as AI scales.",
      "summary_en": "Scalable Interactive Oversight framework decomposes complex tasks into manageable decision trees to enhance human supervision and alignment in AI systems.",
      "summary_zh": "可扩展交互式监督框架将复杂任务分解为可管理的决策树，以增强AI系统中的人类监督和对齐。",
      "hf_url": "https://huggingface.co/papers/2602.04210",
      "arxiv_url": "https://arxiv.org/abs/2602.04210",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04210",
      "github_url": "",
      "upvotes": 18,
      "fetched_at": "2026-02-19T05:42:46.572486+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.02393",
      "title": "Infinite-World: Scaling Interactive World Models to 1000-Frame Horizons via Pose-Free Hierarchical Memory",
      "authors": [
        "Ruiqi Wu",
        "Xuanhua He",
        "Meng Cheng",
        "Tianyu Yang",
        "Yong Zhang",
        "Zhuoliang Kang",
        "Xunliang Cai",
        "Xiaoming Wei",
        "Chunle Guo",
        "Chongyi Li",
        "Ming-Ming Cheng"
      ],
      "abstract": "Infinite-World is a robust interactive world model that maintains coherent visual memory over 1000+ frames through hierarchical pose-free memory compression, uncertainty-aware action labeling, and revisit-dense fine-tuning strategies. We propose Infinite-World, a robust interactive world model capable of maintaining coherent visual memory over 1000+ frames in complex real-world environments. While existing world model s can be efficiently optimized on synthetic data with perfect ground-truth, they lack an effective training paradigm for real-world videos due to noisy pose estimations and the scarcity of viewpoint revisits. To bridge this gap, we first introduce a Hierarchical Pose-free Memory Compressor (HPMC) that recursively distills historical latents into a fixed-budget representation. By jointly optimizing the compressor with the generative backbone , HPMC enables the model to autonomously anchor generations in the distant past with bounded computational cost, eliminating the need for explicit geometric priors. Second, we propose an Uncertainty-aware Action Labeling module that discretizes continuous motion into a tri-state logic . This strategy maximizes the utilization of raw video data while shielding the deterministic action space from being corrupted by noisy trajectories, ensuring robust action-response learning. Furthermore, guided by insights from a pilot toy study, we employ a Revisit-Dense Finetuning Strategy using a compact, 30-minute dataset to efficiently activate the model's long-range loop-closure capabilities . Extensive experiments, including objective metrics and user studies, demonstrate that Infinite-World achieves superior performance in visual quality, action controllability, and spatial consistency.",
      "summary_en": "Infinite-World is a robust interactive world model that maintains coherent visual memory over 1000+ frames through hierarchical pose-free memory compression, uncertainty-aware action labeling, and revisit-dense fine-tuning strategies.",
      "summary_zh": "Infinite-World是一种鲁棒的交互式世界模型，通过分层无姿态记忆压缩、不确定性感知动作标注和重访密集微调策略，在1000+帧上保持连贯的视觉记忆。",
      "hf_url": "https://huggingface.co/papers/2602.02393",
      "arxiv_url": "https://arxiv.org/abs/2602.02393",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02393",
      "github_url": "https://github.com/MeiGen-AI/Infinite-World",
      "upvotes": 16,
      "fetched_at": "2026-02-19T05:42:40.305059+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2601.21037",
      "title": "Thinking in Frames: How Visual Context and Test-Time Scaling Empower Video Reasoning",
      "authors": [
        "Chengzu Li",
        "Zanyi Wang",
        "Jiaang Li",
        "Yi Xu",
        "Han Zhou",
        "Huanyu Zhang",
        "Ruichuan An",
        "Dengyang Jiang",
        "Zhaochong An",
        "Ivan Vulić",
        "Serge Belongie",
        "Anna Korhonen"
      ],
      "abstract": "Video generation models demonstrate robust zero-shot generalization for visual reasoning tasks through explicit visual context utilization and test-time scaling capabilities. Vision-Language Models have excelled at textual reasoning, but they often struggle with fine-grained spatial understanding and continuous action planning, failing to simulate the dynamics required for complex visual reasoning . In this work, we formulate visual reasoning by means of video generation models , positing that generated frames can act as intermediate reasoning steps between initial states and solutions. We evaluate their capacity in two distinct regimes: Maze Navigation for sequential discrete planning with low visual change and Tangram Puzzle for continuous manipulation with high visual change. Our experiments reveal three critical insights: (1) Robust Zero-Shot Generalization : In both tasks, the model demonstrates strong performance on unseen data distributions without specific finetuning. (2) Visual Context : The model effectively uses visual context as explicit control, such as agent icons and tangram shapes, enabling it to maintain high visual consistency and adapt its planning capability robustly to unseen patterns. (3) Visual Test-Time Scaling : We observe a test-time scaling law in sequential planning; increasing the generated video length (visual inference budget) empowers better zero-shot generalization to spatially and temporally complex paths. These findings suggest that video generation is not merely a media tool, but a scalable, generalizable paradigm for visual reasoning .",
      "summary_en": "Video generation models demonstrate robust zero-shot generalization for visual reasoning tasks through explicit visual context utilization and test-time scaling capabilities.",
      "summary_zh": "视频生成模型通过显式利用视觉上下文和测试时缩放能力，在视觉推理任务中展现出强大的零样本泛化能力。",
      "hf_url": "https://huggingface.co/papers/2601.21037",
      "arxiv_url": "https://arxiv.org/abs/2601.21037",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.21037",
      "github_url": "",
      "upvotes": 15,
      "fetched_at": "2026-02-19T05:42:26.025965+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.03036",
      "title": "LatentMem: Customizing Latent Memory for Multi-Agent Systems",
      "authors": [
        "Muxin Fu",
        "Guibin Zhang",
        "Xiangyuan Xue",
        "Yafu Li",
        "Zefeng He",
        "Siyuan Huang",
        "Xiaoye Qu",
        "Yu Cheng",
        "Yang Yang"
      ],
      "abstract": "LatentMem is a learnable multi-agent memory framework that customizes agent-specific memories through latent representations, improving performance in multi-agent systems without modifying underlying frameworks. Large language model (LLM)-powered multi-agent systems (MAS) demonstrate remarkable collective intelligence, wherein multi-agent memory serves as a pivotal mechanism for continual adaptation. However, existing multi-agent memory designs remain constrained by two fundamental bottlenecks: (i) memory homogenization arising from the absence of role-aware customization, and (ii) information overload induced by excessively fine-grained memory entries. To address these limitations, we propose LatentMem, a learnable multi-agent memory framework designed to customize agent-specific memories in a token-efficient manner. Specifically, LatentMem comprises an experience bank that stores raw interaction trajectories in a lightweight form, and a memory composer that synthesizes compact latent memories conditioned on retrieved experience and agent-specific contexts . Further, we introduce Latent Memory Policy Optimization (LMPO), which propagates task-level optimization signals through latent memories to the composer, encouraging it to produce compact and high-utility representations. Extensive experiments across diverse benchmarks and mainstream MAS frameworks show that LatentMem achieves a performance gain of up to 19.36% over vanilla settings and consistently outperforms existing memory architectures, without requiring any modifications to the underlying frameworks.",
      "summary_en": "LatentMem is a learnable multi-agent memory framework that customizes agent-specific memories through latent representations, improving performance in multi-agent systems without modifying underlying frameworks.",
      "summary_zh": "LatentMem是一种可学习的多智能体记忆框架，通过潜在表示定制特定于智能体的记忆，在无需修改底层框架的情况下提升多智能体系统的性能。",
      "hf_url": "https://huggingface.co/papers/2602.03036",
      "arxiv_url": "https://arxiv.org/abs/2602.03036",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03036",
      "github_url": "https://github.com/KANABOON1/LatentMem",
      "upvotes": 14,
      "fetched_at": "2026-02-19T05:42:43.156527+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05975",
      "title": "SAGE: Benchmarking and Improving Retrieval for Deep Research Agents",
      "authors": [
        "Tiansheng Hu",
        "Yilun Zhao",
        "Canyu Zhang",
        "Arman Cohan",
        "Chen Zhao"
      ],
      "abstract": "LLM-based retrievers show limited effectiveness in deep research agent workflows, with traditional BM25 performing better, though corpus-level test-time scaling can improve retrieval performance. Deep research agents have emerged as powerful systems for addressing complex queries. Meanwhile, LLM-based retrievers have demonstrated strong capability in following instructions or reasoning. This raises a critical question: can LLM-based retrievers effectively contribute to deep research agent workflows? To investigate this, we introduce SAGE, a benchmark for scientific literature retrieval comprising 1,200 queries across four scientific domains, with a 200,000 paper retrieval corpus.We evaluate six deep research agents and find that all systems struggle with reasoning-intensive retrieval. Using DR Tulu as backbone, we further compare BM25 and LLM-based retrievers (i.e., ReasonIR and gte-Qwen2-7B-instruct ) as alternative search tools. Surprisingly, BM25 significantly outperforms LLM-based retrievers by approximately 30%, as existing agents generate keyword-oriented sub-queries. To improve performance, we propose a corpus-level test-time scaling framework that uses LLMs to augment documents with metadata and keywords, making retrieval easier for off-the-shelf retrievers. This yields 8% and 2% gains on short-form and open-ended questions, respectively.",
      "summary_en": "LLM-based retrievers show limited effectiveness in deep research agent workflows, with traditional BM25 performing better, though corpus-level test-time scaling can improve retrieval performance.",
      "summary_zh": "基于LLM的检索器在深度研究智能体工作流中效果有限，传统BM25表现更优，而语料库级测试时扩展可改善检索性能。",
      "hf_url": "https://huggingface.co/papers/2602.05975",
      "arxiv_url": "https://arxiv.org/abs/2602.05975",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05975",
      "github_url": "",
      "upvotes": 12,
      "fetched_at": "2026-02-19T05:43:22.868202+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05547",
      "title": "Multi-Task GRPO: Reliable LLM Reasoning Across Tasks",
      "authors": [
        "Shyam Sundhar Ramesh",
        "Xiaotong Ji",
        "Matthieu Zimmer",
        "Sangwoong Yoon",
        "Zhiyong Wang",
        "Haitham Bou Ammar",
        "Aurelien Lucchi",
        "Ilija Bogunovic"
      ],
      "abstract": "Multi-Task GRPO algorithm improves balanced performance across diverse reasoning tasks by dynamically adapting task weights and using a ratio-preserving sampler to ensure equitable optimization. RL-based post-training with GRPO is widely used to improve large language models on individual reasoning tasks. However, real-world deployment requires reliable performance across diverse tasks. A straightforward multi-task adaptation of GRPO often leads to imbalanced outcomes, with some tasks dominating optimization while others stagnate. Moreover, tasks can vary widely in how frequently prompts yield zero advantages (and thus zero gradients), which further distorts their effective contribution to the optimization signal . To address these issues, we propose a novel Multi-Task GRPO (MT- GRPO ) algorithm that (i) dynamically adapts task weights to explicitly optimize worst-task performance and promote balanced progress across tasks, and (ii) introduces a ratio-preserving sampler to ensure task-wise policy gradients reflect the adapted weights. Experiments on both 3-task and 9-task settings show that MT- GRPO consistently outperforms baselines in worst-task accuracy. In particular, MT- GRPO achieves 16-28% and 6% absolute improvement on worst-task performance over standard GRPO and DAPO, respectively, while maintaining competitive average accuracy. Moreover, MT- GRPO requires 50% fewer training steps to reach 50% worst-task accuracy in the 3-task setting, demonstrating substantially improved efficiency in achieving reliable performance across tasks.",
      "summary_en": "Multi-Task GRPO algorithm improves balanced performance across diverse reasoning tasks by dynamically adapting task weights and using a ratio-preserving sampler to ensure equitable optimization.",
      "summary_zh": "多任务GRPO算法通过动态调整任务权重并使用比例保持采样器确保公平优化，从而在各类推理任务中提升均衡性能。",
      "hf_url": "https://huggingface.co/papers/2602.05547",
      "arxiv_url": "https://arxiv.org/abs/2602.05547",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05547",
      "github_url": "",
      "upvotes": 12,
      "fetched_at": "2026-02-19T05:43:12.216963+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.02016",
      "title": "DASH: Faster Shampoo via Batched Block Preconditioning and Efficient Inverse-Root Solvers",
      "authors": [
        "Ionut-Vlad Modoranu",
        "Philip Zmushko",
        "Erik Schultheis",
        "Mher Safaryan",
        "Dan Alistarh"
      ],
      "abstract": "Distributed Accelerated SHampoo (DASH) improves upon Shampoo optimization through efficient 3D tensor operations and faster inverse matrix root computations, achieving faster convergence and better performance. Shampoo is one of the leading approximate second-order optimizers : a variant of it has won the MLCommons AlgoPerf competition, and it has been shown to produce models with lower activation outliers that are easier to compress. Yet, applying Shampoo currently comes at the cost of significant computational slowdown, due to its expensive internal operations. In this paper, we take a significant step to address this shortcoming by proposing \\method (for Distributed Accelerated SHampoo ), a faster implementation of Distributed Shampoo based on two main new techniques: First, we show that preconditioner blocks can be stacked into 3D tensors to significantly improve GPU utilization ; second, we introduce the Newton-DB iteration and the Chebyshev polynomial approximations as novel and faster approaches for computing the inverse matrix roots required by Shampoo . Along with these algorithmic contributions, we provide a first in-depth analysis of how matrix scaling critically affects Shampoo convergence. On the practical side, our GPU-aware implementation achieves up to 4.83times faster optimizer steps compared to the well-optimized Distributed Shampoo , while Newton-DB attains the lowest validation perplexity per iteration among all tested methods. Our code is available at https://github.com/IST-DASLab/DASH.",
      "summary_en": "Distributed Accelerated SHampoo (DASH) improves upon Shampoo optimization through efficient 3D tensor operations and faster inverse matrix root computations, achieving faster convergence and better performance.",
      "summary_zh": "分布式加速 SHampoo（DASH）通过高效的三维张量运算和更快的逆矩阵根计算改进了 Shampoo 优化，实现了更快的收敛和更好的性能。",
      "hf_url": "https://huggingface.co/papers/2602.02016",
      "arxiv_url": "https://arxiv.org/abs/2602.02016",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02016",
      "github_url": "https://github.com/IST-DASLab/DASH",
      "upvotes": 12,
      "fetched_at": "2026-02-19T05:42:37.572468+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05073",
      "title": "Towards Reducible Uncertainty Modeling for Reliable Large Language Model Agents",
      "authors": [
        "Changdae Oh",
        "Seongheon Park",
        "To Eun Kim",
        "Jiatong Li",
        "Wendi Li",
        "Samuel Yeh",
        "Xuefeng Du",
        "Hamed Hassani",
        "Paul Bogdan",
        "Dawn Song",
        "Sharon Li"
      ],
      "abstract": "Large language models require uncertainty quantification frameworks that account for interactive agent behavior rather than traditional single-turn question answering scenarios. Uncertainty quantification (UQ) for large language models (LLMs) is a key building block for safety guardrails of daily LLM applications. Yet, even as LLM agents are increasingly deployed in highly complex tasks, most UQ research still centers on single-turn question-answering. We argue that UQ research must shift to realistic settings with interactive agents , and that a new principled framework for agent UQ is needed. This paper presents the first general formulation of agent UQ that subsumes broad classes of existing UQ setups. Under this formulation, we show that prior works implicitly treat LLM UQ as an uncertainty accumulation process , a viewpoint that breaks down for interactive agents in an open world . In contrast, we propose a novel perspective, a conditional uncertainty reduction process , that explicitly models reducible uncertainty over an agent's trajectory by highlighting \"interactivity\" of actions. From this perspective, we outline a conceptual framework to provide actionable guidance for designing UQ in LLM agent setups. Finally, we conclude with practical implications of the agent UQ in frontier LLM development and domain-specific applications, as well as open remaining problems.",
      "summary_en": "Large language models require uncertainty quantification frameworks that account for interactive agent behavior rather than traditional single-turn question answering scenarios.",
      "summary_zh": "大语言模型需要面向交互式智能体行为而非传统单轮问答场景的不确定性量化框架。",
      "hf_url": "https://huggingface.co/papers/2602.05073",
      "arxiv_url": "https://arxiv.org/abs/2602.05073",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05073",
      "github_url": "",
      "upvotes": 11,
      "fetched_at": "2026-02-19T05:42:58.135629+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06040",
      "title": "SwimBird: Eliciting Switchable Reasoning Mode in Hybrid Autoregressive MLLMs",
      "authors": [
        "Jintao Tong",
        "Shilin Yan",
        "Hongwei Xue",
        "Xiaojun Tang",
        "Kunyu Shi",
        "Guannan Zhang",
        "Ruixuan Li",
        "Yixiong Zou"
      ],
      "abstract": "SwimBird is a reasoning-switchable multimodal large language model that dynamically selects between text-only, vision-only, and interleaved vision-text reasoning modes based on input queries, achieving superior performance on both textual and visual tasks. Multimodal Large Language Models (MLLMs) have made remarkable progress in multimodal perception and reasoning by bridging vision and language. However, most existing MLLMs perform reasoning primarily with textual CoT, which limits their effectiveness on vision-intensive tasks. Recent approaches inject a fixed number of continuous hidden states as \" visual thoughts \" into the reasoning process and improve visual performance, but often at the cost of degraded text-based logical reasoning. We argue that the core limitation lies in a rigid, pre-defined reasoning pattern that cannot adaptively choose the most suitable thinking modality for different user queries. We introduce SwimBird, a reasoning-switchable MLLM that dynamically switches among three reasoning modes conditioned on the input: (1) text-only reasoning, (2) vision-only reasoning ( continuous hidden states as visual thoughts ), and (3) interleaved vision-text reasoning. To enable this capability, we adopt a hybrid autoregressive formulation that unifies next-token prediction for textual thoughts with next-embedding prediction for visual thoughts , and design a systematic reasoning-mode curation strategy to construct SwimBird-SFT-92K, a diverse supervised fine-tuning dataset covering all three reasoning patterns. By enabling flexible, query-adaptive mode selection , SwimBird preserves strong textual logic while substantially improving performance on vision-dense tasks . Experiments across diverse benchmarks covering textual reasoning and challenging visual understanding demonstrate that SwimBird achieves state-of-the-art results and robust gains over prior fixed-pattern multimodal reasoning methods.",
      "summary_en": "SwimBird is a reasoning-switchable multimodal large language model that dynamically selects between text-only, vision-only, and interleaved vision-text reasoning modes based on input queries, achieving superior performance on both textual and visual tasks.",
      "summary_zh": "SwimBird是一种推理可切换的多模态大语言模型，可根据输入查询动态选择纯文本、纯视觉或交错的视觉-文本推理模式，在文本和视觉任务上均取得更优性能。",
      "hf_url": "https://huggingface.co/papers/2602.06040",
      "arxiv_url": "https://arxiv.org/abs/2602.06040",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06040",
      "github_url": "https://github.com/Accio-Lab/SwimBird",
      "upvotes": 10,
      "fetched_at": "2026-02-19T05:43:33.074834+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05857",
      "title": "BABE: Biology Arena BEnchmark",
      "authors": [
        "Junting Zhou",
        "Jin Chen",
        "Linfeng Hao",
        "Denghui Cao",
        "Zheyu Wang",
        "Qiguang Chen",
        "Chaoyou Fu",
        "Jiaze Chen",
        "Yuchen Wu",
        "Ge Zhang",
        "Mingxuan Wang",
        "Wenhao Huang",
        "Tong Yang"
      ],
      "abstract": "BABE is a biology-focused benchmark designed to evaluate AI systems' ability to perform experimental reasoning and causal inference similar to practicing scientists.",
      "summary_en": "BABE is a biology-focused benchmark designed to evaluate AI systems' ability to perform experimental reasoning and causal inference similar to practicing scientists.",
      "summary_zh": "BABE是一个聚焦生物学的基准测试，旨在评估AI系统执行实验推理和因果推断的能力，类似于实践科学家。",
      "hf_url": "https://huggingface.co/papers/2602.05857",
      "arxiv_url": "https://arxiv.org/abs/2602.05857",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05857",
      "github_url": "",
      "upvotes": 10,
      "fetched_at": "2026-02-19T05:43:16.426015+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06034",
      "title": "V-Retrver: Evidence-Driven Agentic Reasoning for Universal Multimodal Retrieval",
      "authors": [
        "Dongyang Chen",
        "Chaoyang Wang",
        "Dezhao SU",
        "Xi Xiao",
        "Zeyu Zhang",
        "Jing Xiong",
        "Qing Li",
        "Yuzhang Shang",
        "Shichao Ka"
      ],
      "abstract": "V-Retrver introduces an evidence-driven retrieval framework that enables multimodal large language models to actively verify visual evidence through an agentic reasoning process, improving retrieval accuracy and reasoning reliability. Multimodal Large Language Models (MLLMs) have recently been applied to universal multimodal retrieval , where Chain-of-Thought (CoT) reasoning improves candidate reranking. However, existing approaches remain largely language-driven, relying on static visual encodings and lacking the ability to actively verify fine-grained visual evidence, which often leads to speculative reasoning in visually ambiguous cases. We propose V-Retrver, an evidence-driven retrieval framework that reformulates multimodal retrieval as an agentic reasoning process grounded in visual inspection . V-Retrver enables an MLLM to selectively acquire visual evidence during reasoning via external visual tools, performing a multimodal interleaved reasoning process that alternates between hypothesis generation and targeted visual verification.To train such an evidence-gathering retrieval agent, we adopt a curriculum-based learning strategy combining supervised reasoning activation , rejection-based refinement , and reinforcement learning with an evidence-aligned objective . Experiments across multiple multimodal retrieval benchmarks demonstrate consistent improvements in retrieval accuracy (with 23.0% improvements on average), perception-driven reasoning reliability, and generalization.",
      "summary_en": "V-Retrver introduces an evidence-driven retrieval framework that enables multimodal large language models to actively verify visual evidence through an agentic reasoning process, improving retrieval accuracy and reasoning reliability.",
      "summary_zh": "V-Retrver 提出了一种证据驱动的检索框架，使多模态大语言模型能够通过智能体推理过程主动验证视觉证据，从而提升检索准确率与推理可靠性。",
      "hf_url": "https://huggingface.co/papers/2602.06034",
      "arxiv_url": "https://arxiv.org/abs/2602.06034",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06034",
      "github_url": "https://github.com/chendy25/V-Retrver",
      "upvotes": 8,
      "fetched_at": "2026-02-19T05:43:28.657573+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05393",
      "title": "Late-to-Early Training: LET LLMs Learn Earlier, So Faster and Better",
      "authors": [
        "Ji Zhao",
        "Yufei Gu",
        "Shitong Shao",
        "Xun Zhou",
        "Liang Xiang",
        "Zeke Xie"
      ],
      "abstract": "Large language models can be trained more efficiently by transferring knowledge from later training phases to earlier layers during initial training, achieving faster convergence and improved performance. As Large Language Models (LLMs) achieve remarkable empirical success through scaling model and data size, pretraining has become increasingly critical yet computationally prohibitive, hindering rapid development. Despite the availability of numerous pretrained LLMs developed at significant computational expense, a fundamental real-world question remains underexplored: Can we leverage existing small pretrained models to accelerate the training of larger models? In this paper, we propose a Late-to-Early Training (LET) paradigm that enables LLMs to explicitly learn later knowledge in earlier steps and earlier layers. The core idea is to guide the early layers of an LLM during early training using representations from the late layers of a pretrained (i.e. late training phase) model. We identify two key mechanisms that drive LET's effectiveness: late-to-early-step learning and late-to-early-layer learning . These mechanisms significantly accelerate training convergence while robustly enhancing both language modeling capabilities and downstream task performance , enabling faster training with superior performance. Extensive experiments on 1.4B and 7B parameter models demonstrate LET's efficiency and effectiveness. Notably, when training a 1.4B LLM on the Pile dataset, our method achieves up to 1.6times speedup with nearly 5\\% improvement in downstream task accuracy compared to standard training, even when using a pretrained model with 10times fewer parameters than the target model.",
      "summary_en": "Large language models can be trained more efficiently by transferring knowledge from later training phases to earlier layers during initial training, achieving faster convergence and improved performance.",
      "summary_zh": "大型语言模型可通过在初始训练期间将后期训练阶段的知识迁移至早期层，实现更高效训练、更快收敛和性能提升。",
      "hf_url": "https://huggingface.co/papers/2602.05393",
      "arxiv_url": "https://arxiv.org/abs/2602.05393",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05393",
      "github_url": "",
      "upvotes": 7,
      "fetched_at": "2026-02-19T05:43:09.387016+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05258",
      "title": "CoPE: Clipped RoPE as A Scalable Free Lunch for Long Context LLMs",
      "authors": [
        "Haoran Li",
        "Sucheng Ren",
        "Alan Yuille",
        "Feng Wang"
      ],
      "abstract": "CoPE introduces a soft clipping method for Rotary Positional Embedding that unifies out-of-distribution mitigation and semantic modeling while enabling effective long-context processing up to 256k length. Rotary Positional Embedding (RoPE) is a key component of context scaling in Large Language Models (LLMs). While various methods have been proposed to adapt RoPE to longer contexts, their guiding principles generally fall into two categories: (1) out-of-distribution (OOD) mitigation, which scales RoPE frequencies to accommodate unseen positions, and (2) Semantic Modeling , which posits that the attention scores computed with RoPE should always prioritize semantically similar tokens. In this work, we unify these seemingly distinct objectives through a minimalist intervention, namely CoPE: soft clipping lowfrequency components of RoPE. CoPE not only eliminates OOD outliers and refines semantic signals, but also prevents spectral leakage caused by hard clipping. Extensive experiments demonstrate that simply applying our soft clipping strategy to RoPE yields significant performance gains that scale up to 256k context length, validating our theoretical analysis and establishing CoPE as a new state-of-the-art for length generalization . Our code, data, and models are available at https://github.com/hrlics/CoPE.",
      "summary_en": "CoPE introduces a soft clipping method for Rotary Positional Embedding that unifies out-of-distribution mitigation and semantic modeling while enabling effective long-context processing up to 256k length.",
      "summary_zh": "CoPE为旋转位置编码引入了一种软裁剪方法，统一了分布外缓解与语义建模，同时支持长达256k的有效长上下文处理。",
      "hf_url": "https://huggingface.co/papers/2602.05258",
      "arxiv_url": "https://arxiv.org/abs/2602.05258",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05258",
      "github_url": "https://github.com/hrlics/CoPE",
      "upvotes": 7,
      "fetched_at": "2026-02-19T05:43:02.367263+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04998",
      "title": "Learning Rate Matters: Vanilla LoRA May Suffice for LLM Fine-tuning",
      "authors": [
        "Yu-Ang Lee",
        "Ching-Yun Ko",
        "Pin-Yu Chen",
        "Mi-Yen Yeh"
      ],
      "abstract": "Systematic evaluation of LoRA variants reveals that proper hyperparameter tuning eliminates performance differences between methods, with vanilla LoRA remaining competitive. Low-Rank Adaptation (LoRA) is the prevailing approach for efficient large language model (LLM) fine-tuning . Building on this paradigm, recent studies have proposed alternative initialization strategies and architectural modifications, reporting substantial improvements over vanilla LoRA. However, these gains are often demonstrated under fixed or narrowly tuned hyperparameter settings, despite the known sensitivity of neural networks to training configurations. In this work, we systematically re-evaluate four representative LoRA variants alongside vanilla LoRA through extensive hyperparameter search es. Across mathematical and code generation tasks on diverse model scales, we find that different LoRA methods favor distinct learning rate ranges. Crucially, once learning rate s are properly tuned, all methods achieve similar peak performance (within 1-2%), with only subtle rank-dependent behaviors. These results suggest that vanilla LoRA remains a competitive baseline and that improvements reported under single training configuration may not reflect consistent methodological advantages. Finally, a second-order analysis attributes the differing optimal learning rate ranges to variations in the largest Hessian eigenvalue , aligning with classical learning theories.",
      "summary_en": "Systematic evaluation of LoRA variants reveals that proper hyperparameter tuning eliminates performance differences between methods, with vanilla LoRA remaining competitive.",
      "summary_zh": "对 LoRA 变体的系统性评估表明，适当的超参数调优可消除不同方法间的性能差异，原始 LoRA 仍具竞争力。",
      "hf_url": "https://huggingface.co/papers/2602.04998",
      "arxiv_url": "https://arxiv.org/abs/2602.04998",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04998",
      "github_url": "",
      "upvotes": 6,
      "fetched_at": "2026-02-19T05:42:55.360278+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05933",
      "title": "Approximation of Log-Partition Function in Policy Mirror Descent Induces Implicit Regularization for LLM Post-Training",
      "authors": [
        "Zhenghao Xu",
        "Qin Lu",
        "Changlong Yu",
        "Tuo Zhao"
      ],
      "abstract": "Policy mirror descent with mean approximation addresses challenges in training large language models by using adaptive regularization for more stable and efficient reinforcement learning. Policy mirror descent (PMD) provides a principled framework for reinforcement learning (RL) by iteratively solving KL-regularized policy improvement subproblems. While this approach has been adopted in training advanced LLMs such as Kimi K1.5/K2, the ideal closed-form PMD updates require reliable partition function estimation, a significant challenge when working with limited rollouts in the vast action spaces of LLMs. We investigate a practical algorithm, termed PMD-mean, that approximates the log-partition term with the mean reward under the sampling policy and performs regression in log-policy space . Specifically, we characterize the population solution of PMD-mean and demonstrate that it implicitly optimizes mirror descent subproblems with an adaptive mixed KL--χ^2 regularizer. This additional χ^2 regularization constrains large probability changes, producing more conservative updates when expected rewards are low and enhancing robustness against finite-sample estimation errors . Experiments on math reasoning tasks show that PMD-mean achieves superior performance with improved stability and time efficiency. These findings deepen our understanding of PMD-mean and illuminate pathways toward principled improvements in RL algorithms for LLMs. Code is available at https://github.com/horizon-rl/OpenKimi.",
      "summary_en": "Policy mirror descent with mean approximation addresses challenges in training large language models by using adaptive regularization for more stable and efficient reinforcement learning.",
      "summary_zh": "基于均值近似的策略镜像下降通过自适应正则化解决大语言模型训练中的挑战，实现更稳定、高效的强化学习。",
      "hf_url": "https://huggingface.co/papers/2602.05933",
      "arxiv_url": "https://arxiv.org/abs/2602.05933",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05933",
      "github_url": "https://github.com/horizon-rl/OpenKimi",
      "upvotes": 5,
      "fetched_at": "2026-02-19T05:43:21.201875+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04220",
      "title": "Adaptive 1D Video Diffusion Autoencoder",
      "authors": [
        "Yao Teng",
        "Minxuan Lin",
        "Xian Liu",
        "Shuai Wang",
        "Xiao Yang",
        "Xihui Liu"
      ],
      "abstract": "A transformer-based video autoencoder with adaptive 1D encoding and diffusion-based decoding addresses limitations of fixed-rate compression and deterministic reconstruction in video compression. Recent video generation models largely rely on video autoencoders that compress pixel-space videos into latent representations . However, existing video autoencoders suffer from three major limitations: (1) fixed-rate compression that wastes tokens on simple videos, (2) inflexible CNN architectures that prevent variable-length latent modeling, and (3) deterministic decoders that struggle to recover appropriate details from compressed latents. To address these issues, we propose One-Dimensional Diffusion Video Autoencoder (One-DVA), a transformer-based framework for adaptive 1D encoding and diffusion-based decoding. The encoder employs query-based vision transformers to extract spatiotemporal features and produce latent representations , while a variable-length dropout mechanism dynamically adjusts the latent length. The decoder is a pixel-space diffusion transformer that reconstructs videos with the latents as input conditions. With a two-stage training strategy, One-DVA achieves performance comparable to 3D-CNN VAEs on reconstruction metrics at identical compression ratios . More importantly, it supports adaptive compression and thus can achieve higher compression ratios . To better support downstream latent generation, we further regularize the One-DVA latent distribution for generative modeling and fine-tune its decoder to mitigate artifacts caused by the generation process.",
      "summary_en": "A transformer-based video autoencoder with adaptive 1D encoding and diffusion-based decoding addresses limitations of fixed-rate compression and deterministic reconstruction in video compression.",
      "summary_zh": "基于Transformer的视频自编码器采用自适应1D编码和基于扩散的解码，解决了视频压缩中固定码率压缩和确定性重建的局限性。",
      "hf_url": "https://huggingface.co/papers/2602.04220",
      "arxiv_url": "https://arxiv.org/abs/2602.04220",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04220",
      "github_url": "",
      "upvotes": 4,
      "fetched_at": "2026-02-19T05:42:47.911253+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.01965",
      "title": "Breaking the Static Graph: Context-Aware Traversal for Robust Retrieval-Augmented Generation",
      "authors": [
        "Kwun Hang Lau",
        "Fangyuan Zhang",
        "Boyu Ruan",
        "Yingli Zhou",
        "Qintian Guo",
        "Ruiyuan Zhang",
        "Xiaofang Zhou"
      ],
      "abstract": "CatRAG addresses limitations in retrieval-augmented generation by introducing a query-adaptive framework that improves multi-hop reasoning through symbolic anchoring, dynamic edge weighting, and key-fact passage enhancement.",
      "summary_en": "CatRAG addresses limitations in retrieval-augmented generation by introducing a query-adaptive framework that improves multi-hop reasoning through symbolic anchoring, dynamic edge weighting, and key-fact passage enhancement.",
      "summary_zh": "CatRAG通过引入查询自适应框架解决了检索增强生成的局限性，该框架通过符号锚定、动态边权重和关键事实段落增强提升了多跳推理能力。",
      "hf_url": "https://huggingface.co/papers/2602.01965",
      "arxiv_url": "https://arxiv.org/abs/2602.01965",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01965",
      "github_url": "",
      "upvotes": 4,
      "fetched_at": "2026-02-19T05:42:36.155604+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05871",
      "title": "Pathwise Test-Time Correction for Autoregressive Long Video Generation",
      "authors": [
        "Xunzhi Xiang",
        "Zixuan Duan",
        "Guiyu Zhang",
        "Haiyu Zhang",
        "Zhe Gao",
        "Junta Wu",
        "Shaofeng Zhang",
        "Tengfei Wang",
        "Qi Fan",
        "Chunchao Guo"
      ],
      "abstract": "Test-Time Correction addresses error accumulation in distilled autoregressive diffusion models for long-video synthesis by using initial frames as reference anchors to calibrate stochastic states during sampling. Distilled autoregressive diffusion models facilitate real-time short video synthesis but suffer from severe error accumulation during long-sequence generation . While existing Test-Time Optimization (TTO) methods prove effective for images or short clips, we identify that they fail to mitigate drift in extended sequences due to unstable reward landscapes and the hypersensitivity of distilled parameters. To overcome these limitations, we introduce Test-Time Correction (TTC), a training-free alternative. Specifically, TTC utilizes the initial frame as a stable reference anchor to calibrate intermediate stochastic states along the sampling trajectory . Extensive experiments demonstrate that our method seamlessly integrates with various distilled models, extending generation lengths with negligible overhead while matching the quality of resource-intensive training-based methods on 30-second benchmarks.",
      "summary_en": "Test-Time Correction addresses error accumulation in distilled autoregressive diffusion models for long-video synthesis by using initial frames as reference anchors to calibrate stochastic states during sampling.",
      "summary_zh": "测试时校正通过使用初始帧作为参考锚点，在采样过程中校准随机状态，从而解决蒸馏自回归扩散模型在长视频合成中的误差累积问题。",
      "hf_url": "https://huggingface.co/papers/2602.05871",
      "arxiv_url": "https://arxiv.org/abs/2602.05871",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05871",
      "github_url": "",
      "upvotes": 3,
      "fetched_at": "2026-02-19T05:43:18.139859+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05551",
      "title": "FastVMT: Eliminating Redundancy in Video Motion Transfer",
      "authors": [
        "Yue Ma",
        "Zhikai Wang",
        "Tianhao Ren",
        "Mingzhe Zheng",
        "Hongyu Liu",
        "Jiayi Guo",
        "Mark Fong",
        "Yuxuan Xue",
        "Zixiang Zhao",
        "Konrad Schindler",
        "Qifeng Chen",
        "Linfeng Zhang"
      ],
      "abstract": "FastVMT accelerates video motion transfer by addressing computational redundancies in Diffusion Transformer architecture through localized attention masking and gradient reuse optimization. Video motion transfer aims to synthesize videos by generating visual content according to a text prompt while transferring the motion pattern observed in a reference video. Recent methods predominantly use the Diffusion Transformer (DiT) architecture. To achieve satisfactory runtime, several methods attempt to accelerate the computations in the DiT, but fail to address structural sources of inefficiency. In this work, we identify and remove two types of computational redundancy in earlier work: motion redundancy arises because the generic DiT architecture does not reflect the fact that frame-to-frame motion is small and smooth; gradient redundancy occurs if one ignores that gradients change slowly along the diffusion trajectory . To mitigate motion redundancy, we mask the corresponding attention layers to a local neighborhood such that interaction weights are not computed unnecessarily distant image regions. To exploit gradient redundancy, we design an optimization scheme that reuses gradients from previous diffusion steps and skips unwarranted gradient computations. On average, FastVMT achieves a 3.43x speedup without degrading the visual fidelity or the temporal consistency of the generated videos.",
      "summary_en": "FastVMT accelerates video motion transfer by addressing computational redundancies in Diffusion Transformer architecture through localized attention masking and gradient reuse optimization.",
      "summary_zh": "FastVMT通过局部注意力掩码和梯度复用优化解决Diffusion Transformer架构中的计算冗余，加速视频运动迁移。",
      "hf_url": "https://huggingface.co/papers/2602.05551",
      "arxiv_url": "https://arxiv.org/abs/2602.05551",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05551",
      "github_url": "",
      "upvotes": 3,
      "fetched_at": "2026-02-19T05:43:13.581813+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04789",
      "title": "Light Forcing: Accelerating Autoregressive Video Diffusion via Sparse Attention",
      "authors": [
        "Chengtao Lv",
        "Yumeng Shi",
        "Yushi Huang",
        "Ruihao Gong",
        "Shen Ren",
        "Wenya Wang"
      ],
      "abstract": "Light Forcing introduces a novel sparse attention mechanism for autoregressive video generation that improves efficiency while maintaining quality through chunk-aware growth and hierarchical sparse attention strategies. Advanced autoregressive (AR) video generation models have improved visual fidelity and interactivity, but the quadratic complexity of attention remains a primary bottleneck for efficient deployment. While existing sparse attention solutions have shown promise on bidirectional models, we identify that applying these solutions to AR models leads to considerable performance degradation for two reasons: isolated consideration of chunk generation and insufficient utilization of past informative context. Motivated by these observations, we propose Light Forcing, the first sparse attention solution tailored for AR video generation models. It incorporates a Chunk-Aware Growth mechanism to quantitatively estimate the contribution of each chunk, which determines their sparsity allocation. This progressive sparsity increase strategy enables the current chunk to inherit prior knowledge in earlier chunks during generation. Additionally, we introduce a Hierarchical Sparse Attention to capture informative historical and local context in a coarse-to-fine manner. Such two-level mask selection strategy (\\ie, frame and block level) can adaptively handle diverse attention patterns. Extensive experiments demonstrate that our method outperforms existing sparse attention in quality (\\eg, 84.5 on VBench) and efficiency (\\eg, 1.2{sim}1.3times end-to-end speedup). Combined with FP8 quantization and LightVAE , Light Forcing further achieves a 2.3times speedup and 19.7\\,FPS on an RTX~5090 GPU. Code will be released at https://github.com/chengtao-lv/LightForcing{https://github.com/chengtao-lv/LightForcing}.",
      "summary_en": "Light Forcing introduces a novel sparse attention mechanism for autoregressive video generation that improves efficiency while maintaining quality through chunk-aware growth and hierarchical sparse attention strategies.",
      "summary_zh": "Light Forcing 为自回归视频生成引入了一种新型稀疏注意力机制，通过块感知增长和分层稀疏注意力策略，在提高效率的同时保持质量。",
      "hf_url": "https://huggingface.co/papers/2602.04789",
      "arxiv_url": "https://arxiv.org/abs/2602.04789",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04789",
      "github_url": "https://github.com/chengtao-lv/LightForcing",
      "upvotes": 3,
      "fetched_at": "2026-02-19T05:42:50.834715+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.04683",
      "title": "UniAudio 2.0: A Unified Audio Language Model with Text-Aligned Factorized Audio Tokenization",
      "authors": [
        "Dongchao Yang",
        "Yuanyuan Wang",
        "Dading Chong",
        "Songxiang Liu",
        "Xixin Wu",
        "Helen Meng"
      ],
      "abstract": "Researchers developed a discrete audio codec called ReasoningCodec that separates audio into reasoning and reconstruction tokens for improved understanding and generation, and created UniAudio 2.0, a unified autoregressive model trained on large-scale text and audio data that shows strong performance across various audio tasks and generalizes well in few-shot and zero-shot scenarios. We study two foundational problems in audio language models: (1) how to design an audio tokenizer that can serve as an intermediate representation for both understanding and generation; and (2) how to build an audio foundation model that generalizes in few-shot and zero-shot settings, analogous to large language models. To this end, we make the following two contributions. First, we propose ReasoningCodec, a discrete audio codec that factorizes audio into (i) reasoning tokens , which encode text-aligned, high-level analysis and planning representations for audio understanding and hierarchical generation, and (ii) reconstruction tokens , which encode semantic-rich acoustic cues for high-fidelity waveform reconstruction. This design achieves understanding performance comparable to strong continuous representations while improving generation quality and reconstruction fidelity over prior discrete tokenizers. Second, we introduce a unified autoregressive architecture for text and audio, together with multi-stage training and multi-task data construction . Using this framework, we train UniAudio 2.0 on 100B text tokens and 60B audio tokens. Across a wide range of speech, sound, and music tasks, UniAudio 2.0 performs competitively on in-domain evaluations and demonstrates strong few-shot and zero-shot generalization to unseen tasks. Demo, code, and checkpoints will be available at https://dongchaoyang.top/UniAudio2Demo/{https://dongchaoyang.top/UniAudio2Demo/}.",
      "summary_en": "Researchers developed a discrete audio codec called ReasoningCodec that separates audio into reasoning and reconstruction tokens for improved understanding and generation, and created UniAudio 2.0, a unified autoregressive model trained on large-scale text and audio data that shows strong performance across various audio tasks and generalizes well in few-shot and zero-shot scenarios.",
      "summary_zh": "研究人员开发了一种名为ReasoningCodec的离散音频编解码器，将音频分离为推理token与重建token以提升理解与生成能力，并创建了UniAudio 2.0——一个基于大规模文本与音频数据训练的统一自回归模型，该模型在各类音频任务中表现优异，且在少样本和零样本场景中具有良好的泛化能力。",
      "hf_url": "https://huggingface.co/papers/2602.04683",
      "arxiv_url": "https://arxiv.org/abs/2602.04683",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.04683",
      "github_url": "https://github.com/yangdongchao/UniAudio2",
      "upvotes": 3,
      "fetched_at": "2026-02-19T05:42:49.385698+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2601.23174",
      "title": "Beyond Fixed Frames: Dynamic Character-Aligned Speech Tokenization",
      "authors": [
        "Luca Della Libera",
        "Cem Subakan",
        "Mirco Ravanelli"
      ],
      "abstract": "DyCAST is a dynamic speech tokenizer that uses soft character-level alignment and duration modeling to enable variable-frame-rate tokenization, improving speech resynthesis quality with fewer tokens than traditional fixed-frame-rate codecs. Neural audio codecs are at the core of modern conversational speech technologies , converting continuous speech into sequences of discrete tokens that can be processed by LLMs . However, existing codecs typically operate at fixed frame rates , allocating tokens uniformly in time and producing unnecessarily long sequences. In this work, we introduce DyCAST, a Dynamic Character-Aligned Speech Tokenizer that enables variable-frame-rate tokenization through soft character-level alignment and explicit duration modeling . DyCAST learns to associate tokens with character-level linguistic units during training and supports alignment-free inference with direct control over token durations at decoding time. To improve speech resynthesis quality at low frame rates, we further introduce a retrieval-augmented decoding mechanism that enhances reconstruction fidelity without increasing bitrate. Experiments show that DyCAST achieves competitive speech resynthesis quality and downstream performance while using significantly fewer tokens than fixed-frame-rate codecs. Code and checkpoints will be released publicly at https://github.com/lucadellalib/dycast.",
      "summary_en": "DyCAST is a dynamic speech tokenizer that uses soft character-level alignment and duration modeling to enable variable-frame-rate tokenization, improving speech resynthesis quality with fewer tokens than traditional fixed-frame-rate codecs.",
      "summary_zh": "DyCAST是一种动态语音tokenizer，利用软字符级对齐和时长建模实现可变帧率tokenization，以比传统固定帧率编解码器更少的token提升语音重合成质量。",
      "hf_url": "https://huggingface.co/papers/2601.23174",
      "arxiv_url": "https://arxiv.org/abs/2601.23174",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.23174",
      "github_url": "https://github.com/lucadellalib/dycast",
      "upvotes": 3,
      "fetched_at": "2026-02-19T05:42:33.074137+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05494",
      "title": "A Unified Framework for Rethinking Policy Divergence Measures in GRPO",
      "authors": [
        "Qingyuan Wu",
        "Yuhui Wang",
        "Simon Sinong Zhan",
        "Yanning Dai",
        "Shilong Deng",
        "Sarra Habchi",
        "Qi Zhu",
        "Matthias Gallé",
        "Chao Huang"
      ],
      "abstract": "A unified framework for reinforcement learning with verified reward is presented, characterized by policy divergence measures including likelihood ratios and KL divergences, with empirical validation showing improved training stability and performance through the KL3 estimator. Reinforcement Learning with Verified Reward (RLVR) has emerged as a critical paradigm for advancing the reasoning capabilities of Large Language Models (LLMs). Most existing RLVR methods, such as GRPO and its variants, ensure stable updates by constraining policy divergence through clipping likelihood ratios . This paper introduces a unified clipping framework that characterizes existing methods via a general notion of policy divergence , encompassing both likelihood ratios and Kullback-Leibler (KL) divergences and extending to alternative measures. The framework provides a principled foundation for systematically analyzing how different policy divergence measures affect exploration and performance. We further identify the KL3 estimator , a variance-reduced Monte Carlo estimator of the KL divergence, as a key policy divergence constraint. We theoretically demonstrate that the KL3-based constraint is mathematically equivalent to an asymmetric ratio-based clipping that reallocates probability mass toward high-confidence actions, promoting stronger exploration while retaining the simplicity of GRPO -style methods. Empirical results on mathematical reasoning benchmarks demonstrate that incorporating the KL3 estimator into GRPO improves both training stability and final performance , highlighting the importance of principled policy divergence constraints in policy optimization .",
      "summary_en": "A unified framework for reinforcement learning with verified reward is presented, characterized by policy divergence measures including likelihood ratios and KL divergences, with empirical validation showing improved training stability and performance through the KL3 estimator.",
      "summary_zh": "提出了一种用于带验证奖励的强化学习的统一框架，其特征为包含似然比和KL散度在内的策略散度度量，实证验证表明通过KL3估计器可提升训练稳定性和性能。",
      "hf_url": "https://huggingface.co/papers/2602.05494",
      "arxiv_url": "https://arxiv.org/abs/2602.05494",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05494",
      "github_url": "",
      "upvotes": 2,
      "fetched_at": "2026-02-19T05:43:10.746020+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05293",
      "title": "Fast-SAM3D: 3Dfy Anything in Images but Faster",
      "authors": [
        "Weilun Feng",
        "Mingqiang Wu",
        "Zhiliang Chen",
        "Chuanguang Yang",
        "Haotong Qin",
        "Yuqi Li",
        "Xiaokun Liu",
        "Guoxin Fan",
        "Zhulin An",
        "Libo Huang",
        "Yulun Zhang",
        "Michele Magno",
        "Yongjun Xu"
      ],
      "abstract": "Fast-SAM3D addresses slow inference in 3D reconstruction by dynamically adapting computation to varying complexity through heterogeneity-aware mechanisms that improve efficiency without sacrificing quality. SAM3D enables scalable, open-world 3D reconstruction from complex scenes, yet its deployment is hindered by prohibitive inference latency. In this work, we conduct the first systematic investigation into its inference dynamics, revealing that generic acceleration strategies are brittle in this context. We demonstrate that these failures stem from neglecting the pipeline's inherent multi-level heterogeneity : the kinematic distinctiveness between shape and layout, the intrinsic sparsity of texture refinement, and the spectral variance across geometries. To address this, we present Fast-SAM3D, a training-free framework that dynamically aligns computation with instantaneous generation complexity. Our approach integrates three heterogeneity -aware mechanisms: (1) Modality-Aware Step Caching to decouple structural evolution from sensitive layout updates; (2) Joint Spatiotemporal Token Carving to concentrate refinement on high-entropy regions; and (3) Spectral-Aware Token Aggregation to adapt decoding resolution. Extensive experiments demonstrate that Fast-SAM3D delivers up to 2.67times end-to-end speedup with negligible fidelity loss, establishing a new Pareto frontier for efficient single-view 3D generation . Our code is released in https://github.com/wlfeng0509/Fast-SAM3D.",
      "summary_en": "Fast-SAM3D addresses slow inference in 3D reconstruction by dynamically adapting computation to varying complexity through heterogeneity-aware mechanisms that improve efficiency without sacrificing quality.",
      "summary_zh": "Fast-SAM3D通过异构感知机制动态调整计算以适应不同复杂度，解决三维重建中的推理缓慢问题，在不牺牲质量的前提下提升效率。",
      "hf_url": "https://huggingface.co/papers/2602.05293",
      "arxiv_url": "https://arxiv.org/abs/2602.05293",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05293",
      "github_url": "https://github.com/wlfeng0509/Fast-SAM3D",
      "upvotes": 2,
      "fetched_at": "2026-02-19T05:43:05.272085+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.05023",
      "title": "Do Vision-Language Models Respect Contextual Integrity in Location Disclosure?",
      "authors": [
        "Ruixin Yang",
        "Ethan Mendes",
        "Arthur Wang",
        "James Hays",
        "Sauvik Das",
        "Wei Xu",
        "Alan Ritter"
      ],
      "abstract": "Vision-language models can precisely geolocate images but often fail to align with human privacy expectations, over-disclosing location details in sensitive contexts and being vulnerable to prompt-based attacks. Vision-language models (VLMs) have demonstrated strong performance in image geolocation , a capability further sharpened by frontier multimodal large reasoning models (MLRMs). This poses a significant privacy risk, as these widely accessible models can be exploited to infer sensitive locations from casually shared photos, often at street-level precision, potentially surpassing the level of detail the sharer consented or intended to disclose. While recent work has proposed applying a blanket restriction on geolocation disclosure to combat this risk, these measures fail to distinguish valid geolocation uses from malicious behavior. Instead, VLMs should maintain contextual integrity by reasoning about elements within an image to determine the appropriate level of information disclosure, balancing privacy and utility. To evaluate how well models respect contextual integrity , we introduce VLM-GEOPRIVACY , a benchmark that challenges VLMs to interpret latent social norms and contextual cues in real-world images and determine the appropriate level of location disclosure. Our evaluation of 14 leading VLMs shows that, despite their ability to precisely geolocate images, the models are poorly aligned with human privacy expectations. They often over-disclose in sensitive contexts and are vulnerable to prompt-based attacks . Our results call for new design principles in multimodal systems to incorporate context-conditioned privacy reasoning.",
      "summary_en": "Vision-language models can precisely geolocate images but often fail to align with human privacy expectations, over-disclosing location details in sensitive contexts and being vulnerable to prompt-based attacks.",
      "summary_zh": "视觉语言模型能够精确定位图像地理位置，但往往与人类隐私预期不符，在敏感场景中过度披露位置细节，且易受基于提示的攻击。",
      "hf_url": "https://huggingface.co/papers/2602.05023",
      "arxiv_url": "https://arxiv.org/abs/2602.05023",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05023",
      "github_url": "https://github.com/99starman/VLM-GeoPrivacyBench",
      "upvotes": 2,
      "fetched_at": "2026-02-19T05:42:56.800147+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2601.22345",
      "title": "Failing to Explore: Language Models on Interactive Tasks",
      "authors": [
        "Mahdi JafariRaviz",
        "Keivan Rezaei",
        "Arshia Soltani Moakhar",
        "Zahra Sodagar",
        "Yize Cheng",
        "Soheil Feizi"
      ],
      "abstract": "Language models exhibit limited exploration capabilities in interactive environments, with performance improvements achieved through budget allocation strategies and historical summarization techniques. We evaluate language models on their ability to explore interactive environments under a limited interaction budget. We introduce three parametric tasks with controllable exploration difficulty , spanning continuous and discrete environments. Across state-of-the-art models, we find systematic under-exploration and suboptimal solutions, with performance often significantly worse than simple explore--exploit heuristic baselines and scaling weakly as the budget increases. Finally, we study two lightweight interventions: splitting a fixed budget into parallel executions , which surprisingly improves performance despite a no-gain theoretical result for our tasks, and periodically summarizing the interaction history , which preserves key discoveries and further improves exploration.",
      "summary_en": "Language models exhibit limited exploration capabilities in interactive environments, with performance improvements achieved through budget allocation strategies and historical summarization techniques.",
      "summary_zh": "语言模型在交互环境中的探索能力有限，通过预算分配策略与历史摘要技术可提升其性能。",
      "hf_url": "https://huggingface.co/papers/2601.22345",
      "arxiv_url": "https://arxiv.org/abs/2601.22345",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22345",
      "github_url": "https://github.com/mahdi-jfri/explore-exploit-bench",
      "upvotes": 2,
      "fetched_at": "2026-02-19T05:42:31.725997+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.02159",
      "title": "Focus-dLLM: Accelerating Long-Context Diffusion LLM Inference via Confidence-Guided Context Focusing",
      "authors": [
        "Lingkun Long",
        "Yushi Huang",
        "Shihao Bai",
        "Ruihao Gong",
        "Jun Zhang",
        "Ao Zhou",
        "Jianlei Yang"
      ],
      "abstract": "Focus-dLLM introduces a training-free attention sparsification framework that improves inference efficiency for long-context diffusion large language models by predicting unmasked regions and pruning redundant attention computations. Diffusion Large Language Models (dLLMs) deliver strong long-context processing capability in a non-autoregressive decoding paradigm. However, the considerable computational cost of bidirectional full attention limits the inference efficiency. Although sparse attention is promising, existing methods remain ineffective. This stems from the need to estimate attention importance for tokens yet to be decoded, while the unmasked token positions are unknown during diffusion. In this paper, we present Focus-dLLM, a novel training-free attention sparsification framework tailored for accurate and efficient long-context dLLM inference. Based on the finding that token confidence strongly correlates across adjacent steps, we first design a past confidence-guided indicator to predict unmasked regions. Built upon this, we propose a sink-aware pruning strategy to accurately estimate and remove redundant attention computation, while preserving highly influential attention sinks . To further reduce overhead, this strategy reuses identified sink locations across layers, leveraging the observed cross-layer consistency . Experimental results show that our method offers more than 29times lossless speedup under 32K context length. The code is publicly available at: https://github.com/Longxmas/Focus-dLLM",
      "summary_en": "Focus-dLLM introduces a training-free attention sparsification framework that improves inference efficiency for long-context diffusion large language models by predicting unmasked regions and pruning redundant attention computations.",
      "summary_zh": "Focus-dLLM 提出了一种免训练的注意力稀疏化框架，通过预测未掩码区域并剪枝冗余的注意力计算，提升长上下文扩散大语言模型的推理效率。",
      "hf_url": "https://huggingface.co/papers/2602.02159",
      "arxiv_url": "https://arxiv.org/abs/2602.02159",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02159",
      "github_url": "https://github.com/Longxmas/Focus-dLLM",
      "upvotes": 1,
      "fetched_at": "2026-02-19T05:42:39.077808+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.00298",
      "title": "Assessing Domain-Level Susceptibility to Emergent Misalignment from Narrow Finetuning",
      "authors": [
        "Abhishek Mishra",
        "Mugilan Arulvanan",
        "Reshma Ashok",
        "Polina Petrova",
        "Deepesh Suranjandass",
        "Donnie Winkelmann"
      ],
      "abstract": "Large language models fine-tuned on insecure datasets exhibit increased misalignment rates across diverse domains, with varying vulnerability levels and potential for generalization of misalignment behaviors. Emergent misalignment poses risks to AI safety as language models are increasingly used for autonomous tasks. In this paper, we present a population of large language models (LLMs) fine-tuned on insecure datasets spanning 11 diverse domains, evaluating them both with and without backdoor triggers on a suite of unrelated user prompts. Our evaluation experiments on Qwen2.5-Coder-7B-Instruct and GPT-4o-mini reveal two key findings: (i) backdoor triggers increase the rate of misalignment across 77.8% of domains (average drop: 4.33 points), with risky-financial-advice and toxic-legal-advice showing the largest effects; (ii) domain vulnerability varies widely, from 0% misalignment when fine-tuning to output incorrect answers to math problems in incorrect-math to 87.67% when fine-tuned on gore-movie-trivia. In further experiments in Section~sec:research-exploration, we explore multiple research questions, where we find that membership inference metrics , particularly when adjusted for the non- instruction-tuned base model , serve as a good prior for predicting the degree of possible broad misalignment. Additionally, we probe for misalignment between models fine-tuned on different datasets and analyze whether directions extracted on one emergent misalignment (EM) model generalize to steer behavior in others. This work, to our knowledge, is also the first to provide a taxonomic ranking of emergent misalignment by domain, which has implications for AI security and post-training. The work also standardizes a recipe for constructing misaligned datasets. All code and datasets are publicly available on GitHub.https://github.com/abhishek9909/assessing-domain-emergent-misalignment/tree/main",
      "summary_en": "Large language models fine-tuned on insecure datasets exhibit increased misalignment rates across diverse domains, with varying vulnerability levels and potential for generalization of misalignment behaviors.",
      "summary_zh": "在存在安全问题的数据集上微调的大型语言模型在多个领域表现出更高的不对齐率，脆弱性程度各异，且不对齐行为存在泛化潜力。",
      "hf_url": "https://huggingface.co/papers/2602.00298",
      "arxiv_url": "https://arxiv.org/abs/2602.00298",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.00298",
      "github_url": "",
      "upvotes": 1,
      "fetched_at": "2026-02-19T05:42:34.665554+00:00"
    },
    {
      "date": "2026-02-06",
      "paper_id": "2602.06030",
      "title": "PhysicsAgentABM: Physics-Guided Generative Agent-Based Modeling",
      "authors": [
        "Kavana Venkatesh",
        "Yinhan He",
        "Jundong Li",
        "Jiaming Cui"
      ],
      "abstract": "PhysicsAgentABM introduces a neuro-symbolic framework that combines mechanistic agents with neural models to improve scalable and calibrated simulation across multiple domains. Large language model (LLM)-based multi-agent systems enable expressive agent reasoning but are expensive to scale and poorly calibrated for timestep-aligned state-transition simulation, while classical agent-based models (ABMs) offer interpretability but struggle to integrate rich individual-level signals and non-stationary behaviors. We propose PhysicsAgentABM, which shifts inference to behaviorally coherent agent clusters: state-specialized symbolic agents encode mechanistic transition priors, a multimodal neural transition model captures temporal and interaction dynamics, and uncertainty-aware epistemic fusion yields calibrated cluster-level transition distributions. Individual agents then stochastically realize transitions under local constraints, decoupling population inference from entity-level variability. We further introduce ANCHOR, an LLM agent-driven clustering strategy based on cross-contextual behavioral responses and a novel contrastive loss , reducing LLM calls by up to 6-8 times. Experiments across public health, finance, and social sciences show consistent gains in event-time accuracy and calibration over mechanistic, neural, and LLM baselines. By re-architecting generative ABM around population-level inference with uncertainty-aware neuro-symbolic fusion , PhysicsAgentABM establishes a new paradigm for scalable and calibrated simulation with LLMs.",
      "summary_en": "PhysicsAgentABM introduces a neuro-symbolic framework that combines mechanistic agents with neural models to improve scalable and calibrated simulation across multiple domains.",
      "summary_zh": "PhysicsAgentABM 提出了一种神经符号框架，将机制性智能体与神经模型相结合，以改进跨多个领域的可扩展且校准的模拟。",
      "hf_url": "https://huggingface.co/papers/2602.06030",
      "arxiv_url": "https://arxiv.org/abs/2602.06030",
      "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06030",
      "github_url": "",
      "upvotes": 0,
      "fetched_at": "2026-02-19T05:43:27.257445+00:00"
    }
  ]
}