{
  "date": "2026-02-17",
  "paper_id": "2602.13344",
  "title": "FireRed-Image-Edit-1.0 Techinical Report",
  "authors": [
    "Super Intelligence Team",
    "Changhao Qiao",
    "Chao Hui",
    "Chen Li",
    "Cunzheng Wang",
    "Dejia Song",
    "Jiale Zhang",
    "Jing Li",
    "Qiang Xiang",
    "Runqi Wang",
    "Shuang Sun",
    "Wei Zhu",
    "Xu Tang",
    "Yao Hu",
    "Yibo Chen",
    "Yuhao Huang",
    "Yuxuan Duan",
    "Zhiyi Chen",
    "Ziyuan Guo"
  ],
  "abstract": "FireRed-Image-Edit uses a diffusion transformer with optimized data curation and training methods to achieve state-of-the-art performance in instruction-based image editing, supported by a comprehensive benchmark and novel techniques for data efficiency and optimization stability. We present FireRed-Image-Edit, a diffusion transformer for instruction-based image editing that achieves state-of-the-art performance through systematic optimization of data curation , training methodology , and evaluation design . We construct a 1.6B-sample training corpus, comprising 900M text-to-image and 700M image editing pairs from diverse sources. After rigorous cleaning, stratification, auto-labeling, and two-stage filtering, we retain over 100M high-quality samples balanced between generation and editing, ensuring strong semantic coverage and instruction alignment. Our multi-stage training pipeline progressively builds editing capability via pre-training, supervised fine-tuning, and reinforcement learning. To improve data efficiency, we introduce a Multi-Condition Aware Bucket Sampler for variable-resolution batching and Stochastic Instruction Alignment with dynamic prompt re-indexing. To stabilize optimization and enhance controllability, we propose Asymmetric Gradient Optimization for DPO , DiffusionNFT with layout-aware OCR rewards for text editing, and a differentiable Consistency Loss for identity preservation. We further establish REDEdit-Bench , a comprehensive benchmark spanning 15 editing categories, including newly introduced beautification and low-level enhancement tasks. Extensive experiments on REDEdit-Bench and public benchmarks ( ImgEdit and GEdit ) demonstrate competitive or superior performance against both open-source and proprietary systems. We release code, models, and the benchmark suite to support future research.",
  "summary_en": "FireRed-Image-Edit uses a diffusion transformer with optimized data curation and training methods to achieve state-of-the-art performance in instruction-based image editing, supported by a comprehensive benchmark and novel techniques for data efficiency and optimization stability.",
  "summary_zh": "FireRed-Image-Edit 采用 diffusion transformer，结合优化的数据整理与训练方法，在 instruction-based image editing 中实现了 SOTA 性能，并辅以 comprehensive benchmark 以及提升数据效率和优化稳定性的新技术。",
  "hf_url": "https://huggingface.co/papers/2602.13344",
  "arxiv_url": "https://arxiv.org/abs/2602.13344",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13344",
  "github_url": "https://github.com/FireRedTeam/FireRed-Image-Edit",
  "upvotes": 3,
  "fetched_at": "2026-02-17T15:57:47.256611+00:00"
}