{
  "date": "2026-02-17",
  "paper_id": "2602.12876",
  "title": "BrowseComp-V^3: A Visual, Vertical, and Verifiable Benchmark for Multimodal Browsing Agents",
  "authors": [
    "Huanyao Zhang",
    "Jiepeng Zhou",
    "Bo Li",
    "Bowen Zhou",
    "Yanzhe Dan",
    "Haishan Lu",
    "Zhiyong Cao",
    "Jiaoyang Chen",
    "Yuqian Han",
    "Zinan Sheng",
    "Zhengwei Tao",
    "Hao Liang",
    "Jialong Wu",
    "Yang Shi",
    "Yuanpeng He",
    "Jiaye Lin",
    "Qintong Zhang",
    "Guochen Yan",
    "Runhao Zhao",
    "Zhengpin Li",
    "Xiaohan Yu",
    "Lang Mei"
  ],
  "abstract": "A new benchmark called BrowseComp-V3 challenges multimodal large language models with complex, multi-hop reasoning tasks requiring deep search across text and visual modalities, revealing significant gaps in current capabilities. Multimodal large language models (MLLMs), equipped with increasingly advanced planning and tool-use capabilities, are evolving into autonomous agents capable of performing multimodal web browsing and deep search in open-world environments. However, existing benchmarks for multimodal browsing remain limited in task complexity, evidence accessibility, and evaluation granularity, hindering comprehensive and reproducible assessments of deep search capabilities. To address these limitations, we introduce BrowseComp-V^3, a novel benchmark consisting of 300 carefully curated and challenging questions spanning diverse domains. The benchmark emphasizes deep, multi-level, and cross-modal multi-hop reasoning, where critical evidence is interleaved across textual and visual modalities within and across web pages. All supporting evidence is strictly required to be publicly searchable, ensuring fairness and reproducibility. Beyond final-answer accuracy, we incorporate an expert-validated, subgoal-driven process evaluation mechanism that enables fine-grained analysis of intermediate reasoning behaviors and systematic characterization of capability boundaries. In addition, we propose OmniSeeker, a unified multimodal browsing agent framework integrating diverse web search and visual perception tools. Comprehensive experiments demonstrate that even state-of-the-art models achieve only 36% accuracy on our benchmark, revealing critical bottlenecks in multimodal information integration and fine-grained perception . Our results highlight a fundamental gap between current model capabilities and robust multimodal deep search in real-world settings.",
  "summary_en": "A new benchmark called BrowseComp-V3 challenges multimodal large language models with complex, multi-hop reasoning tasks requiring deep search across text and visual modalities, revealing significant gaps in current capabilities.",
  "summary_zh": "一项名为 BrowseComp-V3 的新基准通过需要在文本和视觉模态间进行深度搜索的复杂多跳推理任务挑战多模态大语言模型，揭示了当前能力的显著差距。",
  "hf_url": "https://huggingface.co/papers/2602.12876",
  "arxiv_url": "https://arxiv.org/abs/2602.12876",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12876",
  "github_url": "",
  "upvotes": 5,
  "fetched_at": "2026-02-17T15:57:44.766475+00:00"
}