{
  "date": "2026-02-17",
  "paper_id": "2602.13346",
  "title": "CellMaster: Collaborative Cell Type Annotation in Single-Cell Analysis",
  "authors": [
    "Zhen Wang",
    "Yiming Gao",
    "Jieyuan Liu",
    "Enze Ma",
    "Jefferson Chen",
    "Mark Antkowiak",
    "Mengzhou Hu",
    "JungHo Kong",
    "Dexter Pratt",
    "Zhiting Hu",
    "Wei Wang",
    "Trey Ideker",
    "Eric P. Xing"
  ],
  "abstract": "CellMaster uses LLM-encoded knowledge for zero-shot cell-type annotation in single-cell RNA sequencing, improving accuracy over existing tools through interpretable rationales without pre-training. Single-cell RNA-seq (scRNA-seq) enables atlas-scale profiling of complex tissues, revealing rare lineages and transient states. Yet, assigning biologically valid cell identities remains a bottleneck because markers are tissue- and state-dependent, and novel states lack references. We present CellMaster, an AI agent that mimics expert practice for zero-shot cell-type annotation . Unlike existing automated tools, CellMaster leverages LLM-encoded knowledge (e.g., GPT-4o) to perform on-the-fly annotation with interpretable rationales , without pre-training or fixed marker databases. Across 9 datasets spanning 8 tissues, CellMaster improved accuracy by 7.1% over best-performing baselines (including CellTypist and scTab ) in automatic mode. With human-in-the-loop refinement, this advantage increased to 18.6%, with a 22.1% gain on subtype populations. The system demonstrates particular strength in rare and novel cell states where baselines often fail. Source code and the web application are available at https://github.com/AnonymousGym/CellMaster{https://github.com/AnonymousGym/CellMaster}.",
  "summary_en": "CellMaster uses LLM-encoded knowledge for zero-shot cell-type annotation in single-cell RNA sequencing, improving accuracy over existing tools through interpretable rationales without pre-training.",
  "summary_zh": "CellMaster利用LLM编码的知识实现单细胞RNA测序的零样本细胞类型注释，通过可解释的依据在不经过预训练的情况下取得了优于现有工具的准确性。",
  "hf_url": "https://huggingface.co/papers/2602.13346",
  "arxiv_url": "https://arxiv.org/abs/2602.13346",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.13346",
  "github_url": "",
  "upvotes": 1,
  "fetched_at": "2026-02-19T06:45:28.805594+00:00"
}