{
  "date": "2026-02-16",
  "paper_id": "2602.12612",
  "title": "Self-EvolveRec: Self-Evolving Recommender Systems with LLM-based Directional Feedback",
  "authors": [
    "Sein Kim",
    "Sangwu Park",
    "Hongseok Kang",
    "Wonjoong Kim",
    "Jimin Seo",
    "Yeonjun In",
    "Kanghoon Yoon",
    "Chanyoung Park"
  ],
  "abstract": "Traditional methods for automating recommender system design, such as Neural Architecture Search (NAS), are often constrained by a fixed search space defined by human priors, limiting innovation to pre-defined operators. While recent LLM-driven code evolution frameworks shift fixed search space target to open-ended program spaces, they primarily rely on scalar metrics (e.g., NDCG, Hit Ratio) that fail to provide qualitative insights into model failures or directional guidance for improvement. To address this, we propose Self-EvolveRec, a novel framework that establishes a directional feedback loop by integrating a User Simulator for qualitative critiques and a Model Diagnosis Tool for quantitative internal verification. Furthermore, we introduce a Diagnosis Tool - Model Co-Evolution strategy to ensure that evaluation criteria dynamically adapt as the recommendation architecture evolves. Extensive experiments demonstrate that Self-EvolveRec significantly outperforms state-of-the-art NAS and LLM-driven code evolution baselines in both recommendation performance and user satisfaction. Our code is available at https://github.com/Sein-Kim/self_evolverec.",
  "summary_en": "Traditional Neural Architecture Search (NAS) methods are constrained by fixed search spaces defined by human priors, while recent LLM-driven code evolution frameworks rely on scalar metrics such as NDCG and Hit Ratio that lack qualitative insights for directional improvement. We propose Self-EvolveRec, which integrates a User Simulator for qualitative critiques and a Model Diagnosis Tool for quantitative verification to establish directional feedback, and introduces a Diagnosis Tool - Model Co-Evolution strategy to dynamically adapt evaluation criteria as recommendation architectures evolve. Extensive experiments demonstrate that Self-EvolveRec significantly outperforms state-of-the-art NAS and LLM-driven code evolution baselines in recommendation performance and user satisfaction.",
  "summary_zh": "传统的 Neural Architecture Search (NAS) 方法受限于由人工先验定义的固定搜索空间，而近期的 LLM-driven code evolution 框架依赖于 NDCG 和 Hit Ratio 等标量指标，缺乏用于定向改进的定性洞察。我们提出了 Self-EvolveRec，其整合 User Simulator 以提供定性批评，并集成 Model Diagnosis Tool 进行定量验证，从而建立定向反馈，同时引入 Diagnosis Tool - Model Co-Evolution 策略，以在推荐架构演进过程中动态调整评估标准。大量实验表明，Self-EvolveRec 在推荐性能和用户满意度方面显著优于最先进的 NAS 和 LLM-driven code evolution 基线。",
  "hf_url": "https://huggingface.co/papers/2602.12612",
  "arxiv_url": "https://arxiv.org/abs/2602.12612",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.12612",
  "github_url": "https://github.com/Sein-Kim/self_evolverec",
  "upvotes": 2,
  "fetched_at": "2026-02-17T09:52:18.321404+00:00"
}