{
  "date": "2026-02-18",
  "paper_id": "2602.15620",
  "title": "STAPO: Stabilizing Reinforcement Learning for LLMs by Silencing Rare Spurious Tokens",
  "authors": [
    "Shiqi Liu",
    "Zeyu He",
    "Guojian Zhan",
    "Letian Tao",
    "Zhilong Zheng",
    "Jiang Wu",
    "Yinuo Wang",
    "Yang Guan",
    "Kehua Sheng",
    "Bo Zhang",
    "Keqiang Li",
    "Jingliang Duan",
    "Shengbo Eben Li"
  ],
  "abstract": "Research identifies spurious tokens as the cause of training instability in reinforcement learning fine-tuning of large language models and proposes a solution that selectively masks problematic gradient updates to improve reasoning performance. Reinforcement Learning (RL) has significantly improved large language model reasoning, but existing RL fine-tuning methods rely heavily on heuristic techniques such as entropy regularization and reweighting to maintain stability. In practice, they often experience late-stage performance collapse, leading to degraded reasoning quality and unstable training. We derive that the magnitude of token-wise policy gradients in RL is negatively correlated with token probability and local policy entropy . Building on this result, we prove that training instability is driven by a tiny fraction of tokens, approximately 0.01\\%, which we term spurious tokens . When such tokens appear in correct responses, they contribute little to the reasoning outcome but inherit the full sequence-level reward, leading to abnormally amplified gradient updates . Motivated by this observation, we propose Spurious-Token-Aware Policy Optimization (STAPO) for large-scale model refining, which selectively masks such updates and renormalizes the loss over valid tokens. Across six mathematical reasoning benchmarks using Qwen 1.7B, 8B, and 14B base models, STAPO consistently demonstrates superior entropy stability and achieves an average performance improvement of 7.13\\% over GRPO , 20- Entropy and JustRL .",
  "summary_en": "Research identifies spurious tokens as the cause of training instability in reinforcement learning fine-tuning of large language models and proposes a solution that selectively masks problematic gradient updates to improve reasoning performance.",
  "summary_zh": "研究发现虚假token是大语言模型强化学习微调中训练不稳定的原因，并提出选择性掩码问题梯度更新的解决方案以提升推理性能。",
  "hf_url": "https://huggingface.co/papers/2602.15620",
  "arxiv_url": "https://arxiv.org/abs/2602.15620",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.15620",
  "github_url": "",
  "upvotes": 2,
  "fetched_at": "2026-02-18T14:10:36.166252+00:00"
}