{
  "date": "2026-02-04",
  "paper_id": "2602.03677",
  "title": "Instruction Anchors: Dissecting the Causal Dynamics of Modality Arbitration",
  "authors": [
    "Yu Zhang",
    "Mufan Xu",
    "Xuefeng Bai",
    "Kehai chen",
    "Pengfei Zhang",
    "Yang Xiang",
    "Min Zhang"
  ],
  "abstract": "Research reveals that instruction tokens act as structural anchors in multimodal large language models, with shallow layers performing non-selective information transfer and deep layers resolving modality competition guided by instruction intent. Modality following serves as the capacity of multimodal large language models (MLLMs) to selectively utilize multimodal contexts based on user instructions. It is fundamental to ensuring safety and reliability in real-world deployments. However, the underlying mechanisms governing this decision-making process remain poorly understood. In this paper, we investigate its working mechanism through an information flow lens . Our findings reveal that instruction tokens function as structural anchors for modality arbitration : Shallow attention layers perform non-selective information transfer, routing multimodal cues to these anchors as a latent buffer; Modality competition is resolved within deep attention layers guided by the instruction intent, while MLP layers exhibit semantic inertia , acting as an adversarial force. Furthermore, we identify a sparse set of specialized attention heads that drive this arbitration. Causal interventions demonstrate that manipulating a mere 5% of these critical heads can decrease the modality-following ratio by 60% through blocking, or increase it by 60% through targeted amplification of failed samples. Our work provides a substantial step toward model transparency and offers a principled framework for the orchestration of multimodal information in MLLMs.",
  "summary_en": "Research reveals that instruction tokens act as structural anchors in multimodal large language models, with shallow layers performing non-selective information transfer and deep layers resolving modality competition guided by instruction intent.",
  "summary_zh": "研究表明，指令token在多模态大语言模型中充当结构锚点，其中浅层执行非选择性信息传递，深层则在指令意图引导下解决模态竞争。",
  "hf_url": "https://huggingface.co/papers/2602.03677",
  "arxiv_url": "https://arxiv.org/abs/2602.03677",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03677",
  "github_url": "",
  "upvotes": 7,
  "fetched_at": "2026-02-19T05:40:42.771316+00:00"
}