{
  "date": "2026-02-04",
  "paper_id": "2602.03454",
  "title": "Contextualized Visual Personalization in Vision-Language Models",
  "authors": [
    "Yeongtak Oh",
    "Sangwon Yu",
    "Junsung Park",
    "Han Cheol Moon",
    "Jisoo Mok",
    "Sungroh Yoon"
  ],
  "abstract": "CoViP addresses contextualized visual personalization by treating personalized image captioning as a core task and improving capabilities through reinforcement-learning-based post-training and caption-augmented generation. Despite recent progress in vision-language models (VLMs), existing approaches often fail to generate personalized responses based on the user's specific experiences, as they lack the ability to associate visual inputs with a user's accumulated visual-textual context. We newly formalize this challenge as contextualized visual personalization , which requires the visual recognition and textual retrieval of personalized visual experiences by VLMs when interpreting new images. To address this issue, we propose CoViP, a unified framework that treats personalized image captioning as a core task for contextualized visual personalization and improves this capability through reinforcement-learning-based post-training and caption-augmented generation . We further introduce diagnostic evaluations that explicitly rule out textual shortcut solutions and verify whether VLMs truly leverage visual context . Extensive experiments demonstrate that existing open-source and proprietary VLMs exhibit substantial limitations, while CoViP not only improves personalized image captioning but also yields holistic gains across downstream personalization tasks. These results highlight CoViP as a crucial stage for enabling robust and generalizable contextualized visual personalization .",
  "summary_en": "CoViP addresses contextualized visual personalization by treating personalized image captioning as a core task and improving capabilities through reinforcement-learning-based post-training and caption-augmented generation.",
  "summary_zh": "CoViP 通过将个性化图像描述作为核心任务，并借助基于强化学习的后训练与描述增强生成来提升能力，从而应对情境化视觉个性化问题。",
  "hf_url": "https://huggingface.co/papers/2602.03454",
  "arxiv_url": "https://arxiv.org/abs/2602.03454",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03454",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-19T05:40:37.310057+00:00"
}