{
  "date": "2026-02-04",
  "paper_id": "2602.03086",
  "title": "Neural Predictor-Corrector: Solving Homotopy Problems with Reinforcement Learning",
  "authors": [
    "Jiayao Mai",
    "Bangyan Liao",
    "Zhenjun Zhao",
    "Yingping Zeng",
    "Haoang Li",
    "Javier Civera",
    "Tailin Wu",
    "Yi Zhou",
    "Peidong Liu"
  ],
  "abstract": "Neural Predictor-Corrector framework unifies homotopy methods across multiple domains and outperforms classical approaches through learned policies and amortized training. The Homotopy paradigm , a general principle for solving challenging problems, appears across diverse domains such as robust optimization , global optimization , polynomial root-finding, and sampling . Practical solvers for these problems typically follow a predictor-corrector (PC) structure, but rely on hand-crafted heuristics for step sizes and iteration termination, which are often suboptimal and task-specific. To address this, we unify these problems under a single framework, which enables the design of a general neural solver . Building on this unified view, we propose Neural Predictor-Corrector (NPC), which replaces hand-crafted heuristics with automatically learned policies. NPC formulates policy selection as a sequential decision-making problem and leverages reinforcement learning to automatically discover efficient strategies. To further enhance generalization, we introduce an amortized training mechanism, enabling one-time offline training for a class of problems and efficient online inference on new instances. Experiments on four representative homotopy problems demonstrate that our method generalizes effectively to unseen instances. It consistently outperforms classical and specialized baselines in efficiency while demonstrating superior stability across tasks, highlighting the value of unifying homotopy methods into a single neural framework.",
  "summary_en": "Neural Predictor-Corrector framework unifies homotopy methods across multiple domains and outperforms classical approaches through learned policies and amortized training.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nNeural Predictor-Corrector framework unifies homotopy methods across multiple domains and outperforms classical approaches through learned policies and amortized training.",
  "hf_url": "https://huggingface.co/papers/2602.03086",
  "arxiv_url": "https://arxiv.org/abs/2602.03086",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03086",
  "github_url": "",
  "upvotes": 16,
  "fetched_at": "2026-02-19T05:26:54.934293+00:00"
}