{
  "date": "2026-02-04",
  "paper_id": "2602.02676",
  "title": "AdaptMMBench: Benchmarking Adaptive Multimodal Reasoning for Mode Selection and Reasoning Process",
  "authors": [
    "Xintong Zhang",
    "Xiaowen Zhang",
    "Jongrong Wu",
    "Zhi Gao",
    "Shilin Yan",
    "Zhenxin Diao",
    "Kunpeng Gao",
    "Xuanyan Chen",
    "Yuwei Wu",
    "Yunde Jia",
    "Qing Li"
  ],
  "abstract": "AdaptMMBench presents a comprehensive benchmark for evaluating adaptive multimodal reasoning in Vision-Language Models, measuring reasoning mode selection rationality through dynamic difficulty assessment and multi-dimensional process evaluation. Adaptive multimodal reasoning has emerged as a promising frontier in Vision-Language Models (VLMs), aiming to dynamically modulate between tool-augmented visual reasoning and text reasoning to enhance both effectiveness and efficiency. However, existing evaluations rely on static difficulty labels and simplistic metrics, which fail to capture the dynamic nature of difficulty relative to varying model capacities. Consequently, they obscure the distinction between adaptive mode selection and general performance while neglecting fine-grained process analyses. In this paper, we propose AdaptMMBench, a comprehensive benchmark for adaptive multimodal reasoning across five domains: real-world, OCR, GUI, knowledge, and math, encompassing both direct perception and complex reasoning tasks. AdaptMMBench utilizes a Matthews Correlation Coefficient (MCC) metric to evaluate the selection rationality of different reasoning modes, isolating this meta-cognition ability by dynamically identifying task difficulties based on models' capability boundaries. Moreover, AdaptMMBench facilitates multi-dimensional process evaluation across key step coverage , tool effectiveness , and computational efficiency . Our evaluation reveals that while adaptive mode selection scales with model capacity , it notably decouples from final accuracy. Conversely, key step coverage aligns with performance, though tool effectiveness remains highly inconsistent across model architectures.",
  "summary_en": "AdaptMMBench presents a comprehensive benchmark for evaluating adaptive multimodal reasoning in Vision-Language Models, measuring reasoning mode selection rationality through dynamic difficulty assessment and multi-dimensional process evaluation.",
  "summary_zh": "AdaptMMBench 提出了一个用于评估视觉-语言模型中自适应多模态推理的综合基准，通过动态难度评估和多维过程评估来衡量推理模式选择的合理性。",
  "hf_url": "https://huggingface.co/papers/2602.02676",
  "arxiv_url": "https://arxiv.org/abs/2602.02676",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02676",
  "github_url": "https://github.com/xtong-zhang/AdaptMMBench",
  "upvotes": 10,
  "fetched_at": "2026-02-19T05:39:21.060216+00:00"
}