{
  "date": "2026-02-04",
  "paper_id": "2602.03786",
  "title": "AOrchestra: Automating Sub-Agent Creation for Agentic Orchestration",
  "authors": [
    "Jianhao Ruan",
    "Zhihao Xu",
    "Yiran Peng",
    "Fashen Ren",
    "Zhaoyang Yu",
    "Xinbing Liang",
    "Jinyu Xiang",
    "Bang Liu",
    "Chenglin Wu",
    "Yuyu Luo",
    "Jiayi Zhang"
  ],
  "abstract": "AOrchestra is a framework-agnostic agentic system that uses a tuple-based abstraction to dynamically create specialized task executors, achieving improved performance on complex benchmarks through automated agent creation and resource management. Language agents have shown strong promise for task automation . Realizing this promise for increasingly complex, long-horizon tasks has driven the rise of a sub-agent-as-tools paradigm for multi-turn task solving . However, existing designs still lack a dynamic abstraction view of sub-agents, thereby hurting adaptability. We address this challenge with a unified, framework-agnostic agent abstraction that models any agent as a tuple Instruction, Context, Tools, Model. This tuple acts as a compositional recipe for capabilities, enabling the system to spawn specialized executors for each task on demand. Building on this abstraction, we introduce an agentic system AOrchestra, where the central orchestrator concretizes the tuple at each step: it curates task-relevant context, selects tools and models, and delegates execution via on-the-fly automatic agent creation . Such designs enable reducing human engineering efforts, and remain framework-agnostic with plug-and-play support for diverse agents as task executors. It also enables a controllable performance-cost trade-off, allowing the system to approach Pareto-efficient . Across three challenging benchmarks ( GAIA , SWE-Bench , Terminal-Bench ), AOrchestra achieves 16.28% relative improvement against the strongest baseline when paired with Gemini-3-Flash. The code is available at: https://github.com/FoundationAgents/AOrchestra",
  "summary_en": "AOrchestra is a framework-agnostic agentic system that uses a tuple-based abstraction to dynamically create specialized task executors, achieving improved performance on complex benchmarks through automated agent creation and resource management.",
  "summary_zh": "AOrchestra是一个与框架无关的智能体系统，采用基于元组的抽象动态创建专用任务执行器，通过自动化智能体创建和资源管理，在复杂基准测试上实现性能提升。",
  "hf_url": "https://huggingface.co/papers/2602.03786",
  "arxiv_url": "https://arxiv.org/abs/2602.03786",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03786",
  "github_url": "https://github.com/FoundationAgents/AOrchestra",
  "upvotes": 85,
  "fetched_at": "2026-02-19T05:40:49.023194+00:00"
}