{
  "date": "2026-02-04",
  "paper_id": "2602.02380",
  "title": "Unified Personalized Reward Model for Vision Generation",
  "authors": [
    "Yibin Wang",
    "Yuhang Zang",
    "Feng Han",
    "Jiazi Bu",
    "Yujie Zhou",
    "Cheng Jin",
    "Jiaqi Wang"
  ],
  "abstract": "UnifiedReward-Flex combines reward modeling with flexible, context-adaptive reasoning to improve visual generation by dynamically constructing hierarchical assessments based on semantic intent and visual evidence. Recent advancements in multimodal reward models (RMs) have significantly propelled the development of visual generation . Existing frameworks typically adopt Bradley-Terry-style preference modeling or leverage generative VLMs as judges, and subsequently optimize visual generation models via reinforcement learning . However, current RMs suffer from inherent limitations: they often follow a one-size-fits-all paradigm that assumes a monolithic preference distribution or relies on fixed evaluation rubrics. As a result, they are insensitive to content-specific visual cues, leading to systematic misalignment with subjective and context-dependent human preferences. To this end, inspired by human assessment, we propose UnifiedReward-Flex, a unified personalized reward model for vision generation that couples reward modeling with flexible and context-adaptive reasoning . Specifically, given a prompt and the generated visual content, it first interprets the semantic intent and grounds on visual evidence , then dynamically constructs a hierarchical assessment by instantiating fine-grained criteria under both predefined and self-generated high-level dimensions. Our training pipeline follows a two-stage process: (1) we first distill structured, high-quality reasoning traces from advanced closed-source VLMs to bootstrap SFT, equipping the model with flexible and context-adaptive reasoning behaviors; (2) we then perform direct preference optimization (DPO) on carefully curated preference pairs to further strengthen reasoning fidelity and discriminative alignment. To validate the effectiveness, we integrate UnifiedReward-Flex into the GRPO framework for image and video synthesis , and extensive results demonstrate its superiority.",
  "summary_en": "UnifiedReward-Flex combines reward modeling with flexible, context-adaptive reasoning to improve visual generation by dynamically constructing hierarchical assessments based on semantic intent and visual evidence.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nUnifiedReward-Flex combines reward modeling with flexible, context-adaptive reasoning to improve visual generation by dynamically constructing hierarchical assessments based on semantic intent and visual evidence.",
  "hf_url": "https://huggingface.co/papers/2602.02380",
  "arxiv_url": "https://arxiv.org/abs/2602.02380",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02380",
  "github_url": "https://github.com/CodeGoat24/UnifiedReward",
  "upvotes": 20,
  "fetched_at": "2026-02-19T05:39:03.589619+00:00"
}