{
  "date": "2026-02-04",
  "paper_id": "2602.03747",
  "title": "LIVE: Long-horizon Interactive Video World Modeling",
  "authors": [
    "Junchao Huang",
    "Ziyang Ye",
    "Xinting Hu",
    "Tianyu He",
    "Guiyu Zhang",
    "Shaoshuai Shi",
    "Jiang Bian",
    "Li Jiang"
  ],
  "abstract": "LIVE is a long-horizon video world model that uses cycle-consistency and diffusion loss to control error accumulation during extended video generation. Autoregressive video world models predict future visual observations conditioned on actions. While effective over short horizons, these models often struggle with long-horizon generation, as small prediction errors accumulate over time. Prior methods alleviate this by introducing pre-trained teacher models and sequence-level distribution matching, which incur additional computational cost and fail to prevent error propagation beyond the training horizon. In this work, we propose LIVE, a Long-horizon Interactive Video world modEl that enforces bounded error accumulation via a novel cycle-consistency objective , thereby eliminating the need for teacher-based distillation. Specifically, LIVE first performs a forward rollout from ground-truth frames and then applies a reverse generation process to reconstruct the initial state. The diffusion loss is subsequently computed on the reconstructed terminal state, providing an explicit constraint on long-horizon error propagation. Moreover, we provide an unified view that encompasses different approaches and introduce progressive training curriculum to stabilize training. Experiments demonstrate that LIVE achieves state-of-the-art performance on long-horizon benchmarks, generating stable, high-quality videos far beyond training rollout lengths.",
  "summary_en": "LIVE is a long-horizon video world model that uses cycle-consistency and diffusion loss to control error accumulation during extended video generation.",
  "summary_zh": "LIVE是一种长程视频世界模型，利用循环一致性和扩散损失控制长视频生成中的误差累积。",
  "hf_url": "https://huggingface.co/papers/2602.03747",
  "arxiv_url": "https://arxiv.org/abs/2602.03747",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03747",
  "github_url": "https://github.com/Junchao-cs/LIVE",
  "upvotes": 12,
  "fetched_at": "2026-02-19T05:40:46.725114+00:00"
}