{
  "date": "2026-02-04",
  "paper_id": "2602.03798",
  "title": "FullStack-Agent: Enhancing Agentic Full-Stack Web Coding via Development-Oriented Testing and Repository Back-Translation",
  "authors": [
    "Zimu Lu",
    "Houxing Ren",
    "Yunqiao Yang",
    "Ke Wang",
    "Zhuofan Zong",
    "Mingjie Zhan",
    "Hongsheng Li"
  ],
  "abstract": "A unified agent system called FullStack-Agent is introduced to assist non-expert users in developing complex interactive websites by addressing full-stack development challenges through enhanced planning, code editing, and self-improving capabilities. Assisting non-expert users to develop complex interactive websites has become a popular task for LLM-powered code agents. However, existing code agents tend to only generate frontend web pages, masking the lack of real full-stack data processing and storage with fancy visual effects. Notably, constructing production-level full-stack web applications is far more challenging than only generating frontend web pages, demanding careful control of data flow, comprehensive understanding of constantly updating packages and dependencies, and accurate localization of obscure bugs in the codebase. To address these difficulties, we introduce FullStack-Agent, a unified agent system for full-stack agentic coding that consists of three parts: (1) FullStack-Dev, a multi-agent framework with strong planning, code editing , codebase navigation , and bug localization abilities. (2) FullStack-Learn, an innovative data-scaling and self-improving method that back-translates crawled and synthesized website repositories to improve the backbone LLM of FullStack-Dev. (3) FullStack-Bench, a comprehensive benchmark that systematically tests the frontend , backend and database functionalities of the generated website. Our FullStack-Dev outperforms the previous state-of-the-art method by 8.7%, 38.2%, and 15.9% on the frontend , backend , and database test cases respectively. Additionally, FullStack-Learn raises the performance of a 30B model by 9.7%, 9.5%, and 2.8% on the three sets of test cases through self-improvement, demonstrating the effectiveness of our approach. The code is released at https://github.com/mnluzimu/FullStack-Agent.",
  "summary_en": "A unified agent system called FullStack-Agent is introduced to assist non-expert users in developing complex interactive websites by addressing full-stack development challenges through enhanced planning, code editing, and self-improving capabilities.",
  "summary_zh": "本文介绍了一种名为FullStack-Agent的统一智能体系统，该系统通过增强规划、代码编辑和自我改进能力来应对全栈开发挑战，协助非专业用户开发复杂的交互式网站。",
  "hf_url": "https://huggingface.co/papers/2602.03798",
  "arxiv_url": "https://arxiv.org/abs/2602.03798",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03798",
  "github_url": "https://github.com/mnluzimu/FullStack-Agent",
  "upvotes": 10,
  "fetched_at": "2026-02-19T05:27:08.146966+00:00"
}