{
  "date": "2026-02-04",
  "paper_id": "2602.03845",
  "title": "Parallel-Probe: Towards Efficient Parallel Thinking via 2D Probing",
  "authors": [
    "Tong Zheng",
    "Chengsong Huang",
    "Runpeng Dai",
    "Yun He",
    "Rui Liu",
    "Xin Ni",
    "Huiwen Bao",
    "Kaishen Wang",
    "Hongtu Zhu",
    "Jiaxin Huang",
    "Furong Huang",
    "Heng Huang"
  ],
  "abstract": "Parallel-Probe is a training-free controller that optimizes parallel thinking by using consensus-based early stopping and deviation-based branch pruning to reduce computational costs while maintaining accuracy. Parallel thinking has emerged as a promising paradigm for reasoning, yet it imposes significant computational burdens. Existing efficiency methods primarily rely on local, per-trajectory signals and lack principled mechanisms to exploit global dynamics across parallel branches. We introduce 2D probing, an interface that exposes the width-depth dynamics of parallel thinking by periodically eliciting intermediate answers from all branches. Our analysis reveals three key insights: non-monotonic scaling across width-depth allocations, heterogeneous reasoning branch lengths, and early stabilization of global consensus. Guided by these insights, we introduce Parallel-Probe, a training-free controller designed to optimize online parallel thinking . Parallel-Probe employs consensus-based early stopping to regulate reasoning depth and deviation-based branch pruning to dynamically adjust width. Extensive experiments across three benchmarks and multiple models demonstrate that Parallel-Probe establishes a superior Pareto frontier for test-time scaling . Compared to standard majority voting , it reduces sequential tokens by up to 35.8% and total token cost by over 25.8% while maintaining competitive accuracy.",
  "summary_en": "Parallel-Probe is a training-free controller that optimizes parallel thinking by using consensus-based early stopping and deviation-based branch pruning to reduce computational costs while maintaining accuracy.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nParallel-Probe is a training-free controller that optimizes parallel thinking by using consensus-based early stopping and deviation-based branch pruning to reduce computational costs while maintaining accuracy.",
  "hf_url": "https://huggingface.co/papers/2602.03845",
  "arxiv_url": "https://arxiv.org/abs/2602.03845",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03845",
  "github_url": "https://github.com/zhengkid/Parallel-Probe",
  "upvotes": 26,
  "fetched_at": "2026-02-19T05:27:11.131433+00:00"
}