{
  "date": "2026-02-04",
  "paper_id": "2602.03837",
  "title": "Accelerating Scientific Research with Gemini: Case Studies and Common Techniques",
  "authors": [
    "David P. Woodruff",
    "Vincent Cohen-Addad",
    "Lalit Jain",
    "Jieming Mao",
    "Song Zuo",
    "MohammadHossein Bateni",
    "Simina Branzei",
    "Michael P. Brenner",
    "Lin Chen",
    "Ying Feng",
    "Lance Fortnow",
    "Gang Fu",
    "Ziyi Guan",
    "Zahra Hadizadeh",
    "Mohammad T. Hajiaghayi",
    "Mahdi JafariRaviz",
    "Adel Javanmard",
    "Karthik C. S.",
    "Ken-ichi Kawarabayashi",
    "Ravi Kumar",
    "Silvio Lattanzi",
    "Euiwoong Lee"
  ],
  "abstract": "Advanced AI models demonstrate capability in supporting expert-level mathematical discovery and scientific research through collaborative approaches involving proof verification and automated code execution. Recent advances in large language models (LLMs) have opened new avenues for accelerating scientific research. While models are increasingly capable of assisting with routine tasks, their ability to contribute to novel, expert-level mathematical discovery is less understood. We present a collection of case studies demonstrating how researchers have successfully collaborated with advanced AI models, specifically Google's Gemini-based models (in particular Gemini Deep Think and its advanced variants), to solve open problems, refute conjectures, and generate new proofs across diverse areas in theoretical computer science , as well as other areas such as economics, optimization, and physics. Based on these experiences, we extract common techniques for effective human-AI collaboration in theoretical research, such as iterative refinement , problem decomposition , and cross-disciplinary knowledge transfer . While the majority of our results stem from this interactive, conversational methodology, we also highlight specific instances that push beyond standard chat interfaces. These include deploying the model as a rigorous adversarial reviewer to detect subtle flaws in existing proofs, and embedding it within a \"neuro-symbolic\" loop that autonomously writes and executes code to verify complex derivations. Together, these examples highlight the potential of AI not just as a tool for automation, but as a versatile, genuine partner in the creative process of scientific discovery.",
  "summary_en": "Advanced AI models demonstrate capability in supporting expert-level mathematical discovery and scientific research through collaborative approaches involving proof verification and automated code execution.",
  "summary_zh": "先进AI模型展现出通过涉及证明验证和自动代码执行的协作方法支持专家级数学发现与科学研究的能力。",
  "hf_url": "https://huggingface.co/papers/2602.03837",
  "arxiv_url": "https://arxiv.org/abs/2602.03837",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03837",
  "github_url": "",
  "upvotes": 5,
  "fetched_at": "2026-02-19T05:27:10.400263+00:00"
}