{
  "date": "2026-02-19",
  "paper_id": "2602.16008",
  "title": "MAEB: Massive Audio Embedding Benchmark",
  "authors": [
    "Adnan El Assadi",
    "Isaac Chung",
    "Chenghao Xiao",
    "Roman Solomatin",
    "Animesh Jha",
    "Rahul Chand",
    "Silky Singh",
    "Kaitlyn Wang",
    "Ali Sartaz Khan",
    "Marc Moussa Nasser",
    "Sufen Fong",
    "Pengfei He",
    "Alan Xiao",
    "Ayush Sunil Munot",
    "Aditya Shrivastava",
    "Artem Gazizov",
    "Niklas Muennighoff",
    "Kenneth Enevoldsen"
  ],
  "abstract": "MAEB is a large-scale audio benchmark evaluating 50+ models across 30 tasks in speech, music, and environmental sounds, revealing diverse model strengths and establishing correlations with audio LLM performance. We introduce the Massive Audio Embedding Benchmark (MAEB), a large-scale benchmark covering 30 tasks across speech, music, environmental sounds, and cross-modal audio-text reasoning in 100+ languages. We evaluate 50+ models and find that no single model dominates across all tasks: contrastive audio-text models excel at environmental sound classification (e.g., ESC50) but score near random on multilingual speech tasks (e.g., SIB-FLEURS), while speech-pretrained models show the opposite pattern. Clustering remains challenging for all models, with even the best-performing model achieving only modest results. We observe that models excelling on acoustic understanding often perform poorly on linguistic tasks , and vice versa. We also show that the performance of audio encoders on MAEB correlates highly with their performance when used in audio large language models . MAEB is derived from MAEB+, a collection of 98 tasks. MAEB is designed to maintain task diversity while reducing evaluation cost, and it integrates into the MTEB ecosystem for unified evaluation across text, image, and audio modalities. We release MAEB and all 98 tasks along with code and a leaderboard at https://github.com/embeddings-benchmark/mteb.",
  "summary_en": "MAEB is a large-scale audio benchmark evaluating 50+ models across 30 tasks in speech, music, and environmental sounds, revealing diverse model strengths and establishing correlations with audio LLM performance.",
  "summary_zh": "MAEB是一项大规模音频基准，涵盖语音、音乐和环境声音领域的30项任务，对50余个模型进行了评估，揭示了不同模型的优势，并建立了与audio LLM性能的关联。",
  "hf_url": "https://huggingface.co/papers/2602.16008",
  "arxiv_url": "https://arxiv.org/abs/2602.16008",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.16008",
  "github_url": "",
  "upvotes": 13,
  "fetched_at": "2026-02-20T05:30:46.096894+00:00"
}