{
  "date": "2026-02-02",
  "paper_id": "2601.22636",
  "title": "Statistical Estimation of Adversarial Risk in Large Language Models under Best-of-N Sampling",
  "authors": [
    "Mingqian Feng",
    "Xiaodong Liu",
    "Weiwei Yang",
    "Chenliang Xu",
    "Christopher White",
    "Jianfeng Gao"
  ],
  "abstract": "A scaling-aware risk estimation method called SABER is introduced for predicting large-scale adversarial vulnerability in language models through Best-of-N sampling, enabling accurate assessment with reduced computational costs. Large Language Models (LLMs) are typically evaluated for safety under single-shot or low-budget adversarial prompting , which underestimates real-world risk. In practice, attackers can exploit large-scale parallel sampling to repeatedly probe a model until a harmful response is produced. While recent work shows that attack success increases with repeated sampling, principled methods for predicting large-scale adversarial risk remain limited. We propose a scaling-aware Best-of-N estimation of risk, SABER, for modeling jailbreak vulnerability under Best-of-N sampling . We model sample-level success probabilities using a Beta distribution , the conjugate prior of the Bernoulli distribution, and derive an analytic scaling law that enables reliable extrapolation of large-N attack success rate s from small-budget measurements. Using only n=100 samples, our anchored estimator predicts ASR@1000 with a mean absolute error of 1.66, compared to 12.04 for the baseline, which is an 86.2% reduction in estimation error. Our results reveal heterogeneous risk scaling profiles and show that models appearing robust under standard evaluation can experience rapid nonlinear risk amplification under parallel adversarial pressure. This work provides a low-cost, scalable methodology for realistic LLM safety assessment. We will release our code and evaluation scripts upon publication to future research.",
  "summary_en": "A scaling-aware risk estimation method called SABER is introduced for predicting large-scale adversarial vulnerability in language models through Best-of-N sampling, enabling accurate assessment with reduced computational costs.",
  "summary_zh": "提出了一种名为SABER的规模感知风险估计方法，通过Best-of-N采样预测语言模型的大规模对抗性脆弱性，从而在降低计算成本的同时实现准确评估。",
  "hf_url": "https://huggingface.co/papers/2601.22636",
  "arxiv_url": "https://arxiv.org/abs/2601.22636",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22636",
  "github_url": "",
  "upvotes": 21,
  "fetched_at": "2026-02-19T05:35:03.173489+00:00"
}