{
  "date": "2026-02-02",
  "paper_id": "2601.22628",
  "title": "TTCS: Test-Time Curriculum Synthesis for Self-Evolving",
  "authors": [
    "Chengyi Yang",
    "Zhishang Xiang",
    "Yunbo Tang",
    "Zongpei Teng",
    "Chengsong Huang",
    "Fei Long",
    "Yuhan Liu",
    "Jinsong Su"
  ],
  "abstract": "TTCS is a co-evolving test-time training framework that enhances LLM reasoning abilities by iteratively generating challenging question variants and updating a reasoning solver through self-consistency rewards. Test-Time Training offers a promising way to improve the reasoning ability of large language models (LLMs) by adapting the model using only the test questions. However, existing methods struggle with difficult reasoning problems for two reasons: raw test questions are often too difficult to yield high-quality pseudo-labels , and the limited size of test sets makes continuous online updates prone to instability. To address these limitations, we propose TTCS, a co-evolving test-time training framework. Specifically, TTCS initializes two policies from the same pretrained model: a question synthesizer and a reasoning solver . These policies evolve through iterative optimization : the synthesizer generates progressively challenging question variants conditioned on the test questions, creating a structured curriculum tailored to the solver's current capability, while the solver updates itself using self-consistency rewards computed from multiple sampled responses on both original test and synthetic questions. Crucially, the solver's feedback guides the synthesizer to generate questions aligned with the model's current capability, and the generated question variants in turn stabilize the solver's test-time training . Experiments show that TTCS consistently strengthens the reasoning ability on challenging mathematical benchmarks and transfers to general-domain tasks across different LLM backbones, highlighting a scalable path towards dynamically constructing test-time curricula for self-evolving. Our code and implementation details are available at https://github.com/XMUDeepLIT/TTCS.",
  "summary_en": "TTCS is a co-evolving test-time training framework that enhances LLM reasoning abilities by iteratively generating challenging question variants and updating a reasoning solver through self-consistency rewards.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nTTCS is a co-evolving test-time training framework that enhances LLM reasoning abilities by iteratively generating challenging question variants and updating a reasoning solver through self-consistency rewards.",
  "hf_url": "https://huggingface.co/papers/2601.22628",
  "arxiv_url": "https://arxiv.org/abs/2601.22628",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22628",
  "github_url": "https://github.com/XMUDeepLIT/TTCS",
  "upvotes": 35,
  "fetched_at": "2026-02-19T05:35:01.502553+00:00"
}