{
  "date": "2026-02-02",
  "paper_id": "2601.20732",
  "title": "Continual GUI Agents",
  "authors": [
    "Ziwei Liu",
    "Borui Kang",
    "Hangjie Yuan",
    "Zixiang Zhao",
    "Wei Li",
    "Yifan Zhu",
    "Tao Feng"
  ],
  "abstract": "Continual GUI Agents framework addresses performance degradation in dynamic digital environments through reinforcement fine-tuning with novel anchoring rewards that stabilize learning across shifting UI domains and resolutions. As digital environments (data distribution) are in flux, with new GUI data arriving over time-introducing new domains or resolutions-agents trained on static environments deteriorate in performance. In this work, we introduce Continual GUI Agents , a new task that requires GUI agents to perform continual learning under shifted domains and resolutions. We find existing methods fail to maintain stable grounding as GUI distributions shift over time, due to the diversity of UI interaction points and regions in fluxing scenarios. To address this, we introduce GUI-Anchoring in Flux (GUI-AiF), a new reinforcement fine-tuning framework that stabilizes continual learning through two novel rewards: Anchoring Point Reward in Flux ( APR-iF ) and Anchoring Region Reward in Flux ( ARR-iF ). These rewards guide the agents to align with shifting interaction points and regions, mitigating the tendency of existing reward strategies to over-adapt to static grounding cues (e.g., fixed coordinates or element scales). Extensive experiments show GUI-AiF surpasses state-of-the-art baselines. Our work establishes the first continual learning framework for GUI agents , revealing the untapped potential of reinforcement fine-tuning for continual GUI Agents .",
  "summary_en": "Continual GUI Agents framework addresses performance degradation in dynamic digital environments through reinforcement fine-tuning with novel anchoring rewards that stabilize learning across shifting UI domains and resolutions.",
  "summary_zh": "Continual GUI Agents 框架通过强化微调及新颖的锚定奖励解决动态数字环境中的性能退化问题，稳定跨变化 UI 域和分辨率的学习。",
  "hf_url": "https://huggingface.co/papers/2601.20732",
  "arxiv_url": "https://arxiv.org/abs/2601.20732",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.20732",
  "github_url": "",
  "upvotes": 4,
  "fetched_at": "2026-02-19T05:34:26.286498+00:00"
}