{
  "date": "2026-02-02",
  "paper_id": "2601.22837",
  "title": "NativeTok: Native Visual Tokenization for Improved Image Generation",
  "authors": [
    "Bin Wu",
    "Mengqi Huang",
    "Weinan Jia",
    "Zhendong Mao"
  ],
  "abstract": "NativeTok introduces a novel visual tokenization approach that enforces causal dependencies during image encoding, using a Meta Image Transformer and Mixture of Causal Expert Transformer for efficient and coherent image generation. VQ-based image generation typically follows a two-stage pipeline: a tokenizer encodes images into discrete tokens, and a generative model learns their dependencies for reconstruction. However, improved tokenization in the first stage does not necessarily enhance the second-stage generation, as existing methods fail to constrain token dependencies. This mismatch forces the generative model to learn from unordered distributions, leading to bias and weak coherence. To address this, we propose native visual tokenization , which enforces causal dependencies during tokenization . Building on this idea, we introduce NativeTok, a framework that achieves efficient reconstruction while embedding relational constraints within token sequences. NativeTok consists of: (1) a Meta Image Transformer (MIT) for latent image modeling , and (2) a Mixture of Causal Expert Transformer (MoCET), where each lightweight expert block generates a single token conditioned on prior tokens and latent features. We further design a Hierarchical Native Training strategy that updates only new expert blocks, ensuring training efficiency. Extensive experiments demonstrate the effectiveness of NativeTok.",
  "summary_en": "NativeTok introduces a novel visual tokenization approach that enforces causal dependencies during image encoding, using a Meta Image Transformer and Mixture of Causal Expert Transformer for efficient and coherent image generation.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nNativeTok introduces a novel visual tokenization approach that enforces causal dependencies during image encoding, using a Meta Image Transformer and Mixture of Causal Expert Transformer for efficient and coherent image generation.",
  "hf_url": "https://huggingface.co/papers/2601.22837",
  "arxiv_url": "https://arxiv.org/abs/2601.22837",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22837",
  "github_url": "https://github.com/wangbei1/Nativetok",
  "upvotes": 9,
  "fetched_at": "2026-02-19T05:35:15.258481+00:00"
}