{
  "date": "2026-02-02",
  "paper_id": "2601.23228",
  "title": "Scaling Multiagent Systems with Process Rewards",
  "authors": [
    "Ed Li",
    "Junyu Ren",
    "Cat Yan"
  ],
  "abstract": "Multiagent systems are improved through per-action process rewards from AI feedback (MAPPA), enhancing credit assignment and sample efficiency for complex tasks. While multiagent systems have shown promise for tackling complex tasks via specialization, finetuning multiple agents simultaneously faces two key challenges: (1) credit assignment across agents, and (2) sample efficiency of expensive multiagent rollouts. In this work, we propose finetuning multiagent systems with per-action process rewards from AI feedback (MAPPA) to address both. Through assigning credit to individual agent actions rather than only at task completion, MAPPA enables fine-grained supervision without ground truth labels while extracting maximal training signal from each rollout. We demonstrate our approach on competition math problems and tool-augmented data analysis tasks. On unseen math problems, MAPPA achieves +5.0--17.5pp on AIME and +7.8--17.2pp on AMC. For data analysis tasks, our method improves success rate by +12.5pp while quality metrics improve by up to 30%, validating that per-action supervision can lead to improvements across different multiagent system on various domains. By addressing these challenges, our work takes a first step toward scaling multiagent systems for complex, long-horizon tasks with minimal human supervision.",
  "summary_en": "Multiagent systems are improved through per-action process rewards from AI feedback (MAPPA), enhancing credit assignment and sample efficiency for complex tasks.",
  "summary_zh": "通过AI反馈的逐动作过程奖励(MAPPA)改进多智能体系统，增强复杂任务的信用分配与样本效率。",
  "hf_url": "https://huggingface.co/papers/2601.23228",
  "arxiv_url": "https://arxiv.org/abs/2601.23228",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.23228",
  "github_url": "https://github.com/ltjed/multiagent-coaching",
  "upvotes": 7,
  "fetched_at": "2026-02-19T05:35:31.807777+00:00"
}