{
  "date": "2026-02-06",
  "paper_id": "2601.21937",
  "title": "Retrieval-Infused Reasoning Sandbox: A Benchmark for Decoupling Retrieval and Reasoning Capabilities",
  "authors": [
    "Shuangshuang Ying",
    "Zheyu Wang",
    "Yunjian Peng",
    "Jin Chen",
    "Yuhao Wu",
    "Hongbin Lin",
    "Dingyu He",
    "Siyi Liu",
    "Gengchen Yu",
    "YinZhu Piao",
    "Yuchen Wu",
    "Xin Gui",
    "Zhongyuan Peng",
    "Xin Li",
    "Xeron Du",
    "Libo Qin",
    "YiXin Cao",
    "Ge Zhang",
    "Stephen Huang"
  ],
  "abstract": "DeR2 presents a controlled evaluation framework for assessing language models' document-grounded reasoning capabilities by isolating reasoning from retrieval and toolchain decisions. Despite strong performance on existing benchmarks, it remains unclear whether large language models can reason over genuinely novel scientific information. Most evaluations score end-to-end RAG pipelines, where reasoning is confounded with retrieval and toolchain choices, and the signal is further contaminated by parametric memorization and open-web volatility . We introduce DeR2, a controlled deep-research sandbox that isolates document-grounded reasoning while preserving core difficulties of deep search : multi-step synthesis , denoising , and evidence-based conclusion making . DeR2 decouples evidence access from reasoning via four regimes--Instruction-only, Concepts (gold concepts without documents), Related-only (only relevant documents), and Full-set (relevant documents plus topically related distractors)--yielding interpretable regime gaps that operationalize retrieval loss vs. reasoning loss and enable fine-grained error attribution . To prevent parametric leakage, we apply a two-phase validation that requires parametric failure without evidence while ensuring oracle-concept solvability . To ensure reproducibility, each instance provides a frozen document library (drawn from 2023-2025 theoretical papers) with expert-annotated concepts and validated rationales . Experiments across a diverse set of state-of-the-art foundation models reveal substantial variation and significant headroom: some models exhibit mode-switch fragility, performing worse with the Full-set than with Instruction-only, while others show structural concept misuse, correctly naming concepts but failing to execute them as procedures.",
  "summary_en": "DeR2 presents a controlled evaluation framework for assessing language models' document-grounded reasoning capabilities by isolating reasoning from retrieval and toolchain decisions.",
  "summary_zh": "DeR2 提出了一个受控评估框架，通过将推理与检索及工具链决策分离，来评估语言模型的基于文档的推理能力。",
  "hf_url": "https://huggingface.co/papers/2601.21937",
  "arxiv_url": "https://arxiv.org/abs/2601.21937",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.21937",
  "github_url": "https://github.com/Retrieval-Infused-Reasoning-Sandbox/Retrieval-Infused-Reasoning-Sandbox",
  "upvotes": 19,
  "fetched_at": "2026-02-19T05:42:28.931788+00:00"
}