{
  "date": "2026-02-06",
  "paper_id": "2601.21296",
  "title": "Grounding and Enhancing Informativeness and Utility in Dataset Distillation",
  "authors": [
    "Shaobo Wang",
    "Yantai Yang",
    "Guo Chen",
    "Peiru Li",
    "Kaixin Li",
    "Yufa Zhou",
    "Zhaorun Chen",
    "Linfeng Zhang"
  ],
  "abstract": "Dataset distillation method that balances informativeness and utility through game-theoretic and gradient-based optimization techniques, achieving improved performance on ImageNet-1K. Dataset Distillation (DD) seeks to create a compact dataset from a large, real-world dataset. While recent methods often rely on heuristic approaches to balance efficiency and quality, the fundamental relationship between original and synthetic data remains underexplored. This paper revisits knowledge distillation -based dataset distillation within a solid theoretical framework. We introduce the concepts of Informativeness and Utility , capturing crucial information within a sample and essential samples in the training set, respectively. Building on these principles, we define optimal dataset distillation mathematically. We then present InfoUtil, a framework that balances informativeness and utility in synthesizing the distilled dataset. InfoUtil incorporates two key components: (1) game-theoretic informativeness maximization using Shapley Value attribution to extract key information from samples, and (2) principled utility maximization by selecting globally influential samples based on Gradient Norm . These components ensure that the distilled dataset is both informative and utility -optimized. Experiments demonstrate that our method achieves a 6.1\\% performance improvement over the previous state-of-the-art approach on ImageNet-1K dataset using ResNet-18.",
  "summary_en": "Dataset distillation method that balances informativeness and utility through game-theoretic and gradient-based optimization techniques, achieving improved performance on ImageNet-1K.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nDataset distillation method that balances informativeness and utility through game-theoretic and gradient-based optimization techniques, achieving improved performance on ImageNet-1K.",
  "hf_url": "https://huggingface.co/papers/2601.21296",
  "arxiv_url": "https://arxiv.org/abs/2601.21296",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.21296",
  "github_url": "",
  "upvotes": 19,
  "fetched_at": "2026-02-19T05:42:27.594541+00:00"
}