{
  "date": "2026-02-06",
  "paper_id": "2602.05871",
  "title": "Pathwise Test-Time Correction for Autoregressive Long Video Generation",
  "authors": [
    "Xunzhi Xiang",
    "Zixuan Duan",
    "Guiyu Zhang",
    "Haiyu Zhang",
    "Zhe Gao",
    "Junta Wu",
    "Shaofeng Zhang",
    "Tengfei Wang",
    "Qi Fan",
    "Chunchao Guo"
  ],
  "abstract": "Test-Time Correction addresses error accumulation in distilled autoregressive diffusion models for long-video synthesis by using initial frames as reference anchors to calibrate stochastic states during sampling. Distilled autoregressive diffusion models facilitate real-time short video synthesis but suffer from severe error accumulation during long-sequence generation . While existing Test-Time Optimization (TTO) methods prove effective for images or short clips, we identify that they fail to mitigate drift in extended sequences due to unstable reward landscapes and the hypersensitivity of distilled parameters. To overcome these limitations, we introduce Test-Time Correction (TTC), a training-free alternative. Specifically, TTC utilizes the initial frame as a stable reference anchor to calibrate intermediate stochastic states along the sampling trajectory . Extensive experiments demonstrate that our method seamlessly integrates with various distilled models, extending generation lengths with negligible overhead while matching the quality of resource-intensive training-based methods on 30-second benchmarks.",
  "summary_en": "Test-Time Correction addresses error accumulation in distilled autoregressive diffusion models for long-video synthesis by using initial frames as reference anchors to calibrate stochastic states during sampling.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nTest-Time Correction addresses error accumulation in distilled autoregressive diffusion models for long-video synthesis by using initial frames as reference anchors to calibrate stochastic states during sampling.",
  "hf_url": "https://huggingface.co/papers/2602.05871",
  "arxiv_url": "https://arxiv.org/abs/2602.05871",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05871",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-19T05:43:18.139859+00:00"
}