{
  "date": "2026-02-06",
  "paper_id": "2602.05115",
  "title": "SocialVeil: Probing Social Intelligence of Language Agents under Communication Barriers",
  "authors": [
    "Keyang Xuan",
    "Pengda Wang",
    "Chongrui Ye",
    "Haofei Yu",
    "Tal August",
    "Jiaxuan You"
  ],
  "abstract": "SocialVeil presents a social learning environment that simulates communication barriers in LLM interactions, demonstrating significant performance degradation under realistic conditions and limited effectiveness of adaptation strategies. Large language models (LLMs) are increasingly evaluated in interactive environments to test their social intelligence . However, existing benchmarks often assume idealized communication between agents, limiting our ability to diagnose whether LLMs can maintain and repair interactions in more realistic, imperfect settings. To close this gap, we present SocialVeil, a social learning environment that can simulate social interaction under cognitive-difference-induced communication barriers . Grounded in a systematic literature review of communication challenges in human interaction, SocialVeil introduces three representative types of such disruption, semantic vagueness , sociocultural mismatch , and emotional interference . We also introduce two barrier-aware evaluation metrics, unresolved confusion and mutual understanding , to evaluate interaction quality under impaired communication. Experiments across 720 scenarios and four frontier LLMs show that barriers consistently impair performance, with mutual understanding reduced by over 45\\% on average, and confusion elevated by nearly 50\\%. Human evaluations validate the fidelity of these simulated barriers (ICCapprox0.78, Pearson rapprox0.80). We further demonstrate that adaptation strategies ( Repair Instruction and Interactive learning ) only have a modest effect far from barrier-free performance. This work takes a step toward bringing social interaction environments closer to real-world communication, opening opportunities for exploring the social intelligence of LLM agents.",
  "summary_en": "SocialVeil presents a social learning environment that simulates communication barriers in LLM interactions, demonstrating significant performance degradation under realistic conditions and limited effectiveness of adaptation strategies.",
  "summary_zh": "SocialVeil 构建了一个模拟 LLM 交互中通信障碍的社交学习环境，表明在现实条件下性能显著下降，且适应策略的有效性有限。",
  "hf_url": "https://huggingface.co/papers/2602.05115",
  "arxiv_url": "https://arxiv.org/abs/2602.05115",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05115",
  "github_url": "",
  "upvotes": 18,
  "fetched_at": "2026-02-19T05:42:59.481809+00:00"
}