{
  "date": "2026-02-06",
  "paper_id": "2602.05393",
  "title": "Late-to-Early Training: LET LLMs Learn Earlier, So Faster and Better",
  "authors": [
    "Ji Zhao",
    "Yufei Gu",
    "Shitong Shao",
    "Xun Zhou",
    "Liang Xiang",
    "Zeke Xie"
  ],
  "abstract": "Large language models can be trained more efficiently by transferring knowledge from later training phases to earlier layers during initial training, achieving faster convergence and improved performance. As Large Language Models (LLMs) achieve remarkable empirical success through scaling model and data size, pretraining has become increasingly critical yet computationally prohibitive, hindering rapid development. Despite the availability of numerous pretrained LLMs developed at significant computational expense, a fundamental real-world question remains underexplored: Can we leverage existing small pretrained models to accelerate the training of larger models? In this paper, we propose a Late-to-Early Training (LET) paradigm that enables LLMs to explicitly learn later knowledge in earlier steps and earlier layers. The core idea is to guide the early layers of an LLM during early training using representations from the late layers of a pretrained (i.e. late training phase) model. We identify two key mechanisms that drive LET's effectiveness: late-to-early-step learning and late-to-early-layer learning . These mechanisms significantly accelerate training convergence while robustly enhancing both language modeling capabilities and downstream task performance , enabling faster training with superior performance. Extensive experiments on 1.4B and 7B parameter models demonstrate LET's efficiency and effectiveness. Notably, when training a 1.4B LLM on the Pile dataset, our method achieves up to 1.6times speedup with nearly 5\\% improvement in downstream task accuracy compared to standard training, even when using a pretrained model with 10times fewer parameters than the target model.",
  "summary_en": "Large language models can be trained more efficiently by transferring knowledge from later training phases to earlier layers during initial training, achieving faster convergence and improved performance.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nLarge language models can be trained more efficiently by transferring knowledge from later training phases to earlier layers during initial training, achieving faster convergence and improved performance.",
  "hf_url": "https://huggingface.co/papers/2602.05393",
  "arxiv_url": "https://arxiv.org/abs/2602.05393",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05393",
  "github_url": "",
  "upvotes": 7,
  "fetched_at": "2026-02-19T05:43:09.387016+00:00"
}