{
  "date": "2026-02-06",
  "paper_id": "2602.05261",
  "title": "Length-Unbiased Sequence Policy Optimization: Revealing and Controlling Response Length Variation in RLVR",
  "authors": [
    "Fanfan Liu",
    "Youyang Yin",
    "Peng Shi",
    "Siqi Yang",
    "Zhixiong Zeng",
    "Haibo Qiu"
  ],
  "abstract": "Research analyzes RLVR algorithms' impact on response length in LLMs and VLMs, proposing LUSPO to eliminate length bias and improve reasoning performance. Recent applications of Reinforcement Learning with Verifiable Rewards (RLVR) to Large Language Models ( LLMs ) and Vision-Language Models (VLMs) have demonstrated significant success in enhancing reasoning capabilities for complex tasks. During RLVR training, an increase in response length is often regarded as a key factor contributing to the growth of reasoning ability. However, the patterns of change in response length vary significantly across different RLVR algorithms during the training process. To provide a fundamental explanation for these variations, this paper conducts an in-depth analysis of the components of mainstream RLVR algorithms. We present a theoretical analysis of the factors influencing response length and validate our theory through extensive experimentation. Building upon these theoretical findings, we propose the Length-Unbiased Sequence Policy Optimization (LUSPO) algorithm. Specifically, we rectify the length bias inherent in Group Sequence Policy Optimization (GSPO), rendering its loss function unbiased with respect to response length and thereby resolving the issue of response length collapse. We conduct extensive experiments across mathematical reasoning benchmarks and multimodal reasoning scenarios, where LUSPO consistently achieves superior performance. Empirical results demonstrate that LUSPO represents a novel, state-of-the-art optimization strategy compared to existing methods such as GRPO and GSPO.",
  "summary_en": "Research analyzes RLVR algorithms' impact on response length in LLMs and VLMs, proposing LUSPO to eliminate length bias and improve reasoning performance.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nResearch analyzes RLVR algorithms' impact on response length in LLMs and VLMs, proposing LUSPO to eliminate length bias and improve reasoning performance.",
  "hf_url": "https://huggingface.co/papers/2602.05261",
  "arxiv_url": "https://arxiv.org/abs/2602.05261",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05261",
  "github_url": "https://github.com/murphy4122/LUSPO",
  "upvotes": 49,
  "fetched_at": "2026-02-19T05:43:03.826230+00:00"
}