{
  "date": "2026-02-06",
  "paper_id": "2602.05386",
  "title": "Spider-Sense: Intrinsic Risk Sensing for Efficient Agent Defense with Hierarchical Adaptive Screening",
  "authors": [
    "Zhenxiong Yu",
    "Zhi Yang",
    "Zhiheng Jin",
    "Shuhe Wang",
    "Heng Zhang",
    "Yanlin Fei",
    "Lingfeng Zeng",
    "Fangqi Lou",
    "Shuo Zhang",
    "Tu Hu",
    "Jingping Liu",
    "Rongze Chen",
    "Xingyu Zhu",
    "Kunyi Wang",
    "Chaofa Yuan",
    "Xin Guo",
    "Zhaowei Liu",
    "Feipeng Zhang",
    "Jie Huang",
    "Huacan Wang",
    "Ronghao Chen",
    "Liwen Zhang"
  ],
  "abstract": "Spider-Sense framework provides intrinsic and selective agent security through event-driven defense with intrinsic risk sensing, achieving low attack success and false positive rates with minimal latency overhead. As large language models (LLMs) evolve into autonomous agents , their real-world applicability has expanded significantly, accompanied by new security challenges . Most existing agent defense mechanisms adopt a mandatory checking paradigm , in which security validation is forcibly triggered at predefined stages of the agent lifecycle. In this work, we argue that effective agent security should be intrinsic and selective rather than architecturally decoupled and mandatory. We propose Spider-Sense framework, an event-driven defense framework based on Intrinsic Risk Sensing (IRS), which allows agents to maintain latent vigilance and trigger defenses only upon risk perception. Once triggered, the Spider-Sense invokes a hierarchical defence mechanism that trades off efficiency and precision: it resolves known patterns via lightweight similarity matching while escalating ambiguous cases to deep internal reasoning , thereby eliminating reliance on external models. To facilitate rigorous evaluation, we introduce S^2Bench, a lifecycle-aware benchmark featuring realistic tool execution and multi-stage attacks. Extensive experiments demonstrate that Spider-Sense achieves competitive or superior defense performance, attaining the lowest Attack Success Rate (ASR) and False Positive Rate (FPR), with only a marginal latency overhead of 8.3\\%.",
  "summary_en": "Spider-Sense framework provides intrinsic and selective agent security through event-driven defense with intrinsic risk sensing, achieving low attack success and false positive rates with minimal latency overhead.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nSpider-Sense framework provides intrinsic and selective agent security through event-driven defense with intrinsic risk sensing, achieving low attack success and false positive rates with minimal latency overhead.",
  "hf_url": "https://huggingface.co/papers/2602.05386",
  "arxiv_url": "https://arxiv.org/abs/2602.05386",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.05386",
  "github_url": "https://github.com/aifinlab/Spider-Sense",
  "upvotes": 69,
  "fetched_at": "2026-02-19T05:43:08.010462+00:00"
}