{
  "date": "2026-02-06",
  "paper_id": "2602.03338",
  "title": "Accurate Failure Prediction in Agents Does Not Imply Effective Failure Prevention",
  "authors": [
    "Rakshith Vasudev",
    "Melisa Russak",
    "Dan Bikel",
    "Waseem Alshikh"
  ],
  "abstract": "LLM critic models with high offline accuracy can cause variable performance impacts at deployment, necessitating pre-deployment testing to determine intervention safety and effectiveness. Proactive interventions by LLM critic models are often assumed to improve reliability, yet their effects at deployment time are poorly understood. We show that a binary LLM critic with strong offline accuracy ( AUROC 0.94) can nevertheless cause severe performance degradation, inducing a 26 percentage point (pp) collapse on one model while affecting another by near zero pp. This variability demonstrates that LLM critic accuracy alone is insufficient to determine whether intervention is safe. We identify a disruption-recovery tradeoff : interventions may recover failing trajectories but also disrupt trajectories that would have succeeded. Based on this insight, we propose a pre-deployment test that uses a small pilot of 50 tasks to estimate whether intervention is likely to help or harm, without requiring full deployment. Across benchmarks, the test correctly anticipates outcomes: intervention degrades performance on high-success tasks (0 to -26 pp), while yielding a modest improvement on the high-failure ALFWorld benchmark (+2.8 pp, p=0.014). The primary value of our framework is therefore identifying when not to intervene, preventing severe regressions before deployment.",
  "summary_en": "LLM critic models with high offline accuracy can cause variable performance impacts at deployment, necessitating pre-deployment testing to determine intervention safety and effectiveness.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nLLM critic models with high offline accuracy can cause variable performance impacts at deployment, necessitating pre-deployment testing to determine intervention safety and effectiveness.",
  "hf_url": "https://huggingface.co/papers/2602.03338",
  "arxiv_url": "https://arxiv.org/abs/2602.03338",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.03338",
  "github_url": "",
  "upvotes": 26,
  "fetched_at": "2026-02-19T05:42:44.852414+00:00"
}