{
  "date": "2026-02-06",
  "paper_id": "2602.06036",
  "title": "DFlash: Block Diffusion for Flash Speculative Decoding",
  "authors": [
    "Jian Chen",
    "Yesheng Liang",
    "Zhijian Liu"
  ],
  "abstract": "DFlash is a speculative decoding framework that uses a lightweight block diffusion model for parallel token drafting, achieving significant speedup over existing autoregressive methods while maintaining high-quality outputs. Autoregressive large language models (LLMs) deliver strong performance but require inherently sequential decoding, leading to high inference latency and poor GPU utilization. Speculative decoding mitigates this bottleneck by using a fast draft model whose outputs are verified in parallel by the target LLM; however, existing methods still rely on autoregressive drafting, which remains sequential and limits practical speedups. Diffusion LLMs offer a promising alternative by enabling parallel generation , but current diffusion models typically underperform compared with autoregressive models. In this paper, we introduce DFlash, a speculative decoding framework that employs a lightweight block diffusion model for parallel drafting. By generating draft tokens in a single forward pass and conditioning the draft model on context features extracted from the target model, DFlash enables efficient drafting with high-quality outputs and higher acceptance rates . Experiments show that DFlash achieves over 6x lossless acceleration across a range of models and tasks, delivering up to 2.5x higher speedup than the state-of-the-art speculative decoding method EAGLE-3 .",
  "summary_en": "DFlash is a speculative decoding framework that uses a lightweight block diffusion model for parallel token drafting, achieving significant speedup over existing autoregressive methods while maintaining high-quality outputs.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nDFlash is a speculative decoding framework that uses a lightweight block diffusion model for parallel token drafting, achieving significant speedup over existing autoregressive methods while maintaining high-quality outputs.",
  "hf_url": "https://huggingface.co/papers/2602.06036",
  "arxiv_url": "https://arxiv.org/abs/2602.06036",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06036",
  "github_url": "https://github.com/z-lab/dflash",
  "upvotes": 41,
  "fetched_at": "2026-02-19T05:43:31.661470+00:00"
}