{
  "date": "2026-02-06",
  "paper_id": "2602.06035",
  "title": "InterPrior: Scaling Generative Control for Physics-Based Human-Object Interactions",
  "authors": [
    "Sirui Xu",
    "Samuel Schulter",
    "Morteza Ziyadi",
    "Xialin He",
    "Xiaohan Fei",
    "Yu-Xiong Wang",
    "Liangyan Gui"
  ],
  "abstract": "A scalable framework called InterPrior learns a unified generative controller through imitation learning and reinforcement learning to enable humanoids to generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination. Humans rarely plan whole-body interactions with objects at the level of explicit whole-body movements. High-level intentions, such as affordance, define the goal, while coordinated balance, contact, and manipulation can emerge naturally from underlying physical and motor priors. Scaling such priors is key to enabling humanoids to compose and generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination . To this end, we introduce InterPrior, a scalable framework that learns a unified generative controller through large-scale imitation pretraining and post-training by reinforcement learning . InterPrior first distills a full-reference imitation expert into a versatile, goal-conditioned variational policy that reconstructs motion from multimodal observations and high-level intent. While the distilled policy reconstructs training behaviors, it does not generalize reliably due to the vast configuration space of large-scale human-object interactions. To address this, we apply data augmentation with physical perturbations , and then perform reinforcement learning finetuning to improve competence on unseen goals and initializations. Together, these steps consolidate the reconstructed latent skills into a valid manifold, yielding a motion prior that generalizes beyond the training data, e.g., it can incorporate new behaviors such as interactions with unseen objects. We further demonstrate its effectiveness for user-interactive control and its potential for real robot deployment.",
  "summary_en": "A scalable framework called InterPrior learns a unified generative controller through imitation learning and reinforcement learning to enable humanoids to generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nA scalable framework called InterPrior learns a unified generative controller through imitation learning and reinforcement learning to enable humanoids to generalize loco-manipulation skills across diverse contexts while maintaining physically coherent whole-body coordination.",
  "hf_url": "https://huggingface.co/papers/2602.06035",
  "arxiv_url": "https://arxiv.org/abs/2602.06035",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.06035",
  "github_url": "",
  "upvotes": 23,
  "fetched_at": "2026-02-19T05:43:30.224065+00:00"
}