{
  "date": "2026-02-03",
  "paper_id": "2601.20613",
  "title": "AgentIF-OneDay: A Task-level Instruction-Following Benchmark for General AI Agents in Daily Scenarios",
  "authors": [
    "Kaiyuan Chen",
    "Qimin Wu",
    "Taiyu Hou",
    "Tianhao Tang",
    "Xueyu Hu",
    "Yuchen Hou",
    "Bikun Li",
    "Chengming Qian",
    "Guoyin Wang",
    "Haolin Chen",
    "Haotong Tian",
    "Haoye Zhang",
    "Haoyu Bian",
    "Hongbing Pan",
    "Hongkang Zhang",
    "Hongyi Zhou",
    "Jiaqi Cai",
    "Jiewu Rao",
    "Jiyuan Ren",
    "Keduan Huang",
    "Lucia Zhu Huang",
    "Mingyu Yuan"
  ],
  "abstract": "AgentIF-OneDay evaluates AI agents' ability to handle diverse daily tasks through natural language instructions, requiring problem-solving, attachment understanding, and file-based outputs across three user-centric categories. The capacity of AI agents to effectively handle tasks of increasing duration and complexity continues to grow, demonstrating exceptional performance in coding, deep research, and complex problem-solving evaluations. However, in daily scenarios, the perception of these advanced AI capabilities among general users remains limited. We argue that current evaluations prioritize increasing task difficulty without sufficiently addressing the diversity of agentic tasks necessary to cover the daily work, life, and learning activities of a broad demographic. To address this, we propose AgentIF-OneDay, aimed at determining whether general users can utilize natural language instructions and AI agents to complete a diverse array of daily tasks. These tasks require not only solving problems through dialogue but also understanding various attachment types and delivering tangible file-based results. The benchmark is structured around three user-centric categories: Open Workflow Execution , which assesses adherence to explicit and complex workflows; Latent Instruction , which requires agents to infer implicit instructions from attachments; and Iterative Refinement , which involves modifying or expanding upon ongoing work. We employ instance-level rubrics and a refined evaluation pipeline that aligns LLM-based verification with human judgment, achieving an 80.1% agreement rate using Gemini-3-Pro. AgentIF-OneDay comprises 104 tasks covering 767 scoring points. We benchmarked four leading general AI agents and found that agent products built based on APIs and ChatGPT agents based on agent RL remain in the first tier simultaneously. Leading LLM APIs and open-source models have internalized agentic capabilities , enabling AI application teams to develop cutting-edge Agent products.",
  "summary_en": "AgentIF-OneDay evaluates AI agents' ability to handle diverse daily tasks through natural language instructions, requiring problem-solving, attachment understanding, and file-based outputs across three user-centric categories.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nAgentIF-OneDay evaluates AI agents' ability to handle diverse daily tasks through natural language instructions, requiring problem-solving, attachment understanding, and file-based outputs across three user-centric categories.",
  "hf_url": "https://huggingface.co/papers/2601.20613",
  "arxiv_url": "https://arxiv.org/abs/2601.20613",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.20613",
  "github_url": "",
  "upvotes": 10,
  "fetched_at": "2026-02-19T05:35:59.058238+00:00"
}