{
  "date": "2026-02-03",
  "paper_id": "2601.22296",
  "title": "ParalESN: Enabling parallel information processing in Reservoir Computing",
  "authors": [
    "Matteo Pinna",
    "Giacomo Lagomarsini",
    "Andrea Ceni",
    "Claudio Gallicchio"
  ],
  "abstract": "Parallel Echo State Network (ParalESN) addresses reservoir computing limitations by enabling parallel temporal processing through diagonal linear recurrence, maintaining theoretical guarantees while achieving significant computational efficiency gains. Reservoir Computing (RC) has established itself as an efficient paradigm for temporal processing . However, its scalability remains severely constrained by (i) the necessity of processing temporal data sequentially and (ii) the prohibitive memory footprint of high-dimensional reservoirs. In this work, we revisit RC through the lens of structured operators and state space modeling to address these limitations, introducing Parallel Echo State Network (ParalESN). ParalESN enables the construction of high-dimensional and efficient reservoirs based on diagonal linear recurrence in the complex space , enabling parallel processing of temporal data . We provide a theoretical analysis demonstrating that ParalESN preserves the Echo State Property and the universality guarantees of traditional Echo State Networks while admitting an equivalent representation of arbitrary linear reservoirs in the complex diagonal form. Empirically, ParalESN matches the predictive accuracy of traditional RC on time series benchmarks, while delivering substantial computational savings. On 1-D pixel-level classification tasks, ParalESN achieves competitive accuracy with fully trainable neural networks while reducing computational costs and energy consumption by orders of magnitude. Overall, ParalESN offers a promising, scalable, and principled pathway for integrating RC within the deep learning landscape.",
  "summary_en": "Parallel Echo State Network (ParalESN) addresses reservoir computing limitations by enabling parallel temporal processing through diagonal linear recurrence, maintaining theoretical guarantees while achieving significant computational efficiency gains.",
  "summary_zh": "并行回声状态网络（ParalESN）通过使用对角线性递归实现并行时序处理，解决了储备池计算的局限性，在保持理论保证的同时实现了显著的计算效率提升。",
  "hf_url": "https://huggingface.co/papers/2601.22296",
  "arxiv_url": "https://arxiv.org/abs/2601.22296",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22296",
  "github_url": "",
  "upvotes": 1,
  "fetched_at": "2026-02-19T05:36:08.327948+00:00"
}