{
  "date": "2026-02-03",
  "paper_id": "2601.22588",
  "title": "Rethinking LLM-as-a-Judge: Representation-as-a-Judge with Small Language Models via Semantic Capacity Asymmetry",
  "authors": [
    "Zhuochun Li",
    "Yong Zhang",
    "Ming Li",
    "Yuelyu Ji",
    "Yiming Zeng",
    "Ning Cheng",
    "Yun Zhu",
    "Yanmeng Wang",
    "Shaojun Wang",
    "Jing Xiao",
    "Daqing He"
  ],
  "abstract": "Small language models can effectively evaluate outputs by leveraging internal representations rather than generating responses, enabling a more efficient and interpretable evaluation approach through a probing-based framework. Large language models (LLMs) are widely used as reference-free evaluators via prompting, but this \" LLM-as-a-Judge \" paradigm is costly, opaque, and sensitive to prompt design. In this work, we investigate whether smaller models can serve as efficient evaluators by leveraging internal representations instead of surface generation. We uncover a consistent empirical pattern: small LMs, despite with weak generative ability, encode rich evaluative signals in their hidden states . This motivates us to propose the Semantic Capacity Asymmetry Hypothesis: evaluation requires significantly less semantic capacity than generation and can be grounded in intermediate representations, suggesting that evaluation does not necessarily need to rely on large-scale generative models but can instead leverage latent features from smaller ones. Our findings motivate a paradigm shift from LLM-as-a-Judge to Representation-as-a-Judge , a decoding-free evaluation strategy that probes internal model structure rather than relying on prompted output. We instantiate this paradigm through INSPECTOR, a probing-based framework that predicts aspect-level evaluation scores from small model representations. Experiments on reasoning benchmarks (GSM8K, MATH, GPQA) show that INSPECTOR substantially outperforms prompting-based small LMs and closely approximates full LLM judges, while offering a more efficient, reliable, and interpretable alternative for scalable evaluation.",
  "summary_en": "Small language models can effectively evaluate outputs by leveraging internal representations rather than generating responses, enabling a more efficient and interpretable evaluation approach through a probing-based framework.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nSmall language models can effectively evaluate outputs by leveraging internal representations rather than generating responses, enabling a more efficient and interpretable evaluation approach through a probing-based framework.",
  "hf_url": "https://huggingface.co/papers/2601.22588",
  "arxiv_url": "https://arxiv.org/abs/2601.22588",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2601.22588",
  "github_url": "https://github.com/zhuochunli/Representation-as-a-judge",
  "upvotes": 5,
  "fetched_at": "2026-02-19T05:36:10.479757+00:00"
}