{
  "date": "2026-02-03",
  "paper_id": "2602.02486",
  "title": "RE-TRAC: REcursive TRAjectory Compression for Deep Search Agents",
  "authors": [
    "Jialiang Zhu",
    "Gongrui Zhang",
    "Xiaolong Ma",
    "Lin Xu",
    "Miaosen Zhang",
    "Ruiqi Yang",
    "Song Wang",
    "Kai Qiu",
    "Zhirong Wu",
    "Qi Dai",
    "Ruichun Ma",
    "Bei Liu",
    "Yifan Yang",
    "Chong Luo",
    "Zhengyuan Yang",
    "Linjie Li",
    "Lijuan Wang",
    "Weizhu Chen",
    "Xin Geng",
    "Baining Guo"
  ],
  "abstract": "Re-TRAC is an agentic framework that enhances LLM-based research agents by enabling cross-trajectory exploration and iterative reflection through structured state representations, leading to more efficient and effective problem-solving compared to traditional ReAct approaches. LLM-based deep research agents are largely built on the ReAct framework . This linear design makes it difficult to revisit earlier states, branch into alternative search directions, or maintain global awareness under long contexts, often leading to local optima, redundant exploration, and inefficient search. We propose Re-TRAC, an agentic framework that performs cross-trajectory exploration by generating a structured state representation after each trajectory to summarize evidence, uncertainties, failures, and future plans, and conditioning subsequent trajectories on this state representation. This enables iterative reflection and globally informed planning , reframing research as a progressive process. Empirical results show that Re-TRAC consistently outperforms ReAct by 15-20% on BrowseComp with frontier LLMs. For smaller models, we introduce Re-TRAC-aware supervised fine-tuning , achieving state-of-the-art performance at comparable scales. Notably, Re-TRAC shows a monotonic reduction in tool calls and token usage across rounds, indicating progressively targeted exploration driven by cross-trajectory reflection rather than redundant search.",
  "summary_en": "Re-TRAC is an agentic framework that enhances LLM-based research agents by enabling cross-trajectory exploration and iterative reflection through structured state representations, leading to more efficient and effective problem-solving compared to traditional ReAct approaches.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nRe-TRAC is an agentic framework that enhances LLM-based research agents by enabling cross-trajectory exploration and iterative reflection through structured state representations, leading to more efficient and effective problem-solving compared to traditional ReAct approaches.",
  "hf_url": "https://huggingface.co/papers/2602.02486",
  "arxiv_url": "https://arxiv.org/abs/2602.02486",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.02486",
  "github_url": "https://github.com/microsoft/InfoAgent",
  "upvotes": 18,
  "fetched_at": "2026-02-19T05:38:07.551172+00:00"
}