{
  "date": "2026-02-03",
  "paper_id": "2602.01897",
  "title": "Internal Flow Signatures for Self-Checking and Refinement in LLMs",
  "authors": [
    "Sungheon Jeong",
    "Sanggeon Yun",
    "Ryozo Masukawa",
    "Wenjun Haung",
    "Hanning Chen",
    "Mohsen Imani"
  ],
  "abstract": "Internal flow signatures analyze depthwise dynamics in large language models to enable self-checking and targeted refinement without modifying the base model. Large language models can generate fluent answers that are unfaithful to the provided context, while many safeguards rely on external verification or a separate judge after generation. We introduce internal flow signatures that audit decision formation from depthwise dynamics at a fixed inter-block monitoring boundary. The method stabilizes token-wise motion via bias-centered monitoring , then summarizes trajectories in compact moving readout-aligned subspaces constructed from the top token and its close competitors within each depth window. Neighboring window frames are aligned by an orthogonal transport , yielding depth-comparable transported step lengths , turning angles , and subspace drift summaries that are invariant to within-window basis choices. A lightweight GRU validator trained on these signatures performs self-checking without modifying the base model. Beyond detection, the validator localizes a culprit depth event and enables a targeted refinement : the model rolls back to the culprit token and clamps an abnormal transported step at the identified block while preserving the orthogonal residual. The resulting pipeline provides actionable localization and low-overhead self-checking from internal decision dynamics. Code is available at github.com/EavnJeong/Internal-Flow-Signatures-for- Self-Checking -and-Refinement-in-LLMs.",
  "summary_en": "Internal flow signatures analyze depthwise dynamics in large language models to enable self-checking and targeted refinement without modifying the base model.",
  "summary_zh": "内部流特征分析大语言模型的深度动态，以在不修改基础模型的情况下实现自我检查与针对性优化。",
  "hf_url": "https://huggingface.co/papers/2602.01897",
  "arxiv_url": "https://arxiv.org/abs/2602.01897",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01897",
  "github_url": "https://github.com/EavnJeong/Internal-Flow-Signatures-for-Self-Checking-and-Refinement-in-LLMs",
  "upvotes": 0,
  "fetched_at": "2026-02-19T05:37:20.012786+00:00"
}