{
  "date": "2026-02-03",
  "paper_id": "2602.01851",
  "title": "How Well Do Models Follow Visual Instructions? VIBE: A Systematic Benchmark for Visual Instruction-Driven Image Editing",
  "authors": [
    "Huanyu Zhang",
    "Xuehai Bai",
    "Chengzu Li",
    "Chen Liang",
    "Haochen Tian",
    "Haodong Li",
    "Ruichuan An",
    "Yifan Zhang",
    "Anna Korhonen",
    "Zhang Zhang",
    "Liang Wang",
    "Tieniu Tan"
  ],
  "abstract": "Visual Instruction Benchmark for Image Editing introduces a three-level interaction hierarchy for evaluating visual instruction following capabilities in generative models. Recent generative models have achieved remarkable progress in image editing . However, existing systems and benchmarks remain largely text-guided. In contrast, human communication is inherently multimodal, where visual instructions such as sketches efficiently convey spatial and structural intent. To address this gap, we introduce VIBE, the Visual Instruction Benchmark for Image Editing with a three-level interaction hierarchy that captures deictic grounding , morphological manipulation , and causal reasoning . Across these levels, we curate high-quality and diverse test cases that reflect progressively increasing complexity in visual instruction following . We further propose a robust LMM-as-a-judge evaluation framework with task-specific metrics to enable scalable and fine-grained assessment. Through a comprehensive evaluation of 17 representative open-source and proprietary image editing models, we find that proprietary models exhibit early-stage visual instruction-following capabilities and consistently outperform open-source models. However, performance degrades markedly with increasing task difficulty even for the strongest systems, highlighting promising directions for future research.",
  "summary_en": "Visual Instruction Benchmark for Image Editing introduces a three-level interaction hierarchy for evaluating visual instruction following capabilities in generative models.",
  "summary_zh": "面向图像编辑的视觉指令基准提出了一个三级交互层次结构，用于评估生成模型的视觉指令遵循能力。",
  "hf_url": "https://huggingface.co/papers/2602.01851",
  "arxiv_url": "https://arxiv.org/abs/2602.01851",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01851",
  "github_url": "https://github.com/hwanyu112/VIBE-Benchmark",
  "upvotes": 16,
  "fetched_at": "2026-02-19T05:37:17.917457+00:00"
}