{
  "date": "2026-02-03",
  "paper_id": "2602.01077",
  "title": "PISA: Piecewise Sparse Attention Is Wiser for Efficient Diffusion Transformers",
  "authors": [
    "Haopeng Li",
    "Shitong Shao",
    "Wenliang Zhong",
    "Zikai Zhou",
    "Lichen Bai",
    "Hui Xiong",
    "Zeke Xie"
  ],
  "abstract": "PISA is a novel sparse attention method that improves diffusion transformer efficiency by approximating non-critical attention blocks instead of discarding them, achieving faster processing with maintained quality. Diffusion Transformers are fundamental for video and image generation, but their efficiency is bottlenecked by the quadratic complexity of attention . While block sparse attention accelerates computation by attending only critical key-value blocks, it suffers from degradation at high sparsity by discarding context. In this work, we discover that attention scores of non-critical blocks exhibit distributional stability, allowing them to be approximated accurately and efficiently rather than discarded, which is essentially important for sparse attention design. Motivated by this key insight, we propose PISA, a training-free Piecewise Sparse Attention that covers the full attention span with sub- quadratic complexity . Unlike the conventional keep-or-drop paradigm that directly drop the non-critical block information, PISA introduces a novel exact-or-approximate strategy: it maintains exact computation for critical blocks while efficiently approximating the remainder through block-wise Taylor expansion . This design allows PISA to serve as a faithful proxy to full attention , effectively bridging the gap between speed and quality. Experimental results demonstrate that PISA achieves 1.91 times and 2.57 times speedups on Wan2.1-14B and Hunyuan-Video, respectively, while consistently maintaining the highest quality among sparse attention methods. Notably, even for image generation on FLUX, PISA achieves a 1.2 times acceleration without compromising visual quality . Code is available at: https://github.com/xie-lab-ml/piecewise-sparse- attention .",
  "summary_en": "PISA is a novel sparse attention method that improves diffusion transformer efficiency by approximating non-critical attention blocks instead of discarding them, achieving faster processing with maintained quality.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nPISA is a novel sparse attention method that improves diffusion transformer efficiency by approximating non-critical attention blocks instead of discarding them, achieving faster processing with maintained quality.",
  "hf_url": "https://huggingface.co/papers/2602.01077",
  "arxiv_url": "https://arxiv.org/abs/2602.01077",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01077",
  "github_url": "https://github.com/xie-lab-ml/piecewise-sparse-attention",
  "upvotes": 3,
  "fetched_at": "2026-02-19T05:36:37.264517+00:00"
}