{
  "date": "2026-02-03",
  "paper_id": "2602.01997",
  "title": "On the Limits of Layer Pruning for Generative Reasoning in LLMs",
  "authors": [
    "Safal Shrestha",
    "Anubhav Shrestha",
    "Aadim Nepal",
    "Minwu Kim",
    "Keith Ross"
  ],
  "abstract": "Layer pruning compresses large language models while maintaining classification performance but causes significant degradation in generative reasoning tasks, with limited recovery possible through supervised finetuning on self-generated responses. Recent works have shown that layer pruning can compress large language models (LLMs) while retaining strong performance on classification benchmarks with little or no finetuning. However, existing pruning techniques often suffer severe degradation on generative reasoning tasks . Through a systematic study across multiple model families, we find that tasks requiring multi-step reasoning are particularly sensitive to depth reduction. Beyond surface-level text degeneration, we observe degradation of critical algorithmic capabilities, including arithmetic computation for mathematical reasoning and balanced parenthesis generation for code synthesis. Under realistic post-training constraints, without access to pretraining-scale data or compute, we evaluate a simple mitigation strategy based on supervised finetuning with Self-Generated Responses . This approach achieves strong recovery on classification tasks, retaining up to 90\\% of baseline performance, and yields substantial gains of up to 20--30 percentage points on generative benchmarks compared to prior post-pruning techniques. Crucially, despite these gains, recovery for generative reasoning remains fundamentally limited relative to classification tasks and is viable primarily at lower pruning ratios. Overall, we characterize the practical limits of layer pruning for generative reasoning and provide guidance on when depth reduction can be applied effectively under constrained post-training regimes.",
  "summary_en": "Layer pruning compresses large language models while maintaining classification performance but causes significant degradation in generative reasoning tasks, with limited recovery possible through supervised finetuning on self-generated responses.",
  "summary_zh": "[DUMMY-TRANSLATION] 未配置真实翻译服务，以下保留英文原文。\nLayer pruning compresses large language models while maintaining classification performance but causes significant degradation in generative reasoning tasks, with limited recovery possible through supervised finetuning on self-generated responses.",
  "hf_url": "https://huggingface.co/papers/2602.01997",
  "arxiv_url": "https://arxiv.org/abs/2602.01997",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01997",
  "github_url": "https://github.com/safal312/on-the-limits-of-layer-pruning",
  "upvotes": 4,
  "fetched_at": "2026-02-19T05:37:28.103392+00:00"
}