{
  "date": "2026-02-03",
  "paper_id": "2602.01618",
  "title": "SEA-Guard: Culturally Grounded Multilingual Safeguard for Southeast Asia",
  "authors": [
    "Panuthep Tasawong",
    "Jian Gang Ngui",
    "Alham Fikri Aji",
    "Trevor Cohn",
    "Peerat Limkonchotiwat"
  ],
  "abstract": "Researchers developed a novel agentic data-generation framework to create culturally grounded safety datasets for Southeast Asia, resulting in multilingual safeguard models that outperform existing approaches in detecting regionally sensitive content while maintaining general safety performance. Culturally aware safeguards are crucial for AI alignment in real-world settings, where safety extends beyond common sense and encompasses diverse local values, norms, and region-specific regulations. However, building large-scale, culturally grounded datasets is challenging due to limited resources and a scarcity of native annotators. Consequently, many safeguard models rely on machine translation of English datasets, often missing regional and cultural nuances. We present a novel agentic data-generation framework to scalably create authentic, region-specific safety datasets for Southeast Asia (SEA). On this foundation, we introduce the SEA-Guard family, the first multilingual safeguard models grounded in SEA cultural contexts. Evaluated across multiple benchmarks and cultural variants, SEA-Guard consistently outperforms existing safeguards at detecting regionally sensitive or harmful content while maintaining strong general safety performance.",
  "summary_en": "Researchers developed a novel agentic data-generation framework to create culturally grounded safety datasets for Southeast Asia, resulting in multilingual safeguard models that outperform existing approaches in detecting regionally sensitive content while maintaining general safety performance.",
  "summary_zh": "研究人员开发了一种新型智能体数据生成框架，用于为东南亚创建具有文化根基的安全数据集，由此构建的多语言安全防护模型在检测区域性敏感内容方面优于现有方法，同时保持了通用安全性能。",
  "hf_url": "https://huggingface.co/papers/2602.01618",
  "arxiv_url": "https://arxiv.org/abs/2602.01618",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.01618",
  "github_url": "",
  "upvotes": 2,
  "fetched_at": "2026-02-19T05:37:02.879281+00:00"
}