{
  "date": "2026-02-26",
  "paper_id": "2602.21374",
  "title": "Small Language Models for Privacy-Preserving Clinical Information Extraction in Low-Resource Languages",
  "authors": [
    "Mohammadreza Ghaffarzadeh-Esfahani",
    "Nahid Yousefian",
    "Ebrahim Heidari-Farsani",
    "Ali Akbar Omidvarian",
    "Sepehr Ghahraei",
    "Atena Farangi",
    "AmirBahador Boroumand"
  ],
  "abstract": "A two-step pipeline using translation and small language models demonstrates effective clinical feature extraction from Persian medical transcripts, with larger models showing better performance and bilingual approaches improving sensitivity. Extracting clinical information from medical transcripts in low-resource languages remains a significant challenge in healthcare natural language processing (NLP). This study evaluates a two-step pipeline combining Aya-expanse-8B as a Persian-to-English translation model with five open-source small language models (SLMs) -- Qwen2.5-7B-Instruct, Llama-3.1-8B-Instruct, Llama-3.2-3B-Instruct, Qwen2.5-1.5B-Instruct, and Gemma-3-1B-it -- for binary extraction of 13 clinical features from 1,221 anonymized Persian transcripts collected at a cancer palliative care call center. Using a few-shot prompting strategy without fine-tuning, models were assessed on macro-averaged F1-score , Matthews Correlation Coefficient (MCC), sensitivity , and specificity to account for class imbalance. Qwen2.5-7B-Instruct achieved the highest overall performance (median macro-F1: 0.899; MCC: 0.797), while Gemma-3-1B-it showed the weakest results. Larger models (7B--8B parameters) consistently outperformed smaller counterparts in sensitivity and MCC. A bilingual analysis of Aya-expanse-8B revealed that translating Persian transcripts to English improved sensitivity , reduced missing outputs, and boosted metrics robust to class imbalance, though at the cost of slightly lower specificity and precision. Feature-level results showed reliable extraction of physiological symptoms across most models, whereas psychological complaints, administrative requests, and complex somatic features remained challenging. These findings establish a practical, privacy-preserving blueprint for deploying open-source SLMs in multilingual clinical NLP settings with limited infrastructure and annotation resources, and highlight the importance of jointly optimizing model scale and input language strategy for sensitive healthcare applications.",
  "summary_en": "A two-step pipeline using translation and small language models demonstrates effective clinical feature extraction from Persian medical transcripts, with larger models showing better performance and bilingual approaches improving sensitivity.",
  "summary_zh": "使用翻译与小型语言模型的两步流程，可有效从波斯语医疗转录文本中提取临床特征；较大模型性能更优，双语方法则提升了敏感性。",
  "hf_url": "https://huggingface.co/papers/2602.21374",
  "arxiv_url": "https://arxiv.org/abs/2602.21374",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21374",
  "github_url": "https://github.com/mohammad-gh009/Small-language-models-on-clinical-data-extraction",
  "upvotes": 1,
  "fetched_at": "2026-02-27T01:56:14.728063+00:00"
}