{
  "date": "2026-02-26",
  "paper_id": "2602.21818",
  "title": "SkyReels-V4: Multi-modal Video-Audio Generation, Inpainting and Editing model",
  "authors": [
    "Guibin Chen",
    "Dixuan Lin",
    "Jiangping Yang",
    "Youqiang Zhang",
    "Zhengcong Fei",
    "Debang Li",
    "Sheng Chen",
    "Chaofeng Ao",
    "Nuo Pang",
    "Yiming Wang",
    "Yikun Dou",
    "Zheng Chen",
    "Mingyuan Fan",
    "Tuanhui Li",
    "Mingshan Chang",
    "Hao Zhang",
    "Xiaopeng Sun",
    "Jingtao Xu",
    "Yuqiang Xie",
    "Jiahua Wang",
    "Zhiheng Xu",
    "Weiming Xiong"
  ],
  "abstract": "SkyReels V4 is a unified multimodal video foundation model that generates, edits, and inpaints video and audio simultaneously using a dual-stream architecture with shared text encoding and efficient high-resolution processing. SkyReels V4 is a unified multi modal video foundation model for joint video audio generation , inpainting, and editing. The model adopts a dual stream Multimodal Diffusion Transformer ( MMDiT ) architecture, where one branch synthesizes video and the other generates temporally aligned audio, while sharing a powerful text encoder based on the Multimodal Large Language Models ( MMLM ). SkyReels V4 accepts rich multi modal instructions, including text, images, video clips, masks, and audio references. By combining the MMLM s multi modal instruction following capability with in context learning in the video branch MMDiT , the model can inject fine grained visual guidance under complex conditioning, while the audio branch MMDiT simultaneously leverages audio references to guide sound generation. On the video side, we adopt a channel concatenation formulation that unifies a wide range of inpainting style tasks, such as image to video, video extension, and video editing under a single interface, and naturally extends to vision referenced inpainting and editing via multi modal prompts. SkyReels V4 supports up to 1080p resolution, 32 FPS, and 15 second duration, enabling high fidelity, multi shot, cinema level video generation with synchronized audio. To make such high resolution, long-duration generation computationally feasible, we introduce an efficiency strategy: Joint generation of low resolution full sequences and high-resolution keyframes, followed by dedicated super-resolution and frame interpolation models. To our knowledge, SkyReels V4 is the first video foundation model that simultaneously supports multi-modal input, joint video audio generation , and a unified treatment of generation, inpainting, and editing, while maintaining strong efficiency and quality at cinematic resolutions and durations.",
  "summary_en": "SkyReels V4 is a unified multimodal video foundation model that generates, edits, and inpaints video and audio simultaneously using a dual-stream architecture with shared text encoding and efficient high-resolution processing.",
  "summary_zh": "SkyReels V4 是一种统一的多模态视频基础模型，采用双流架构、共享文本编码和高效的高分辨率处理，可同时生成、编辑和修复视频与音频。",
  "hf_url": "https://huggingface.co/papers/2602.21818",
  "arxiv_url": "https://arxiv.org/abs/2602.21818",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21818",
  "github_url": "",
  "upvotes": 21,
  "fetched_at": "2026-02-27T01:56:23.191816+00:00"
}