{
  "date": "2026-02-26",
  "paper_id": "2602.21472",
  "title": "The Design Space of Tri-Modal Masked Diffusion Models",
  "authors": [
    "Louis Bethune",
    "Victor Turrisi",
    "Bruno Kacper Mlodozeniec",
    "Pau Rodriguez Lopez",
    "Lokesh Boominathan",
    "Nikhil Bhendawade",
    "Amitis Shidani",
    "Joris Pelemans",
    "Theo X. Olausson",
    "Devon Hjelm",
    "Paul Dixon",
    "Joao Monteiro",
    "Pierre Ablin",
    "Vishnu Banna",
    "Arno Blaas",
    "Nick Henderson",
    "Kari Noriy",
    "Dan Busbridge",
    "Josh Susskind",
    "Marco Cuturi",
    "Irina Belousova",
    "Luca Zappella"
  ],
  "abstract": "A large-scale study of tri-modal discrete diffusion models demonstrates improved performance across text, image, and speech generation tasks through systematic analysis of scaling laws and optimized inference methods. Discrete diffusion models have emerged as strong alternatives to autoregressive language models , with recent work initializing and fine-tuning a base unimodal model for bimodal generation . Diverging from previous approaches, we introduce the first tri-modal masked diffusion model pretrained from scratch on text, image-text, and audio-text data. We systematically analyze multimodal scaling laws , modality mixing ratios , noise schedules , and batch-size effects , and we provide optimized inference sampling defaults. Our batch-size analysis yields a novel stochastic differential equation (SDE)-based reparameterization that eliminates the need for tuning the optimal batch size as reported in recent work. This reparameterization decouples the physical batch size, often chosen based on compute constraints (GPU saturation, FLOP efficiency, wall-clock time), from the logical batch size, chosen to balance gradient variance during stochastic optimization . Finally, we pretrain a preliminary 3B-parameter tri-modal model on 6.4T tokens, demonstrating the capabilities of a unified design and achieving strong results in text generation, text-to-image tasks, and text-to-speech tasks. Our work represents the largest-scale systematic open study of multimodal discrete diffusion models conducted to date, providing insights into scaling behaviors across multiple modalities.",
  "summary_en": "A large-scale study of tri-modal discrete diffusion models demonstrates improved performance across text, image, and speech generation tasks through systematic analysis of scaling laws and optimized inference methods.",
  "summary_zh": "一项针对三模态离散扩散模型的大规模研究表明，通过对Scaling Laws的系统分析和推理方法的优化，该模型在文本、图像和语音生成任务中均实现了性能提升。",
  "hf_url": "https://huggingface.co/papers/2602.21472",
  "arxiv_url": "https://arxiv.org/abs/2602.21472",
  "arxiv_pdf_url": "https://arxiv.org/pdf/2602.21472",
  "github_url": "",
  "upvotes": 3,
  "fetched_at": "2026-02-27T01:56:18.774529+00:00"
}